# uncompyle6 version 3.6.7
# Python bytecode 2.7 (62211)
# Decompiled from: Python 3.8.2 (tags/v3.8.2:7b3ab59, Feb 25 2020, 23:03:10) [MSC v.1916 64 bit (AMD64)]
# Embedded file name: build/bdist.linux-i686/egg/alfanous/dynamic_resources/vocalizations_dyn.py
# Compiled at: 2015-06-30 07:27:28
vocalization_dict = {'بقرات': ['بَقَرَاتٍ'], 'تجتنبوا': [
             'تَجْتَنِبُوا'], 
   'بغيا': [
          'بَغْيًا',
          'بَغِيًّا'], 
   'وربائبكم': [
              'وَرَبَائِبُكُمُ'], 
   'فانتصر': [
            'فَانْتَصِرْ'], 
   'تسرحون': [
            'تَسْرَحُونَ'], 
   'الرهب': [
           'الرَّهْبِ'], 
   'ذبابا': [
           'ذُبَابًا'], 
   'بغير': [
          'بِغَيْرِ'], 
   'مرتفقا': [
            'مُرْتَفَقًا'], 
   'يرهقهما': [
             'يُرْهِقَهُمَا'], 
   'ولنا': [
          'وَلَنَا'], 
   'خطاياهم': [
             'خَطَايَاهُمْ'], 
   'فضل': [
         'فَضْلُ',
         'فَضْلٍ',
         'فَضْلِ',
         'فَضَّلَ',
         'فَضْلٌ'], 
   'ليطفئوا': [
             'لِيُطْفِئُوا'], 
   'حسيبا': [
           'حَسِيبًا'], 
   'حساب': [
          'حِسَابٍ'], 
   'فاستغفر': [
             'فَاسْتَغْفِرْ',
             'فَاسْتَغْفَرَ'], 
   'خلقا': [
          'خَلْقًا'], 
   'خافية': [
           'خَافِيَةٌ'], 
   'الموءودة': [
              'الْمَوْءُودَةُ'], 
   'فكذبنا': [
            'فَكَذَّبْنَا'], 
   'نبلوهم': [
            'نَبْلُوهُمْ'], 
   'بخس': [
         'بَخْسٍ'], 
   'ويكفر': [
           'وَيُكَفِّرْ',
           'وَيُكَفِّرُ',
           'وَيُكَفِّرَ'], 
   'سجى': [
         'سَجَى'], 
   'واقترب': [
            'وَاقْتَرِبْ',
            'وَاقْتَرَبَ'], 
   'باسقات': [
            'بَاسِقَاتٍ'], 
   'عليهما': [
            'عَلَيْهِمَا'], 
   'يحييها': [
            'يُحْيِيهَا'], 
   'وتطمئن': [
            'وَتَطْمَئِنُّ',
            'وَتَطْمَئِنَّ'], 
   'بالأنثى': [
             'بِالْأُنْثَى'], 
   'سألتكم': [
            'سَأَلْتُكُمْ'], 
   'قرن': [
         'قَرْنٍ'], 
   'يمكر': [
          'يَمْكُرُ'], 
   'عبثا': [
          'عَبَثًا'], 
   'يتساءلون': [
              'يَتَسَاءَلُونَ'], 
   'آيتك': [
          'آيَتُكَ'], 
   'فكيدون': [
            'فَكِيدُونِ'], 
   'ديارهم': [
            'دِيَارِهِمْ'], 
   'راسيات': [
            'رَاسِيَاتٍ'], 
   'المشركين': [
              'الْمُشْرِكِينَ'], 
   'غضب': [
         'غَضَبٌ',
         'غَضِبَ',
         'غَضَبَ',
         'غَضَبٍ'], 
   'ونجواهم': [
             'وَنَجْوَاهُمْ'], 
   'فإنهم': [
           'فَإِنَّهُمْ'], 
   'الفئتان': [
             'الْفِئَتَانِ'], 
   'يعقوب': [
           'يَعْقُوبَ'], 
   'طلع': [
         'طَلْعٌ'], 
   'أراني': [
           'أَرَانِي'], 
   'أآلهتنا': [
             'أَآلِهَتُنَا'], 
   'فإنها': [
           'فَإِنَّهَا'], 
   'لحب': [
         'لِحُبِّ'], 
   'فضة': [
         'فِضَّةٍ'], 
   'والصديقين': [
               'وَالصِّدِّيقِينَ'], 
   'وأرجلهن': [
             'وَأَرْجُلِهِنَّ'], 
   'فسادا': [
           'فَسَادًا'], 
   'المستأخرين': [
                'الْمُسْتَأْخِرِينَ'], 
   'ينصر': [
          'يَنْصُرُ'], 
   'يصعد': [
          'يَصْعَدُ',
          'يَصَّعَّدُ'], 
   'يخصفان': [
            'يَخْصِفَانِ'], 
   'الخنزير': [
             'الْخِنْزِيرِ'], 
   'يسرنا': [
           'يَسَّرْنَا'], 
   'ولعنهم': [
            'وَلَعَنَهُمْ',
            'وَلَعَنَهُمُ'], 
   'موعظة': [
           'مَوْعِظَةٌ',
           'مَوْعِظَةً'], 
   'دعوت': [
          'دَعَوْتُ'], 
   'أخاف': [
          'أَخَافُ'], 
   'أخاه': [
          'أَخَاهُ'], 
   'ملتنا': [
           'مِلَّتِنَا'], 
   'لابتغوا': [
             'لَابْتَغَوْا'], 
   'لهداكم': [
            'لَهَدَاكُمْ'], 
   'يأب': [
         'يَأْبَ'], 
   'يأت': [
         'يَأْتِ'], 
   'دعوا': [
          'دُعُوا',
          'دَعَوْا',
          'دَعَوُا',
          'دَعَوَا'], 
   'واصبروا': [
             'وَاصْبِرُوا'], 
   'النفوس': [
            'النُّفُوسُ'], 
   'ومساكنكم': [
              'وَمَسَاكِنِكُمْ'], 
   'فافرق': [
           'فَافْرُقْ'], 
   'للسائلين': [
              'لِلسَّائِلِينَ'], 
   'النخيل': [
            'النَّخِيلِ'], 
   'سجدوا': [
           'سَجَدُوا'], 
   'عاقرا': [
           'عَاقِرًا'], 
   'وطعنا': [
           'وَطَعْنًا'], 
   'الكرب': [
           'الْكَرْبِ'], 
   'الكرة': [
           'الْكَرَّةَ'], 
   'يصلوا': [
           'يُصَلُّوا',
           'يَصِلُوا'], 
   'فالق': [
          'فَالِقُ'], 
   'فقولي': [
           'فَقُولِي'], 
   'يمسنا': [
           'يَمَسُّنَا'], 
   'ضاحكة': [
           'ضَاحِكَةٌ'], 
   'شاهدا': [
           'شَاهِدًا'], 
   'أئنكم': [
           'أَئِنَّكُمْ'], 
   'تسعة': [
          'تِسْعَةُ',
          'تِسْعَةَ'], 
   'واسألهم': [
             'وَاسْأَلْهُمْ'], 
   'ضاحكا': [
           'ضَاحِكًا'], 
   'ينصرون': [
            'يُنْصَرُونَ',
            'يَنْصُرُونَ'], 
   'بميثاقهم': [
              'بِمِيثَاقِهِمْ'], 
   'أخوك': [
          'أَخُوكَ'], 
   'وأشفقن': [
            'وَأَشْفَقْنَ'], 
   'أسباب': [
           'أَسْبَابَ'], 
   'ومشارب': [
            'وَمَشَارِبُ'], 
   'يصلون': [
           'يَصِلُونَ',
           'يُصَلُّونَ'], 
   'وأحباؤه': [
             'وَأَحِبَّاؤُهُ'], 
   'الكريم': [
            'الْكَرِيمِ',
            'الْكَرِيمُ'], 
   'وقعودا': [
            'وَقُعُودًا'], 
   'جعلا': [
          'جَعَلَا'], 
   'تسؤكم': [
           'تَسُؤْكُمْ'], 
   'وتركوك': [
            'وَتَرَكُوكَ'], 
   'أعمالا': [
            'أَعْمَالًا'], 
   'ملاقوه': [
            'مُلَاقُوهُ'], 
   'وإثمهما': [
             'وَإِثْمُهُمَا'], 
   'والميسر': [
             'وَالْمَيْسِرِ',
             'وَالْمَيْسِرُ'], 
   'يأن': [
         'يَأْنِ'], 
   'بالنبيين': [
              'بِالنَّبِيِّينَ'], 
   'وتخفي': [
           'وَتُخْفِي'], 
   'يظلمون': [
            'يُظْلَمُونَ',
            'يَظْلِمُونَ'], 
   'فأغشيناهم': [
               'فَأَغْشَيْنَاهُمْ'], 
   'نخاف': [
          'نَخَافُ'], 
   'غرقا': [
          'غَرْقًا'], 
   'وأرضا': [
           'وَأَرْضًا'], 
   'اطمأننتم': [
              'اطْمَأْنَنْتُمْ'], 
   'ليقولوا': [
             'لِيَقُولُوا'], 
   'وسبع': [
          'وَسَبْعِ',
          'وَسَبْعَ'], 
   'زوجا': [
          'زَوْجًا'], 
   'محياهم': [
            'مَحْيَاهُمْ'], 
   'وقاتلوهم': [
              'وَقَاتِلُوهُمْ'], 
   'بالمعتدين': [
               'بِالْمُعْتَدِينَ'], 
   'شقاقي': [
           'شِقَاقِي'], 
   'وآتيناه': [
             'وَآتَيْنَاهُ'], 
   'وسبح': [
          'وَسَبِّحْ'], 
   'ابنوا': [
           'ابْنُوا'], 
   'فاسلكي': [
            'فَاسْلُكِي'], 
   'فتصبح': [
           'فَتُصْبِحُ',
           'فَتُصْبِحَ'], 
   'للمسرفين': [
              'لِلْمُسْرِفِينَ'], 
   'أوكلما': [
            'أَوَكُلَّمَا'], 
   'التجارة': [
             'التِّجَارَةِ'], 
   'لاتبعتم': [
             'لَاتَّبَعْتُمُ'], 
   'الأبصار': [
             'الْأَبْصَارُ',
             'الْأَبْصَارِ',
             'الْأَبْصَارَ'], 
   'يلتفت': [
           'يَلْتَفِتْ'], 
   'أتلو': [
          'أَتْلُوَ'], 
   'السلم': [
           'السَّلَمَ',
           'السِّلْمِ',
           'السَّلْمِ'], 
   'ولأتم': [
           'وَلِأُتِمَّ'], 
   'يدعو': [
          'يَدْعُو'], 
   'نكون': [
          'نَكُونَ'], 
   'حولهم': [
           'حَوْلِهِمْ',
           'حَوْلَهُمْ'], 
   'وأسبغ': [
           'وَأَسْبَغَ'], 
   'علمت': [
          'عَلِمْتَ',
          'عَلِمَتْ',
          'عُلِّمْتَ',
          'عَلِمْتُ',
          'عَلِمَتِ'], 
   'وبركات': [
            'وَبَرَكَاتٍ'], 
   'علما': [
          'عِلْمًا'], 
   'يستأذنوه': [
              'يَسْتَأْذِنُوهُ'], 
   'سيئات': [
           'سَيِّئَاتُ',
           'سَيِّئَاتِ'], 
   'وليقول': [
            'وَلِيَقُولَ'], 
   'يبلس': [
          'يُبْلِسُ'], 
   'أضغانهم': [
             'أَضْغَانَهُمْ'], 
   'زوجت': [
          'زُوِّجَتْ'], 
   'يبلغ': [
          'يَبْلُغَ'], 
   'يخذلكم': [
            'يَخْذُلْكُمْ'], 
   'ليتوبوا': [
             'لِيَتُوبُوا'], 
   'كالظلل': [
            'كَالظُّلَلِ'], 
   'حولها': [
           'حَوْلَهَا'], 
   'فعقروا': [
            'فَعَقَرُوا'], 
   'علمه': [
          'عَلَّمَهُ',
          'عِلْمِهِ'], 
   'حملا': [
          'حِمْلًا',
          'حَمْلًا'], 
   'مرضعة': [
           'مُرْضِعَةٍ'], 
   'متى': [
         'مَتَى'], 
   'السنين': [
            'السِّنِينَ'], 
   'متم': [
         'مُتُّمْ',
         'مِتُّمْ',
         'مُتِمُّ'], 
   'البينات': [
             'الْبَيِّنَاتُ',
             'الْبَيِّنَاتِ'], 
   'شاعر': [
          'شَاعِرٌ',
          'شَاعِرٍ'], 
   'وشفتين': [
            'وَشَفَتَيْنِ'], 
   'أبشرتموني': [
               'أَبَشَّرْتُمُونِي'], 
   'ألوف': [
          'أُلُوفٌ'], 
   'مبشرا': [
           'مُبَشِّرًا'], 
   'بناتك': [
           'بَنَاتِكَ'], 
   'يحاربون': [
             'يُحَارِبُونَ'], 
   'اصلوها': [
            'اصْلَوْهَا'], 
   'عملته': [
           'عَمِلَتْهُ'], 
   'لبالمرصاد': [
               'لَبِالْمِرْصَادِ'], 
   'وللبسنا': [
             'وَلَلَبَسْنَا'], 
   'آياتي': [
           'آيَاتِي',
           'آيَاتِيَ'], 
   'آياته': [
           'آيَاتِهِ',
           'آيَاتُهُ'], 
   'يخيل': [
          'يُخَيَّلُ'], 
   'آياتك': [
           'آيَاتِكَ'], 
   'فأقبره': [
            'فَأَقْبَرَهُ'], 
   'فيعتذرون': [
              'فَيَعْتَذِرُونَ'], 
   'سقاية': [
           'سِقَايَةَ'], 
   'وباليوم': [
             'وَبِالْيَوْمِ'], 
   'وشفاء': [
           'وَشِفَاءٌ'], 
   'تمهيدا': [
            'تَمْهِيدًا'], 
   'أأعجمي': [
            'أَأَعْجَمِيٌّ'], 
   'قصصا': [
          'قَصَصًا'], 
   'أفحسبتم': [
             'أَفَحَسِبْتُمْ'], 
   'بالعشي': [
            'بِالْعَشِيِّ'], 
   'وتركهم': [
            'وَتَرَكَهُمْ'], 
   'أخاهم': [
           'أَخَاهُمْ'], 
   'مدهامتان': [
              'مُدْهَامَّتَانِ'], 
   'لأريناكهم': [
               'لَأَرَيْنَاكَهُمْ'], 
   'عليكما': [
            'عَلَيْكُمَا'], 
   'وأصابه': [
            'وَأَصَابَهُ'], 
   'ونرثه': [
           'وَنَرِثُهُ'], 
   'وطعاما': [
            'وَطَعَامًا'], 
   'ومكرنا': [
            'وَمَكَرْنَا'], 
   'الأشقى': [
            'الْأَشْقَى'], 
   'القتل': [
           'الْقَتْلِ',
           'الْقَتْلُ'], 
   'وأنذر': [
           'وَأَنْذِرْ',
           'وَأَنْذِرِ'], 
   'فاسلك': [
           'فَاسْلُكْ'], 
   'ويصدكم': [
            'وَيَصُدَّكُمْ'], 
   'كصاحب': [
           'كَصَاحِبِ'], 
   'يفقهون': [
            'يَفْقَهُونَ'], 
   'شاء': [
         'شَاءَ'], 
   'برزق': [
          'بِرِزْقٍ'], 
   'وطعامه': [
            'وَطَعَامُهُ'], 
   'فادخلي': [
            'فَادْخُلِي'], 
   'والسابقون': [
               'وَالسَّابِقُونَ'], 
   'المفر': [
           'الْمَفَرُّ'], 
   'الضأن': [
           'الضَّأْنِ'], 
   'بقريب': [
           'بِقَرِيبٍ'], 
   'تدخلوها': [
             'تَدْخُلُوهَا'], 
   'يغني': [
          'يُغْنِي'], 
   'نهيت': [
          'نُهِيتُ'], 
   'يحشر': [
          'يُحْشَرُ',
          'يُحْشَرَ'], 
   'فامنن': [
           'فَامْنُنْ'], 
   'قنوان': [
           'قِنْوَانٌ'], 
   'يلتقطه': [
            'يَلْتَقِطْهُ'], 
   'قتال': [
          'قِتَالٍ',
          'قِتَالٌ'], 
   'يتوفى': [
           'يُتَوَفَّى',
           'يَتَوَفَّى'], 
   'وارعوا': [
            'وَارْعَوْا'], 
   'لحومها': [
            'لُحُومُهَا'], 
   'وآمن': [
          'وَآمَنَ'], 
   'القاهر': [
            'الْقَاهِرُ'], 
   'الظل': [
          'الظِّلِّ',
          'الظِّلُّ',
          'الظِّلَّ'], 
   'تحصنون': [
            'تُحْصِنُونَ'], 
   'آياتها': [
            'آيَاتِهَا'], 
   'طوى': [
         'طُوًى'], 
   'بطون': [
          'بُطُونِ'], 
   'المقتسمين': [
               'الْمُقْتَسِمِينَ'], 
   'يزدهم': [
           'يَزِدْهُمْ'], 
   'وعنب': [
          'وَعِنَبٍ'], 
   'واعلم': [
           'وَاعْلَمْ'], 
   'لجهنم': [
           'لِجَهَنَّمَ'], 
   'صباح': [
          'صَبَاحُ'], 
   'وارزق': [
           'وَارْزُقْ'], 
   'يفسد': [
          'يُفْسِدُ'], 
   'يفسح': [
          'يَفْسَحِ'], 
   'يعمر': [
          'يُعَمَّرُ',
          'يُعَمَّرَ',
          'يَعْمُرُ'], 
   'مطويات': [
            'مَطْوِيَّاتٌ'], 
   'وقومهما': [
             'وَقَوْمُهُمَا',
             'وَقَوْمَهُمَا'], 
   'سائغ': [
          'سَائِغٌ'], 
   'مسندة': [
           'مُسَنَّدَةٌ'], 
   'الشعرى': [
            'الشِّعْرَى'], 
   'خلقكم': [
           'خَلَقَكُمْ',
           'خَلْقِكُمْ',
           'خَلْقُكُمْ'], 
   'اذهبا': [
           'اذْهَبَا'], 
   'إلهكم': [
           'إِلَهُكُمْ',
           'إِلَهُكُمُ',
           'إِلَهَكُمْ'], 
   'فادع': [
          'فَادْعُ'], 
   'لمحيي': [
           'لَمُحْيِي'], 
   'الكعبين': [
             'الْكَعْبَيْنِ'], 
   'تدميرا': [
            'تَدْمِيرًا'], 
   'والأحزاب': [
              'وَالْأَحْزَابُ'], 
   'ليروا': [
           'لِيُرَوْا'], 
   'استقاموا': [
              'اسْتَقَامُوا'], 
   'وأنفسهم': [
             'وَأَنْفُسِهِمْ',
             'وَأَنْفُسُهُمْ',
             'وَأَنْفُسَهُمْ'], 
   'لانفضوا': [
             'لَانْفَضُّوا'], 
   'يعمل': [
          'يَعْمَلْ',
          'يَعْمَلُ'], 
   'نفحة': [
          'نَفْحَةٌ'], 
   'ابن': [
         'ابْنُ',
         'ابْنَ',
         'ابْنِ'], 
   'سائل': [
          'سَائِلٌ'], 
   'لتبشر': [
           'لِتُبَشِّرَ'], 
   'فأنبتنا': [
             'فَأَنْبَتْنَا'], 
   'الهون': [
           'الْهُونِ'], 
   'الصيحة': [
            'الصَّيْحَةُ',
            'الصَّيْحَةَ'], 
   'ليذوقوا': [
             'لِيَذُوقُوا'], 
   'متربصون': [
             'مُتَرَبِّصُونَ'], 
   'لأتخذن': [
            'لَأَتَّخِذَنَّ'], 
   'مسكم': [
          'مَسَّكُمُ'], 
   'مدينين': [
            'مَدِينِينَ'], 
   'ويطاف': [
           'وَيُطَافُ'], 
   'نقبا': [
          'نَقْبًا'], 
   'ذكراهم': [
            'ذِكْرَاهُمْ'], 
   'راكعون': [
            'رَاكِعُونَ'], 
   'حرمها': [
           'حَرَّمَهَا'], 
   'وابتغوا': [
             'وَابْتَغُوا'], 
   'نسله': [
          'نَسْلَهُ'], 
   'فأخرج': [
           'فَأَخْرَجَ'], 
   'مبرمون': [
            'مُبْرِمُونَ'], 
   'يلحقوا': [
            'يَلْحَقُوا'], 
   'أردنا': [
           'أَرَدْنَا'], 
   'وجدنا': [
           'وَجَدْنَا'], 
   'وأنبتها': [
             'وَأَنْبَتَهَا'], 
   'مسرفين': [
            'مُسْرِفِينَ'], 
   'منتصرين': [
             'مُنْتَصِرِينَ'], 
   'وذريته': [
            'وَذُرِّيَّتَهُ'], 
   'وجحيما': [
            'وَجَحِيمًا'], 
   'معنا': [
          'مَعَنَا'], 
   'خالدا': [
           'خَالِدًا'], 
   'يورثها': [
            'يُورِثُهَا'], 
   'يئسن': [
          'يَئِسْنَ'], 
   'الغربي': [
            'الْغَرْبِيِّ'], 
   'أجمعوا': [
            'أَجْمَعُوا'], 
   'للمخلفين': [
              'لِلْمُخَلَّفِينَ'], 
   'الشهوات': [
             'الشَّهَوَاتِ'], 
   'السائل': [
            'السَّائِلَ'], 
   'تنبئونه': [
             'تُنَبِّئُونَهُ'], 
   'شمائلهم': [
             'شَمَائِلِهِمْ'], 
   'بينهم': [
           'بَيْنَهُمْ',
           'بَيْنِهِمْ',
           'بَيْنَهُمُ'], 
   'بينهن': [
           'بَيْنَهُنَّ'], 
   'سادسهم': [
            'سَادِسُهُمْ'], 
   'ورزقني': [
            'وَرَزَقَنِي'], 
   'أرجلكم': [
            'أَرْجُلِكُمْ'], 
   'معرضون': [
            'مُعْرِضُونَ'], 
   'صوابا': [
           'صَوَابًا'], 
   'قتلتموهم': [
              'قَتَلْتُمُوهُمْ'], 
   'سليمان': [
            'سُلَيْمَانَ',
            'سُلَيْمَانُ'], 
   'بأعلم': [
           'بِأَعْلَمَ'], 
   'يضرنا': [
           'يَضُرُّنَا'], 
   'ثعبان': [
           'ثُعْبَانٌ'], 
   'مثلهم': [
           'مِثْلَهُمْ',
           'مَثَلُهُمْ',
           'مِثْلُهُمْ'], 
   'ليزدادوا': [
              'لِيَزْدَادُوا'], 
   'بالعباد': [
             'بِالْعِبَادِ'], 
   'بعشر': [
          'بِعَشْرِ',
          'بِعَشْرٍ'], 
   'المزن': [
           'الْمُزْنِ'], 
   'اسلك': [
          'اسْلُكْ'], 
   'بينها': [
           'بَيْنَهَا'], 
   'ينكح': [
          'يَنْكِحُ',
          'يَنْكِحَ'], 
   'إسماعيل': [
             'إِسْمَاعِيلَ'], 
   'زوجها': [
           'زَوْجَهَا',
           'زَوْجِهَا'], 
   'ينكث': [
          'يَنْكُثُ'], 
   'واليسع': [
            'وَالْيَسَعَ'], 
   'فتاب': [
          'فَتَابَ'], 
   'أنشأكم': [
            'أَنْشَأَكُمْ'], 
   'وأموال': [
            'وَأَمْوَالٌ'], 
   'ينكر': [
          'يُنْكِرُ'], 
   'شفاعة': [
           'شَفَاعَةٌ',
           'شَفَاعَةً',
           'شَفَاعَةُ'], 
   'فلبث': [
          'فَلَبِثَ'], 
   'رهقا': [
          'رَهَقًا'], 
   'تخلق': [
          'تَخْلُقُ'], 
   'أسلم': [
          'أَسْلَمَ',
          'أُسْلِمَ',
          'أَسْلِمْ'], 
   'ويقطعون': [
             'وَيَقْطَعُونَ'], 
   'مشركة': [
           'مُشْرِكَةٍ',
           'مُشْرِكَةً'], 
   'أنزلنا': [
            'أَنْزَلْنَا'], 
   'ورزقا': [
           'وَرِزْقًا'], 
   'فأتموا': [
            'فَأَتِمُّوا'], 
   'لعنوا': [
           'لُعِنُوا'], 
   'يضلله': [
           'يُضْلِلْهُ'], 
   'المصلحين': [
              'الْمُصْلِحِينَ'], 
   'وجبت': [
          'وَجَبَتْ'], 
   'مساكنكم': [
             'مَسَاكِنَكُمْ'], 
   'يملكون': [
            'يَمْلِكُونَ'], 
   'أجمعون': [
            'أَجْمَعُونَ'], 
   'وقابل': [
           'وَقَابِلِ'], 
   'وظلالهم': [
             'وَظِلَالُهُمْ'], 
   'خمسه': [
          'خُمُسَهُ'], 
   'المغرقين': [
              'الْمُغْرَقِينَ'], 
   'ينبأ': [
          'يُنَبَّأْ',
          'يُنَبَّأُ'], 
   'هداكم': [
           'هَدَاكُمْ'], 
   'وكفرت': [
           'وَكَفَرَتْ'], 
   'يخزيهم': [
            'يُخْزِيهِمْ'], 
   'أنبئكم': [
            'أُنَبِّئُكُمْ'], 
   'لأهله': [
           'لِأَهْلِهِ'], 
   'قدرناها': [
             'قَدَّرْنَاهَا'], 
   'ينبت': [
          'يُنْبِتُ'], 
   'أغناهم': [
            'أَغْنَاهُمُ'], 
   'أموالنا': [
             'أَمْوَالِنَا',
             'أَمْوَالُنَا'], 
   'وعصيتم': [
            'وَعَصَيْتُمْ'], 
   'هاديا': [
           'هَادِيًا'], 
   'فأخرجناهم': [
               'فَأَخْرَجْنَاهُمْ'], 
   'شيء': [
         'شَيْءٍ',
         'شَيْءٌ'], 
   'فكذبوه': [
            'فَكَذَّبُوهُ'], 
   'مقدورا': [
            'مَقْدُورًا'], 
   'قسمة': [
          'قِسْمَةٌ'], 
   'مسلمون': [
            'مُسْلِمُونَ'], 
   'وعده': [
          'وَعْدَهُ',
          'وَعْدُهُ',
          'وَعْدِهِ'], 
   'يلبثوا': [
            'يَلْبَثُوا'], 
   'مأواهم': [
            'مَأْوَاهُمْ',
            'مَأْوَاهُمُ'], 
   'الليل': [
           'اللَّيْلِ',
           'اللَّيْلَ',
           'اللَّيْلُ'], 
   'صال': [
         'صَالِ'], 
   'فذوقوا': [
            'فَذُوقُوا'], 
   'غلاظ': [
          'غِلَاظٌ'], 
   'شيع': [
         'شِيَعِ'], 
   'الكافرين': [
              'الْكَافِرِينَ'], 
   'ولقاهم': [
            'وَلَقَّاهُمْ'], 
   'متتابعين': [
              'مُتَتَابِعَيْنِ'], 
   'ورضوان': [
            'وَرِضْوَانٌ',
            'وَرِضْوَانٍ'], 
   'جعلنا': [
           'جَعَلْنَا'], 
   'وينشئ': [
           'وَيُنْشِئُ'], 
   'فكذبوا': [
            'فَكَذَّبُوا'], 
   'لقاء': [
          'لِقَاءَ',
          'لِقَاءِ'], 
   'وعدا': [
          'وَعْدًا'], 
   'لشهادتنا': [
              'لَشَهَادَتُنَا'], 
   'يلبثون': [
            'يَلْبَثُونَ'], 
   'غلام': [
          'غُلَامٌ'], 
   'مدتهم': [
           'مُدَّتِهِمْ'], 
   'يكفهم': [
           'يَكْفِهِمْ'], 
   'وأكلهم': [
            'وَأَكْلِهِمُ',
            'وَأَكْلِهِمْ'], 
   'فقست': [
          'فَقَسَتْ'], 
   'مسلمة': [
           'مُسَلَّمَةٌ',
           'مُسْلِمَةً'], 
   'فطهر': [
          'فَطَهِّرْ'], 
   'تجري': [
          'تَجْرِي'], 
   'أنعم': [
          'أَنْعَمَ'], 
   'قنطوا': [
           'قَنَطُوا'], 
   'مسخرات': [
            'مُسَخَّرَاتٍ',
            'مُسَخَّرَاتٌ'], 
   'فانظر': [
           'فَانْظُرْ'], 
   'فيدخلهم': [
             'فَيُدْخِلُهُمْ'], 
   'آتهم': [
          'آتِهِمْ'], 
   'ترضوا': [
           'تَرْضَوْا'], 
   'بسم': [
         'بِسْمِ'], 
   'فآخران': [
            'فَآخَرَانِ'], 
   'العزيز': [
            'الْعَزِيزُ',
            'الْعَزِيزِ'], 
   'متخذ': [
          'مُتَّخِذَ'], 
   'دهاقا': [
           'دِهَاقًا'], 
   'الغاوون': [
             'الْغَاوُونَ'], 
   'يبدها': [
           'يُبْدِهَا'], 
   'أكثرهم': [
            'أَكْثَرُهُمْ',
            'أَكْثَرَهُمْ',
            'أَكْثَرِهِمْ'], 
   'لقوا': [
          'لَقُوا'], 
   'وشروه': [
           'وَشَرَوْهُ'], 
   'تدع': [
         'تَدْعُ'], 
   'علمني': [
           'عَلَّمَنِي'], 
   'فسبحه': [
           'فَسَبِّحْهُ'], 
   'أأمنتم': [
            'أَأَمِنْتُمْ'], 
   'أيشركون': [
             'أَيُشْرِكُونَ'], 
   'وأبكى': [
           'وَأَبْكَى'], 
   'تريني': [
           'تُرِيَنِّي'], 
   'وبشر': [
          'وَبَشِّرِ'], 
   'جاعلك': [
           'جَاعِلُكَ'], 
   'الجودي': [
            'الْجُودِيِّ'], 
   'وأسيرا': [
            'وَأَسِيرًا'], 
   'ببالغيه': [
             'بِبَالِغِيهِ'], 
   'وليتلطف': [
             'وَلْيَتَلَطَّفْ'], 
   'جبارين': [
            'جَبَّارِينَ'], 
   'قطع': [
         'قِطَعٌ'], 
   'أرضكم': [
           'أَرْضِكُمْ'], 
   'ليضلوا': [
            'لِيُضِلُّوا'], 
   'أعطيناك': [
             'أَعْطَيْنَاكَ'], 
   'إصرا': [
          'إِصْرًا'], 
   'وأحييتنا': [
              'وَأَحْيَيْتَنَا'], 
   'عجاب': [
          'عُجَابٌ'], 
   'وسع': [
         'وَسِعَ'], 
   'قوامون': [
            'قَوَّامُونَ'], 
   'نتبوأ': [
           'نَتَبَوَّأُ'], 
   'فسلكه': [
           'فَسَلَكَهُ'], 
   'النصارى': [
             'النَّصَارَى'], 
   'لتبلون': [
            'لَتُبْلَوُنَّ'], 
   'وأصبح': [
           'وَأَصْبَحَ'], 
   'فارجعنا': [
             'فَارْجِعْنَا'], 
   'منثورا': [
            'مَنْثُورًا'], 
   'وانشقت': [
            'وَانْشَقَّتِ'], 
   'أبتغي': [
           'أَبْتَغِي'], 
   'للمشركين': [
              'لِلْمُشْرِكِينَ'], 
   'ليضلون': [
            'لَيُضِلُّونَ'], 
   'عجاف': [
          'عِجَافٌ'], 
   'يألمون': [
            'يَأْلَمُونَ'], 
   'بمفازتهم': [
              'بِمَفَازَتِهِمْ'], 
   'واختار': [
            'وَاخْتَارَ'], 
   'أطوارا': [
            'أَطْوَارًا'], 
   'انتثرت': [
            'انْتَثَرَتْ'], 
   'حينئذ': [
           'حِينَئِذٍ'], 
   'منزلون': [
            'مُنْزِلُونَ'], 
   'فرضنا': [
           'فَرَضْنَا'], 
   'يعظه': [
          'يَعِظُهُ'], 
   'وتحسبهم': [
             'وَتَحْسَبُهُمْ'], 
   'يعظم': [
          'يُعَظِّمْ'], 
   'لقوم': [
          'لِقَوْمٍ'], 
   'لقوي': [
          'لَقَوِيٌّ'], 
   'تخزون': [
           'تُخْزُونِ'], 
   'ببالغه': [
            'بِبَالِغِهِ'], 
   'سورة': [
          'سُورَةٌ'], 
   'يعذبه': [
           'يُعَذِّبْهُ'], 
   'مكرتموه': [
             'مَكَرْتُمُوهُ'], 
   'بأموال': [
            'بِأَمْوَالٍ'], 
   'أزواجهن': [
             'أَزْوَاجَهُنَّ'], 
   'أزواجهم': [
             'أَزْوَاجِهِمْ',
             'أَزْوَاجُهُمْ',
             'أَزْوَاجَهُمْ'], 
   'فأقيموا': [
             'فَأَقِيمُوا'], 
   'شركاءكم': [
             'شُرَكَاءَكُمْ',
             'شُرَكَاءَكُمُ'], 
   'وأولئك': [
            'وَأُولَئِكَ'], 
   'انتبذت': [
            'انْتَبَذَتْ'], 
   'معجزي': [
           'مُعْجِزِي'], 
   'فتقبل': [
           'فَتُقُبِّلَ',
           'فَتَقَبَّلْ'], 
   'مسرف': [
          'مُسْرِفٌ'], 
   'وليطوفوا': [
              'وَلْيَطَّوَّفُوا'], 
   'أقيموا': [
            'أَقِيمُوا'], 
   'المطهرين': [
              'الْمُطَّهِّرِينَ'], 
   'ووري': [
          'وُورِيَ'], 
   'موقنون': [
            'مُوقِنُونَ'], 
   'مبشرين': [
            'مُبَشِّرِينَ'], 
   'نبين': [
          'نُبَيِّنُ'], 
   'غثاء': [
          'غُثَاءً'], 
   'مهلكهم': [
            'مُهْلِكُهُمْ'], 
   'أبصر': [
          'أَبْصِرْ',
          'أَبْصَرَ'], 
   'نكث': [
         'نَكَثَ'], 
   'فاتباع': [
            'فَاتِّبَاعٌ'], 
   'فأطلع': [
           'فَأَطَّلِعَ'], 
   'فيؤمنوا': [
             'فَيُؤْمِنُوا'], 
   'والفحشاء': [
              'وَالْفَحْشَاءِ',
              'وَالْفَحْشَاءَ'], 
   'تثير': [
          'تُثِيرُ'], 
   'غمة': [
         'غُمَّةً'], 
   'أستجب': [
           'أَسْتَجِبْ'], 
   'نكح': [
         'نَكَحَ'], 
   'النبيين': [
             'النَّبِيِّينَ'], 
   'حكمت': [
          'حَكَمْتَ'], 
   'حكمة': [
          'حِكْمَةٌ'], 
   'دائم': [
          'دَائِمٌ'], 
   'حكما': [
          'حُكْمًا',
          'حَكَمًا'], 
   'مواضعه': [
            'مَوَاضِعِهِ'], 
   'يجرمنكم': [
             'يَجْرِمَنَّكُمْ'], 
   'ألفين': [
           'أَلْفَيْنِ'], 
   'وتغفروا': [
             'وَتَغْفِرُوا'], 
   'محبة': [
          'مَحَبَّةً'], 
   'النخلة': [
            'النَّخْلَةِ'], 
   'أولياءه': [
             'أَوْلِيَاءَهُ'], 
   'هونا': [
          'هَوْنًا'], 
   'يقتلونني': [
              'يَقْتُلُونَنِي'], 
   'صرحا': [
          'صَرْحًا'], 
   'أصيب': [
          'أُصِيبُ'], 
   'حكمه': [
          'حُكْمِهِ'], 
   'الغرق': [
           'الْغَرَقُ'], 
   'قاهرون': [
            'قَاهِرُونَ'], 
   'بسخط': [
          'بِسَخَطٍ'], 
   'فرآه': [
          'فَرَآهُ'], 
   'قائلون': [
            'قَائِلُونَ'], 
   'بأسمائهم': [
              'بِأَسْمَائِهِمْ'], 
   'نثبت': [
          'نُثَبِّتُ'], 
   'بمعذبين': [
             'بِمُعَذَّبِينَ'], 
   'إكراه': [
           'إِكْرَاهَ'], 
   'بخير': [
          'بِخَيْرٍ'], 
   'فصلناه': [
            'فَصَّلْنَاهُ'], 
   'لعبادته': [
             'لِعِبَادَتِهِ'], 
   'تستمعون': [
             'تَسْتَمِعُونَ'], 
   'ويستهزأ': [
             'وَيُسْتَهْزَأُ'], 
   'لتأخذوها': [
              'لِتَأْخُذُوهَا'], 
   'ينسى': [
          'يَنْسَى'], 
   'النعمة': [
            'النَّعْمَةِ'], 
   'تكليما': [
            'تَكْلِيمًا'], 
   'نبيهم': [
           'نَبِيُّهُمْ'], 
   'تسمى': [
          'تُسَمَّى'], 
   'أحرص': [
          'أَحْرَصَ'], 
   'رمى': [
         'رَمَى'], 
   'أفأصفاكم': [
              'أَفَأَصْفَاكُمْ'], 
   'وحزني': [
           'وَحُزْنِي'], 
   'حرف': [
         'حَرْفٍ'], 
   'أنفقوا': [
            'أَنْفَقُوا',
            'أَنْفِقُوا'], 
   'الأحمال': [
             'الْأَحْمَالِ'], 
   'يصلبوا': [
            'يُصَلَّبُوا'], 
   'حنين': [
          'حُنَيْنٍ'], 
   'مترفيها': [
             'مُتْرَفِيهَا'], 
   'وبدأ': [
          'وَبَدَأَ'], 
   'وبدا': [
          'وَبَدَا'], 
   'السقف': [
           'السَّقْفُ'], 
   'بالواد': [
            'بِالْوَادِ'], 
   'تأكله': [
           'تَأْكُلُهُ'], 
   'خلاله': [
           'خِلَالِهِ'], 
   'المعتبين': [
              'الْمُعْتَبِينَ'], 
   'يكفون': [
           'يَكُفُّونَ'], 
   'أبوهم': [
           'أَبُوهُمْ'], 
   'أترفوا': [
            'أُتْرِفُوا'], 
   'عرش': [
         'عَرْشَ',
         'عَرْشٌ'], 
   'عرض': [
         'عَرَضَ',
         'عُرِضَ',
         'عَرَضٌ'], 
   'يحرمون': [
            'يُحَرِّمُونَ'], 
   'فأرسلنا': [
             'فَأَرْسَلْنَا'], 
   'مبشرات': [
            'مُبَشِّرَاتٍ'], 
   'لأحد': [
          'لِأَحَدٍ'], 
   'لحافظين': [
             'لَحَافِظِينَ'], 
   'يخادعون': [
             'يُخَادِعُونَ'], 
   'عرضتم': [
           'عَرَّضْتُمْ'], 
   'ويقولون': [
             'وَيَقُولُونَ'], 
   'منكم': [
          'مِنْكُمْ',
          'مِنْكُمُ'], 
   'منكن': [
          'مِنْكُنَّ'], 
   'باطلا': [
           'بَاطِلًا'], 
   'بباسط': [
           'بِبَاسِطٍ'], 
   'ركعا': [
          'رُكَّعًا'], 
   'تغلوا': [
           'تَغْلُوا'], 
   'يشربون': [
            'يَشْرَبُونَ'], 
   'انقلبتم': [
             'انْقَلَبْتُمْ'], 
   'فينتقم': [
            'فَيَنْتَقِمُ'], 
   'ثابت': [
          'ثَابِتٌ'], 
   'وحزنا': [
           'وَحَزَنًا'], 
   'بالنهار': [
             'بِالنَّهَارِ'], 
   'ثلة': [
         'ثُلَّةٌ'], 
   'وسمعنا': [
            'وَسَمِعْنَا'], 
   'وتسلموا': [
             'وَتُسَلِّمُوا'], 
   'شاطئ': [
          'شَاطِئِ'], 
   'وننزل': [
           'وَنُنَزِّلُ'], 
   'تأمروني': [
             'تَأْمُرُونِّي'], 
   'آثرك': [
          'آثَرَكَ'], 
   'جاءته': [
           'جَاءَتْهُ'], 
   'تنفعهم': [
            'تَنْفَعُهُمْ'], 
   'يحزن': [
          'يَحْزَنَّ'], 
   'قولي': [
          'قَوْلِي'], 
   'والمروة': [
             'وَالْمَرْوَةَ'], 
   'ونعلم': [
           'وَنَعْلَمُ',
           'وَنَعْلَمَ'], 
   'قوله': [
          'قَوْلُهُ'], 
   'دمتم': [
          'دُمْتُمْ'], 
   'يخوف': [
          'يُخَوِّفُ'], 
   'وعلوا': [
           'وَعُلُوًّا'], 
   'سقيم': [
          'سَقِيمٌ'], 
   'عذابي': [
           'عَذَابِي'], 
   'تحنث': [
          'تَحْنَثْ'], 
   'يغلب': [
          'يَغْلِبْ'], 
   'هداي': [
          'هُدَايَ'], 
   'أفيضوا': [
            'أَفِيضُوا'], 
   'الفؤاد': [
            'الْفُؤَادُ'], 
   'عذابه': [
           'عَذَابَهُ',
           'عَذَابُهُ'], 
   'أنهار': [
           'أَنْهَارٌ'], 
   'مليا': [
          'مَلِيًّا'], 
   'حميم': [
          'حَمِيمٍ',
          'حَمِيمٌ'], 
   'الجلال': [
            'الْجَلَالِ'], 
   'التقيتم': [
             'الْتَقَيْتُمْ'], 
   'وحملها': [
            'وَحَمَلَهَا'], 
   'لأزواجهم': [
              'لِأَزْوَاجِهِمْ'], 
   'ويستبشرون': [
               'وَيَسْتَبْشِرُونَ'], 
   'تبرج': [
          'تَبَرُّجَ'], 
   'والكافرون': [
               'وَالْكَافِرُونَ'], 
   'فتولوا': [
            'فَتَوَلَّوْا'], 
   'بالذي': [
           'بِالَّذِي'], 
   'وذللت': [
           'وَذُلِّلَتْ'], 
   'مليم': [
          'مُلِيمٌ'], 
   'الجلاء': [
            'الْجَلَاءَ'], 
   'جميعا': [
           'جَمِيعًا'], 
   'عمرك': [
          'عُمُرِكَ'], 
   'مليك': [
          'مَلِيكٍ'], 
   'حمية': [
          'حَمِيَّةَ'], 
   'السوي': [
           'السَّوِيِّ'], 
   'حميد': [
          'حَمِيدٌ',
          'حَمِيدٍ'], 
   'الفساد': [
            'الْفَسَادَ',
            'الْفَسَادِ',
            'الْفَسَادُ'], 
   'فليأت': [
           'فَلْيَأْتِ'], 
   'فشرد': [
          'فَشَرِّدْ'], 
   'لجالوت': [
            'لِجَالُوتَ'], 
   'نفسي': [
          'نَفْسِي'], 
   'اتبع': [
          'اتَّبَعَ',
          'اتَّبِعْ'], 
   'أولياؤهم': [
              'أَوْلِيَاؤُهُمْ',
              'أَوْلِيَاؤُهُمُ'], 
   'وهيئ': [
          'وَهَيِّئْ'], 
   'عاليا': [
           'عَالِيًا'], 
   'قولا': [
          'قَوْلًا'], 
   'الحوايا': [
             'الْحَوَايَا'], 
   'تخضعن': [
           'تَخْضَعْنَ'], 
   'وردوها': [
            'وَرَدُوهَا'], 
   'المتوكلون': [
               'الْمُتَوَكِّلُونَ'], 
   'وآمنهم': [
            'وَآمَنَهُمْ'], 
   'بقدر': [
          'بِقَدَرٍ'], 
   'ولتكون': [
            'وَلِتَكُونَ'], 
   'يغلل': [
          'يَغْلُلْ'], 
   'الكنس': [
           'الْكُنَّسِ'], 
   'لبثت': [
          'لَبِثْتُ',
          'لَبِثْتَ'], 
   'عذابا': [
           'عَذَابًا'], 
   'ويقول': [
           'وَيَقُولُ'], 
   'سقيت': [
          'سَقَيْتَ'], 
   'ينبغي': [
           'يَنْبَغِي'], 
   'أبق': [
         'أَبَقَ'], 
   'دفء': [
         'دِفْءٌ'], 
   'أبى': [
         'أَبَى'], 
   'أبي': [
         'أَبِي'], 
   'أوليس': [
           'أَوَلَيْسَ'], 
   'فاخرج': [
           'فَاخْرُجْ'], 
   'عزموا': [
           'عَزَمُوا'], 
   'وهديناهم': [
              'وَهَدَيْنَاهُمْ'], 
   'وأولادا': [
             'وَأَوْلَادًا'], 
   'مهادا': [
           'مِهَادًا'], 
   'التراب': [
            'التُّرَابِ'], 
   'التراث': [
            'التُّرَاثَ'], 
   'زادهم': [
           'زَادَهُمْ'], 
   'أبناء': [
           'أَبْنَاءِ',
           'أَبْنَاءُ',
           'أَبْنَاءَ'], 
   'دفع': [
         'دَفْعُ'], 
   'تمار': [
          'تُمَارِ'], 
   'نعماء': [
           'نَعْمَاءَ'], 
   'والآخر': [
            'وَالْآخِرُ'], 
   'أنبأهم': [
            'أَنْبَأَهُمْ'], 
   'لخاطئين': [
             'لَخَاطِئِينَ'], 
   'نفسه': [
          'نَفْسِهِ',
          'نَفْسَهُ',
          'نَفْسُهُ'], 
   'وراء': [
          'وَرَاءَ',
          'وَرَاءِ'], 
   'بلدا': [
          'بَلَدًا'], 
   'قرار': [
          'قَرَارٍ'], 
   'سول': [
         'سَوَّلَ'], 
   'لغفار': [
           'لَغَفَّارٌ'], 
   'سوى': [
         'سُوًى'], 
   'بلدة': [
          'بَلْدَةً',
          'بَلْدَةٌ'], 
   'عروشها': [
            'عُرُوشِهَا'], 
   'سور': [
         'سُوَرٍ'], 
   'فتونا': [
           'فُتُونًا'], 
   'صفا': [
         'صَفًّا'], 
   'النحل': [
           'النَّحْلِ'], 
   'رجزا': [
          'رِجْزًا'], 
   'سوء': [
         'سُوءُ',
         'سُوءٍ',
         'سُوءَ',
         'سَوْءٍ',
         'سُوءِ',
         'سُوءٌ'], 
   'يجاهدون': [
             'يُجَاهِدُونَ'], 
   'وأعلم': [
           'وَأَعْلَمُ'], 
   'غسق': [
         'غَسَقِ'], 
   'أئذا': [
          'أَئِذَا'], 
   'الجمعة': [
            'الْجُمُعَةِ'], 
   'منفطر': [
           'مُنْفَطِرٌ'], 
   'وإياهم': [
            'وَإِيَّاهُمْ'], 
   'فتبهتهم': [
             'فَتَبْهَتُهُمْ'], 
   'ولؤلؤا': [
            'وَلُؤْلُؤًا'], 
   'أبت': [
         'أَبَتِ'], 
   'النساء': [
            'النِّسَاءِ',
            'النِّسَاءَ',
            'النِّسَاءُ'], 
   'لتفسدن': [
            'لَتُفْسِدُنَّ'], 
   'وظلموا': [
            'وَظَلَمُوا'], 
   'ونطمع': [
           'وَنَطْمَعُ'], 
   'وليملل': [
            'وَلْيُمْلِلِ'], 
   'فاستقيموا': [
               'فَاسْتَقِيمُوا'], 
   'ونيسرك': [
            'وَنُيَسِّرُكَ'], 
   'للإيمان': [
             'لِلْإِيمَانِ'], 
   'قائلها': [
            'قَائِلُهَا'], 
   'يسعون': [
           'يَسْعَوْنَ'], 
   'وليصفحوا': [
              'وَلْيَصْفَحُوا'], 
   'يرونه': [
           'يَرَوْنَهُ'], 
   'ينفق': [
          'يُنْفِقُ'], 
   'ذروا': [
          'ذَرْوًا'], 
   'لكي': [
         'لِكَيْ'], 
   'فارغا': [
           'فَارِغًا'], 
   'لكن': [
         'لَكِنِ'], 
   'لكل': [
         'لِكُلِّ',
         'لِكُلٍّ'], 
   'لكم': [
         'لَكُمْ',
         'لَكُمُ'], 
   'بحفيظ': [
           'بِحَفِيظٍ'], 
   'تجريان': [
            'تَجْرِيَانِ'], 
   'وطعام': [
           'وَطَعَامُ'], 
   'يراكم': [
           'يَرَاكُمْ'], 
   'عادون': [
           'عَادُونَ'], 
   'يولد': [
          'يُولَدْ'], 
   'يولج': [
          'يُولِجُ'], 
   'وأزلفنا': [
             'وَأَزْلَفْنَا'], 
   'تبرنا': [
           'تَبَّرْنَا'], 
   'وإناثا': [
            'وَإِنَاثًا'], 
   'نهرا': [
          'نَهَرًا'], 
   'كالأنعام': [
              'كَالْأَنْعَامِ'], 
   'فنادته': [
            'فَنَادَتْهُ'], 
   'بضاعتنا': [
             'بِضَاعَتُنَا'], 
   'إمرا': [
          'إِمْرًا'], 
   'لظالمين': [
             'لَظَالِمِينَ'], 
   'أخزى': [
          'أَخْزَى'], 
   'طهورا': [
           'طَهُورًا'], 
   'وعدوكم': [
            'وَعَدُوَّكُمْ'], 
   'آتيتموهن': [
              'آتَيْتُمُوهُنَّ'], 
   'وجلودهم': [
             'وَجُلُودُهُمْ'], 
   'مثاني': [
           'مَثَانِيَ'], 
   'تحسنوا': [
            'تُحْسِنُوا'], 
   'يكد': [
         'يَكَدْ'], 
   'ينفع': [
          'يَنْفَعُ'], 
   'شورى': [
          'شُورَى'], 
   'يشعرون': [
            'يَشْعُرُونَ'], 
   'لولوا': [
           'لَوَلَّوْا',
           'لَوَلَّوُا'], 
   'والملك': [
            'وَالْمَلَكُ'], 
   'ينفد': [
          'يَنْفَدُ'], 
   'ينفخ': [
          'يُنْفَخُ'], 
   'وقاتل': [
           'وَقَاتَلَ'], 
   'أسخط': [
          'أَسْخَطَ'], 
   'وقدور': [
           'وَقُدُورٍ'], 
   'ويتوب': [
           'وَيَتُوبَ',
           'وَيَتُوبُ'], 
   'ويهب': [
          'وَيَهَبُ'], 
   'المحال': [
            'الْمِحَالِ'], 
   'يصرون': [
           'يُصِرُّونَ'], 
   'أفعيينا': [
             'أَفَعَيِينَا'], 
   'أعيدوا': [
            'أُعِيدُوا'], 
   'يوحى': [
          'يُوحَى'], 
   'لبث': [
         'لَبِثَ'], 
   'بدينار': [
            'بِدِينَارٍ'], 
   'بأنهم': [
           'بِأَنَّهُمْ',
           'بِأَنَّهُمُ'], 
   'تجأروا': [
            'تَجْأَرُوا'], 
   'فأمليت': [
            'فَأَمْلَيْتُ'], 
   'بموسى': [
           'بِمُوسَى'], 
   'اتبعني': [
            'اتَّبَعَنِي'], 
   'يوحي': [
          'يُوحِي'], 
   'وأقيموا': [
             'وَأَقِيمُوا'], 
   'قلبي': [
          'قَلْبِي'], 
   'ثبورا': [
           'ثُبُورًا'], 
   'حنيذ': [
          'حَنِيذٍ'], 
   'لبس': [
         'لَبْسٍ'], 
   'مسلمين': [
            'مُسْلِمِينَ',
            'مُسْلِمَيْنِ'], 
   'معكوفا': [
            'مَعْكُوفًا'], 
   'يستوي': [
           'يَسْتَوِي'], 
   'أجسامهم': [
             'أَجْسَامُهُمْ'], 
   'أظلم': [
          'أَظْلَمُ',
          'أَظْلَمَ'], 
   'الجزاء': [
            'الْجَزَاءَ'], 
   'فأعذبهم': [
             'فَأُعَذِّبُهُمْ'], 
   'يسجدوا': [
            'يَسْجُدُوا'], 
   'تؤمرون': [
            'تُؤْمَرُونَ'], 
   'ليريه': [
           'لِيُرِيَهُ'], 
   'صادقين': [
            'صَادِقِينَ'], 
   'معلوم': [
           'مَعْلُومٍ',
           'مَعْلُومٌ'], 
   'نظنك': [
          'نَظُنُّكَ'], 
   'ثقفتموهم': [
              'ثَقِفْتُمُوهُمْ'], 
   'وذلة': [
          'وَذِلَّةٌ'], 
   'وأعد': [
          'وَأَعَدَّ'], 
   'تؤمنون': [
            'تُؤْمِنُونَ'], 
   'ماليه': [
           'مَالِيَهْ'], 
   'جنحوا': [
           'جَنَحُوا'], 
   'ورق': [
         'وَرَقِ'], 
   'دري': [
         'دُرِّيٌّ'], 
   'ويتمتعوا': [
              'وَيَتَمَتَّعُوا'], 
   'الغفور': [
            'الْغَفُورُ'], 
   'يسجدون': [
            'يَسْجُدُونَ'], 
   'فلنقصن': [
            'فَلَنَقُصَّنَّ'], 
   'الأسود': [
            'الْأَسْوَدِ'], 
   'ويتخذها': [
             'وَيَتَّخِذَهَا'], 
   'ليذوق': [
           'لِيَذُوقَ'], 
   'ورب': [
         'وَرَبُّ',
         'وَرَبِّ',
         'وَرَبَّ',
         'وَرَبٌّ'], 
   'لعليم': [
           'لَعَلِيمٌ'], 
   'تؤمنوا': [
            'تُؤْمِنُوا'], 
   'ورد': [
         'وَرَدَّ',
         'وَرَدَ'], 
   'وأبشروا': [
             'وَأَبْشِرُوا'], 
   'واغضض': [
           'وَاغْضُضْ'], 
   'ليظهره': [
            'لِيُظْهِرَهُ'], 
   'بروجا': [
           'بُرُوجًا'], 
   'أنزلناه': [
             'أَنْزَلْنَاهُ'], 
   'يؤتيه': [
           'يُؤْتِيهِ',
           'يُؤْتِيَهُ'], 
   'تحلقوا': [
            'تَحْلِقُوا'], 
   'تجأرون': [
            'تَجْأَرُونَ'], 
   'لبن': [
         'لَبَنٍ'], 
   'متشابها': [
             'مُتَشَابِهًا'], 
   'تضحى': [
          'تَضْحَى'], 
   'اجتبيتها': [
              'اجْتَبَيْتَهَا'], 
   'دعاءه': [
           'دُعَاءَهُ'], 
   'تذودان': [
            'تَذُودَانِ'], 
   'يسومهم': [
            'يَسُومُهُمْ'], 
   'فيحيي': [
           'فَيُحْيِي'], 
   'أصب': [
         'أَصْبُ'], 
   'لخاسرون': [
             'لَخَاسِرُونَ'], 
   'ترد': [
         'تُرَدَّ'], 
   'لقيا': [
          'لَقِيَا'], 
   'اللات': [
           'اللَّاتَ'], 
   'وبلغ': [
          'وَبَلَغَ'], 
   'ويخلد': [
           'وَيَخْلُدْ'], 
   'فلنفسه': [
            'فَلِنَفْسِهِ'], 
   'أوليائهم': [
              'أَوْلِيَائِهِمْ'], 
   'تعاسرتم': [
             'تَعَاسَرْتُمْ'], 
   'آيتين': [
           'آيَتَيْنِ'], 
   'مقتدرون': [
             'مُقْتَدِرُونَ'], 
   'تبدوه': [
           'تُبْدُوهُ'], 
   'لشر': [
         'لَشَرَّ'], 
   'بشراكم': [
            'بُشْرَاكُمُ'], 
   'فليكفر': [
            'فَلْيَكْفُرْ'], 
   'فاقصص': [
           'فَاقْصُصِ'], 
   'واكفروا': [
             'وَاكْفُرُوا'], 
   'واضمم': [
           'وَاضْمُمْ'], 
   'لغلامين': [
             'لِغُلَامَيْنِ'], 
   'مكذوب': [
           'مَكْذُوبٍ'], 
   'وهامان': [
            'وَهَامَانَ'], 
   'يدعى': [
          'يُدْعَى'], 
   'الذهب': [
           'الذَّهَبِ',
           'الذَّهَبَ'], 
   'تتلون': [
           'تَتْلُونَ'], 
   'لاتخذوك': [
             'لَاتَّخَذُوكَ'], 
   'إنشاء': [
           'إِنْشَاءً'], 
   'ففسقوا': [
            'فَفَسَقُوا'], 
   'الرادفة': [
             'الرَّادِفَةُ'], 
   'يعرفونهم': [
              'يَعْرِفُونَهُمْ'], 
   'مواطن': [
           'مَوَاطِنَ'], 
   'وعنده': [
           'وَعِنْدَهُ'], 
   'والمنكر': [
             'وَالْمُنْكَرِ'], 
   'ليرضوكم': [
             'لِيُرْضُوكُمْ'], 
   'أقربهم': [
            'أَقْرَبَهُمْ'], 
   'اصطفينا': [
             'اصْطَفَيْنَا'], 
   'جمعناهم': [
             'جَمَعْنَاهُمْ'], 
   'والصالحين': [
               'وَالصَّالِحِينَ'], 
   'ندلكم': [
           'نَدُلُّكُمْ'], 
   'طرفهم': [
           'طَرْفُهُمْ'], 
   'سرادقها': [
             'سُرَادِقُهَا'], 
   'تدعو': [
          'تَدْعُو'], 
   'تدعى': [
          'تُدْعَى'], 
   'زينته': [
           'زِينَتِهِ'], 
   'معاد': [
          'مَعَادٍ'], 
   'الصلب': [
           'الصُّلْبِ'], 
   'مذموما': [
            'مَذْمُومًا'], 
   'يعرفونها': [
              'يَعْرِفُونَهَا'], 
   'يطئون': [
           'يَطَئُونَ'], 
   'والمشركات': [
               'وَالْمُشْرِكَاتِ'], 
   'يؤلون': [
           'يُؤْلُونَ'], 
   'ويخلق': [
           'وَيَخْلُقُ'], 
   'قبلنا': [
           'قَبْلِنَا'], 
   'ترى': [
         'تَرَى'], 
   'معلومات': [
             'مَعْلُومَاتٍ',
             'مَعْلُومَاتٌ'], 
   'ترك': [
         'تَرَكَ'], 
   'فأكون': [
           'فَأَكُونَ'], 
   'البشرى': [
            'الْبُشْرَى'], 
   'يبلى': [
          'يَبْلَى'], 
   'فليكتب': [
            'فَلْيَكْتُبْ'], 
   'أقررنا': [
            'أَقْرَرْنَا'], 
   'غبرة': [
          'غَبَرَةٌ'], 
   'غرورا': [
           'غُرُورًا'], 
   'نشطا': [
          'نَشْطًا'], 
   'فقبضت': [
           'فَقَبَضْتُ'], 
   'أمشاج': [
           'أَمْشَاجٍ'], 
   'دكاء': [
          'دَكَّاءَ'], 
   'نرزقكم': [
            'نَرْزُقُكُمْ'], 
   'فذو': [
         'فَذُو'], 
   'يوزعون': [
            'يُوزَعُونَ'], 
   'رزقهن': [
           'رِزْقُهُنَّ'], 
   'أكابر': [
           'أَكَابِرَ'], 
   'فبشرناها': [
              'فَبَشَّرْنَاهَا'], 
   'جواب': [
          'جَوَابَ'], 
   'وقاتلوا': [
             'وَقَاتِلُوا',
             'وَقَاتَلُوا'], 
   'عوقبتم': [
            'عُوقِبْتُمْ'], 
   'واقصد': [
           'وَاقْصِدْ'], 
   'فلأمه': [
           'فَلِأُمِّهِ'], 
   'لتأكلوا': [
             'لِتَأْكُلُوا'], 
   'صخرة': [
          'صَخْرَةٍ'], 
   'لصوت': [
          'لَصَوْتُ'], 
   'كاتب': [
          'كَاتِبٌ'], 
   'للآخرين': [
             'لِلْآخِرِينَ'], 
   'المآب': [
           'الْمَآبِ'], 
   'فيحلوا': [
            'فَيُحِلُّوا'], 
   'كالجواب': [
             'كَالْجَوَابِ'], 
   'أجيبوا': [
            'أَجِيبُوا'], 
   'عظيم': [
          'عَظِيمٌ',
          'عَظِيمٍ'], 
   'مورا': [
          'مَوْرًا'], 
   'فاتخذه': [
            'فَاتَّخِذْهُ'], 
   'الغاشية': [
             'الْغَاشِيَةِ'], 
   'متبعون': [
            'مُتَّبَعُونَ'], 
   'ضيفي': [
          'ضَيْفِي'], 
   'ضيفه': [
          'ضَيْفِهِ'], 
   'فإنما': [
           'فَإِنَّمَا'], 
   'وقرونا': [
            'وَقُرُونًا'], 
   'الأزواج': [
             'الْأَزْوَاجَ'], 
   'بعدكم': [
           'بَعْدِكُمْ'], 
   'تسألن': [
           'تَسْأَلْنِ'], 
   'ولله': [
          'وَلِلَّهِ'], 
   'أعيذها': [
            'أُعِيذُهَا'], 
   'أنشأناه': [
             'أَنْشَأْنَاهُ'], 
   'والبغال': [
             'وَالْبِغَالَ'], 
   'كارهون': [
            'كَارِهُونَ'], 
   'فأنجيناه': [
              'فَأَنْجَيْنَاهُ'], 
   'المولى': [
            'الْمَوْلَى'], 
   'علمي': [
          'عِلْمِي'], 
   'واغفر': [
           'وَاغْفِرْ'], 
   'وقل': [
         'وَقُلْ',
         'وَقُلِ'], 
   'رأوه': [
          'رَأَوْهُ'], 
   'وشركاءكم': [
              'وَشُرَكَاءَكُمْ'], 
   'واستبقا': [
             'وَاسْتَبَقَا'], 
   'وتخلقون': [
             'وَتَخْلُقُونَ'], 
   'وتسبيحه': [
             'وَتَسْبِيحَهُ'], 
   'فقضى': [
          'فَقَضَى'], 
   'هداهم': [
           'هُدَاهُمْ',
           'هَدَاهُمْ',
           'هَدَاهُمُ'], 
   'بربي': [
          'بِرَبِّي'], 
   'بربه': [
          'بِرَبِّهِ'], 
   'بربك': [
          'بِرَبِّكَ'], 
   'لمرسلون': [
             'لَمُرْسَلُونَ'], 
   'أفاتخذتم': [
              'أَفَاتَّخَذْتُمْ'], 
   'فظلوا': [
           'فَظَلُّوا'], 
   'يضاعف': [
           'يُضَاعَفْ',
           'يُضَاعَفُ',
           'يُضَاعِفُ'], 
   'اتبعوك': [
            'اتَّبَعُوكَ'], 
   'كسوتهم': [
            'كِسْوَتُهُمْ'], 
   'لدينا': [
           'لَدَيْنَا'], 
   'أرسلت': [
           'أُرْسِلْتُ',
           'أَرْسَلْتَ',
           'أَرْسَلَتْ'], 
   'وأضله': [
           'وَأَضَلَّهُ'], 
   'الآفاق': [
            'الْآفَاقِ'], 
   'وبكم': [
          'وَبُكْمٌ'], 
   'أمانته': [
            'أَمَانَتَهُ'], 
   'كالعهن': [
            'كَالْعِهْنِ'], 
   'وعسى': [
          'وَعَسَى'], 
   'هدانا': [
           'هَدَانَا'], 
   'تنفع': [
          'تَنْفَعُ'], 
   'للكافرين': [
              'لِلْكَافِرِينَ'], 
   'فيها': [
          'فِيهَا'], 
   'تنفس': [
          'تَنَفَّسَ'], 
   'اتبعوا': [
            'اتَّبِعُوا',
            'اتَّبَعُوا',
            'اتُّبِعُوا'], 
   'تنفد': [
          'تَنْفَدَ'], 
   'شيعا': [
          'شِيَعًا'], 
   'ورمان': [
           'وَرُمَّانٌ'], 
   'القلب': [
           'الْقَلْبِ'], 
   'ليردوهم': [
             'لِيُرْدُوهُمْ'], 
   'بتأويله': [
             'بِتَأْوِيلِهِ'], 
   'شيعة': [
          'شِيعَةٍ'], 
   'أرسله': [
           'أُرْسِلَهُ',
           'أَرْسِلْهُ'], 
   'ليقولون': [
             'لَيَقُولُونَ'], 
   'ملقون': [
           'مُلْقُونَ'], 
   'وقد': [
         'وَقَدْ'], 
   'ينادونهم': [
              'يُنَادُونَهُمْ'], 
   'وقب': [
         'وَقَبَ'], 
   'يغن': [
         'يُغْنِ'], 
   'رأوا': [
          'رَأَوْا',
          'رَأَوُا'], 
   'بخسا': [
          'بَخْسًا'], 
   'وقع': [
         'وَقَعَ'], 
   'هداها': [
           'هُدَاهَا'], 
   'بمستيقنين': [
               'بِمُسْتَيْقِنِينَ'], 
   'وقص': [
         'وَقَصَّ'], 
   'لئن': [
         'لَئِنْ',
         'لَئِنِ'], 
   'وقر': [
         'وَقْرٌ'], 
   'وعشرا': [
           'وَعَشْرًا'], 
   'ونهوا': [
           'وَنَهَوْا'], 
   'فستبصر': [
            'فَسَتُبْصِرُ'], 
   'تعذب': [
          'تُعَذِّبَ'], 
   'فتربصوا': [
             'فَتَرَبَّصُوا'], 
   'الأوليان': [
              'الْأَوْلَيَانِ'], 
   'دلهم': [
          'دَلَّهُمْ'], 
   'وجعلناه': [
             'وَجَعَلْنَاهُ'], 
   'يتغامزون': [
              'يَتَغَامَزُونَ'], 
   'حسبته': [
           'حَسِبَتْهُ'], 
   'لأقتلنك': [
             'لَأَقْتُلَنَّكَ'], 
   'وضربت': [
           'وَضُرِبَتْ'], 
   'عبد': [
         'عَبْدُ',
         'عَبْدٍ',
         'عَبْدٌ'], 
   'لرفعناه': [
             'لَرَفَعْنَاهُ'], 
   'وبشروه': [
            'وَبَشَّرُوهُ'], 
   'ببعض': [
          'بِبَعْضٍ',
          'بِبَعْضِ'], 
   'لقوكم': [
           'لَقُوكُمْ'], 
   'يقتتلان': [
             'يَقْتَتِلَانِ'], 
   'بالآيات': [
             'بِالْآيَاتِ'], 
   'الخيرات': [
             'الْخَيْرَاتِ',
             'الْخَيْرَاتُ'], 
   'فتنتهم': [
            'فِتْنَتُهُمْ'], 
   'المس': [
          'الْمَسِّ'], 
   'قست': [
         'قَسَتْ'], 
   'تحتي': [
          'تَحْتِي'], 
   'فكأنما': [
            'فَكَأَنَّمَا'], 
   'نضرة': [
          'نَضْرَةَ',
          'نَضْرَةً'], 
   'تدعوننا': [
             'تَدْعُونَنَا'], 
   'المن': [
          'الْمَنَّ'], 
   'ولتطمئن': [
             'وَلِتَطْمَئِنَّ'], 
   'أمنتم': [
           'أَمِنْتُمْ'], 
   'أبنائكم': [
             'أَبْنَائِكُمُ'], 
   'واثقكم': [
            'وَاثَقَكُمْ'], 
   'وطهرك': [
           'وَطَهَّرَكِ'], 
   'لتلفتنا': [
             'لِتَلْفِتَنَا'], 
   'حجتهم': [
           'حُجَّتُهُمْ',
           'حُجَّتَهُمْ'], 
   'للتقوى': [
            'لِلتَّقْوَى'], 
   'تعرضوا': [
            'تُعْرِضُوا'], 
   'يرفع': [
          'يَرْفَعِ',
          'يَرْفَعُ'], 
   'ففتحنا': [
            'فَفَتَحْنَا'], 
   'وأذنت': [
           'وَأَذِنَتْ'], 
   'وقفوهم': [
            'وَقِفُوهُمْ'], 
   'يلعن': [
          'يَلْعَنِ'], 
   'يقطعون': [
            'يَقْطَعُونَ'], 
   'غطاءك': [
           'غِطَاءَكَ'], 
   'فأوقد': [
           'فَأَوْقِدْ'], 
   'تأخذونه': [
             'تَأْخُذُونَهُ'], 
   'يحشرهم': [
            'يَحْشُرُهُمْ'], 
   'ويمنعون': [
             'وَيَمْنَعُونَ'], 
   'آبائنا': [
            'آبَائِنَا'], 
   'يطلبه': [
           'يَطْلُبُهُ'], 
   'ويلعنهم': [
             'وَيَلْعَنُهُمُ'], 
   'يرمون': [
           'يَرْمُونَ'], 
   'السيئات': [
             'السَّيِّئَاتِ',
             'السَّيِّئَاتُ'], 
   'كثرتكم': [
            'كَثْرَتُكُمْ'], 
   'والعاديات': [
               'وَالْعَادِيَاتِ'], 
   'زاغوا': [
           'زَاغُوا'], 
   'مطلعون': [
            'مُطَّلِعُونَ'], 
   'والد': [
          'وَالِدٌ'], 
   'عملتم': [
           'عَمِلْتُمْ'], 
   'وأطعن': [
           'وَأَطِعْنَ'], 
   'عبادتي': [
            'عِبَادَتِي'], 
   'فيهن': [
          'فِيهِنَّ'], 
   'والليل': [
            'وَاللَّيْلِ'], 
   'يستقيم': [
            'يَسْتَقِيمَ'], 
   'عبادته': [
            'عِبَادَتِهِ'], 
   'فأتونا': [
            'فَأْتُونَا'], 
   'هداني': [
           'هَدَانِي'], 
   'تطعهما': [
            'تُطِعْهُمَا'], 
   'تلكم': [
          'تِلْكُمُ'], 
   'مهاد': [
          'مِهَادٌ'], 
   'لعنتم': [
           'لَعَنِتُّمْ'], 
   'يدخله': [
           'يُدْخِلْهُ'], 
   'فإنكم': [
           'فَإِنَّكُمْ'], 
   'غزى': [
         'غُزًّى'], 
   'خوان': [
          'خَوَّانٍ'], 
   'وقعدوا': [
            'وَقَعَدُوا'], 
   'الأقدام': [
             'الْأَقْدَامَ'], 
   'ستغلبون': [
             'سَتُغْلَبُونَ'], 
   'أعزة': [
          'أَعِزَّةَ',
          'أَعِزَّةٍ'], 
   'برب': [
         'بِرَبِّ'], 
   'عبده': [
          'عَبْدِهِ',
          'عَبْدَهُ'], 
   'تكونن': [
           'تَكُونَنَّ'], 
   'برسولهم': [
             'بِرَسُولِهِمْ'], 
   'وجنوده': [
            'وَجُنُودُهُ',
            'وَجُنُودِهِ',
            'وَجُنُودَهُ'], 
   'برد': [
         'بَرَدٍ'], 
   'فرادى': [
           'فُرَادَى'], 
   'رابعهم': [
            'رَابِعُهُمْ'], 
   'نحبه': [
          'نَحْبَهُ'], 
   'عابدات': [
            'عَابِدَاتٍ'], 
   'أولئك': [
           'أُولَئِكَ'], 
   'والمؤتفكة': [
               'وَالْمُؤْتَفِكَةَ'], 
   'وصالح': [
           'وَصَالِحُ'], 
   'شياطين': [
            'شَيَاطِينَ'], 
   'كبائر': [
           'كَبَائِرَ'], 
   'ولوطا': [
           'وَلُوطًا'], 
   'فآوى': [
          'فَآوَى'], 
   'بارزة': [
           'بَارِزَةً'], 
   'عبدا': [
          'عَبْدًا'], 
   'تكونا': [
           'تَكُونَا'], 
   'قصمنا': [
           'قَصَمْنَا'], 
   'زلتم': [
          'زِلْتُمْ'], 
   'خوار': [
          'خُوَارٌ'], 
   'وبالرسول': [
              'وَبِالرَّسُولِ'], 
   'ليميز': [
           'لِيَمِيزَ'], 
   'عبدت': [
          'عَبَّدْتَ'], 
   'أعيبها': [
            'أَعِيبَهَا'], 
   'دياركم': [
            'دِيَارِكُمْ'], 
   'استمع': [
           'اسْتَمَعَ'], 
   'بكفرك': [
           'بِكُفْرِكَ'], 
   'ولتعلمن': [
             'وَلَتَعْلَمُنَّ'], 
   'ولقد': [
          'وَلَقَدْ',
          'وَلَقَدِ'], 
   'الأوثان': [
             'الْأَوْثَانِ'], 
   'لتنذر': [
           'لِتُنْذِرَ'], 
   'لتؤمنوا': [
             'لِتُؤْمِنُوا'], 
   'أصل': [
         'أَصْلِ'], 
   'المكيال': [
             'الْمِكْيَالَ'], 
   'المتطهرين': [
               'الْمُتَطَهِّرِينَ'], 
   'ننظر': [
          'نَنْظُرْ'], 
   'لشهيد': [
           'لَشَهِيدٌ'], 
   'فرجت': [
          'فُرِجَتْ'], 
   'ينتهون': [
            'يَنْتَهُونَ'], 
   'وامضوا': [
            'وَامْضُوا'], 
   'اجهروا': [
            'اجْهَرُوا'], 
   'ظلاله': [
           'ظِلَالُهُ'], 
   'فآذوهما': [
             'فَآذُوهُمَا'], 
   'فكلوه': [
           'فَكُلُوهُ'], 
   'يوقدون': [
            'يُوقِدُونَ'], 
   'إخوان': [
           'إِخْوَانَ'], 
   'إذنه': [
          'إِذْنِهِ'], 
   'فرجع': [
          'فَرَجَعَ'], 
   'فجاجا': [
           'فِجَاجًا'], 
   'معروف': [
           'مَعْرُوفٍ',
           'مَعْرُوفٌ'], 
   'يهاجروا': [
             'يُهَاجِرُوا'], 
   'وارحم': [
           'وَارْحَمْ'], 
   'رسلنا': [
           'رُسُلُنَا',
           'رُسُلَنَا',
           'رُسُلِنَا'], 
   'لإيلاف': [
            'لِإِيلَافِ'], 
   'يصعقون': [
            'يُصْعَقُونَ'], 
   'وبكفرهم': [
             'وَبِكُفْرِهِمْ'], 
   'فاعلين': [
            'فَاعِلِينَ'], 
   'فليأكل': [
            'فَلْيَأْكُلْ'], 
   'وتدلوا': [
            'وَتُدْلُوا'], 
   'يبدلونه': [
             'يُبَدِّلُونَهُ'], 
   'ثبتناك': [
            'ثَبَّتْنَاكَ'], 
   'ظاهرين': [
            'ظَاهِرِينَ'], 
   'شركاءهم': [
             'شُرَكَاءَهُمْ'], 
   'لأواه': [
           'لَأَوَّاهٌ'], 
   'أسلحتكم': [
             'أَسْلِحَتِكُمْ',
             'أَسْلِحَتَكُمْ'], 
   'وشجرة': [
           'وَشَجَرَةً'], 
   'تنكيلا': [
            'تَنْكِيلًا'], 
   'تخلقونه': [
             'تَخْلُقُونَهُ'], 
   'تخفون': [
           'تُخْفُونَ'], 
   'تخفوه': [
           'تُخْفُوهُ'], 
   'فأصبحت': [
            'فَأَصْبَحَتْ'], 
   'استعلى': [
            'اسْتَعْلَى'], 
   'والأفئدة': [
              'وَالْأَفْئِدَةَ'], 
   'عينها': [
           'عَيْنُهَا'], 
   'يتوفاكم': [
             'يَتَوَفَّاكُمْ'], 
   'القانتين': [
              'الْقَانِتِينَ'], 
   'الأبواب': [
             'الْأَبْوَابُ',
             'الْأَبْوَابَ'], 
   'ينتهوا': [
            'يَنْتَهُوا'], 
   'مستطيرا': [
             'مُسْتَطِيرًا'], 
   'ظلالا': [
           'ظِلَالًا'], 
   'وأعتدنا': [
             'وَأَعْتَدْنَا'], 
   'يحبهم': [
           'يُحِبُّهُمْ'], 
   'تسؤهم': [
           'تَسُؤْهُمْ'], 
   'وآتيتم': [
            'وَآتَيْتُمْ',
            'وَآتَيْتُمُ'], 
   'فذروه': [
           'فَذَرُوهُ'], 
   'فكلوا': [
           'فَكُلُوا'], 
   'استأجرت': [
             'اسْتَأْجَرْتَ'], 
   'السائحون': [
              'السَّائِحُونَ'], 
   'لشرذمة': [
            'لَشِرْذِمَةٌ'], 
   'وخذوهم': [
            'وَخُذُوهُمْ'], 
   'وليال': [
           'وَلَيَالٍ'], 
   'الميتة': [
            'الْمَيْتَةُ',
            'الْمَيْتَةَ'], 
   'كفروا': [
           'كَفَرُوا'], 
   'واشتروا': [
             'وَاشْتَرَوْا'], 
   'الأدبار': [
             'الْأَدْبَارَ'], 
   'وهارون': [
            'وَهَارُونَ'], 
   'تعلنون': [
            'تُعْلِنُونَ'], 
   'نيلا': [
          'نَيْلًا'], 
   'تنفعكم': [
            'تَنْفَعَكُمْ'], 
   'تأويله': [
            'تَأْوِيلُهُ',
            'تَأْوِيلَهُ',
            'تَأْوِيلِهِ'], 
   'خالك': [
          'خَالِكَ'], 
   'خالق': [
          'خَالِقُ',
          'خَالِقٌ',
          'خَالِقٍ'], 
   'ويسألونك': [
              'وَيَسْأَلُونَكَ'], 
   'ليستيقن': [
             'لِيَسْتَيْقِنَ'], 
   'وأرسلنا': [
             'وَأَرْسَلْنَا'], 
   'إلهك': [
          'إِلَهِكَ',
          'إِلَهَكَ'], 
   'فتفرق': [
           'فَتَفَرَّقَ'], 
   'لنحن': [
          'لَنَحْنُ'], 
   'لآتوها': [
            'لَآتَوْهَا'], 
   'يدعوكم': [
            'يَدْعُوكُمْ'], 
   'الوسيلة': [
             'الْوَسِيلَةَ'], 
   'حاسد': [
          'حَاسِدٍ'], 
   'واسمع': [
           'وَاسْمَعْ'], 
   'يفقهوا': [
            'يَفْقَهُوا'], 
   'ولنبلونكم': [
               'وَلَنَبْلُوَنَّكُمْ'], 
   'لموسعون': [
             'لَمُوسِعُونَ'], 
   'وأباريق': [
             'وَأَبَارِيقَ'], 
   'خلالكم': [
            'خِلَالَكُمْ'], 
   'والقلائد': [
              'وَالْقَلَائِدَ'], 
   'ادعوهم': [
            'ادْعُوهُمْ'], 
   'كففت': [
          'كَفَفْتُ'], 
   'نهوا': [
          'نُهُوا'], 
   'بالشر': [
           'بِالشَّرِّ'], 
   'الظمآن': [
            'الظَّمْآنُ'], 
   'سماكم': [
           'سَمَّاكُمُ'], 
   'واستكبروا': [
               'وَاسْتَكْبَرُوا'], 
   'بنورهم': [
            'بِنُورِهِمْ'], 
   'لباس': [
          'لِبَاسٌ',
          'لِبَاسَ'], 
   'بسحرك': [
           'بِسِحْرِكَ'], 
   'إخراجا': [
            'إِخْرَاجًا'], 
   'تملكهم': [
            'تَمْلِكُهُمْ'], 
   'ونباتا': [
            'وَنَبَاتًا'], 
   'تشتهيه': [
            'تَشْتَهِيهِ'], 
   'خالد': [
          'خَالِدٌ'], 
   'صواع': [
          'صُوَاعَ'], 
   'كريم': [
          'كَرِيمٌ',
          'كَرِيمٍ'], 
   'رسل': [
         'رُسُلٌ',
         'رُسُلُ'], 
   'بإبراهيم': [
              'بِإِبْرَاهِيمَ'], 
   'يشعرن': [
           'يُشْعِرَنَّ'], 
   'إلها': [
          'إِلَهًا'], 
   'وهنا': [
          'وَهْنًا'], 
   'نبرح': [
          'نَبْرَحَ'], 
   'يحاسب': [
           'يُحَاسَبُ'], 
   'ليستأذنكم': [
               'لِيَسْتَأْذِنْكُمُ'], 
   'فاعترفنا': [
              'فَاعْتَرَفْنَا'], 
   'أحصى': [
          'أَحْصَى'], 
   'يتوكل': [
           'يَتَوَكَّلْ',
           'يَتَوَكَّلُ'], 
   'بالصبر': [
            'بِالصَّبْرِ'], 
   'فخذها': [
           'فَخُذْهَا'], 
   'أجل': [
         'أَجَلٍ',
         'أَجَلٌ',
         'أَجَلَ',
         'أَجْلِ'], 
   'لتأتون': [
            'لَتَأْتُونَ'], 
   'فجعله': [
           'فَجَعَلَهُ'], 
   'لإحدى': [
           'لَإِحْدَى'], 
   'شجرها': [
           'شَجَرَهَا'], 
   'اليهود': [
            'الْيَهُودُ',
            'الْيَهُودَ'], 
   'تعرضون': [
            'تُعْرَضُونَ'], 
   'وتدعونني': [
              'وَتَدْعُونَنِي'], 
   'رخاء': [
          'رُخَاءً'], 
   'وأرسل': [
           'وَأَرْسِلْ',
           'وَأَرْسَلَ'], 
   'أيعدكم': [
            'أَيَعِدُكُمْ'], 
   'ويطعمون': [
             'وَيُطْعِمُونَ'], 
   'شركاؤنا': [
             'شُرَكَاؤُنَا'], 
   'أقريب': [
           'أَقَرِيبٌ'], 
   'التي': [
          'الَّتِي'], 
   'ضحى': [
         'ضُحًى'], 
   'أوحيت': [
           'أَوْحَيْتُ'], 
   'آمنكم': [
           'آمَنُكُمْ'], 
   'يهدون': [
           'يَهْدُونَ'], 
   'ناصية': [
           'نَاصِيَةٍ'], 
   'سجدا': [
          'سُجَّدًا'], 
   'فترضى': [
           'فَتَرْضَى'], 
   'بالمودة': [
             'بِالْمَوَدَّةِ'], 
   'المكر': [
           'الْمَكْرُ'], 
   'قرأت': [
          'قَرَأْتَ'], 
   'بتحية': [
           'بِتَحِيَّةٍ'], 
   'وأنزل': [
           'وَأَنْزَلَ',
           'وَأُنْزِلَ'], 
   'يخالفون': [
             'يُخَالِفُونَ'], 
   'عنيد': [
          'عَنِيدٍ'], 
   'ونصيرا': [
            'وَنَصِيرًا'], 
   'شهاب': [
          'شِهَابٌ'], 
   'اصبر': [
          'اصْبِرْ'], 
   'إي': [
        'إِي'], 
   'أحصن': [
          'أُحْصِنَّ'], 
   'تسبحون': [
            'تُسَبِّحُونَ'], 
   'فنفعها': [
            'فَنَفَعَهَا'], 
   'دبر': [
         'دُبُرٍ'], 
   'ويعقوب': [
            'وَيَعْقُوبَ',
            'وَيَعْقُوبُ'], 
   'أجد': [
         'أَجِدُ',
         'أَجِدَ'], 
   'يهرعون': [
            'يُهْرَعُونَ'], 
   'الأمثال': [
             'الْأَمْثَالَ',
             'الْأَمْثَالُ'], 
   'يقينا': [
           'يَقِينًا'], 
   'بمبعوثين': [
              'بِمَبْعُوثِينَ'], 
   'بحق': [
         'بِحَقٍّ'], 
   'أمنتكم': [
            'أَمِنْتُكُمْ'], 
   'أجر': [
         'أَجْرٌ',
         'أَجْرٍ',
         'أَجْرَ',
         'أَجْرُ'], 
   'فمنه': [
          'فَمِنْهُ'], 
   'سنستدرجهم': [
               'سَنَسْتَدْرِجُهُمْ'], 
   'يقصون': [
           'يَقُصُّونَ'], 
   'أإنا': [
          'أَإِنَّا'], 
   'نسوق': [
          'نَسُوقُ'], 
   'ذكر': [
         'ذِكْرِ',
         'ذِكْرٌ',
         'ذُكِرَ',
         'ذَكَرٍ',
         'ذِكْرُ',
         'ذِكْرَ',
         'ذِكْرٍ',
         'ذُكِّرَ'], 
   'لسان': [
          'لِسَانَ',
          'لِسَانِ',
          'لِسَانُ',
          'لِسَانٌ'], 
   'خلالهما': [
             'خِلَالَهُمَا'], 
   'فكفى': [
          'فَكَفَى'], 
   'نسوي': [
          'نُسَوِّيَ'], 
   'يعدون': [
           'يَعْدُونَ'], 
   'بنين': [
          'بَنِينَ'], 
   'بنيه': [
          'بَنِيهِ'], 
   'قالا': [
          'قَالَا'], 
   'يعصمني': [
            'يَعْصِمُنِي'], 
   'تنس': [
         'تَنْسَ'], 
   'قالت': [
          'قَالَتْ',
          'قَالَتِ'], 
   'أبانا': [
           'أَبَانَا'], 
   'أضل': [
         'أَضَلُّ',
         'أَضَلَّ',
         'أَضِلُّ'], 
   'مضغة': [
          'مُضْغَةٍ',
          'مُضْغَةً'], 
   'تطعه': [
          'تُطِعْهُ'], 
   'ورضيت': [
           'وَرَضِيتُ'], 
   'ركاب': [
          'رِكَابٍ'], 
   'حافظوا': [
            'حَافِظُوا'], 
   'أتبنون': [
            'أَتَبْنُونَ'], 
   'نضجت': [
          'نَضِجَتْ'], 
   'ونحيا': [
           'وَنَحْيَا'], 
   'الخطفة': [
            'الْخَطْفَةَ'], 
   'فيغفر': [
           'فَيَغْفِرُ'], 
   'يستجيبون': [
              'يَسْتَجِيبُونَ'], 
   'واجعلنا': [
             'وَاجْعَلْنَا'], 
   'ميراث': [
           'مِيرَاثُ'], 
   'أخذناهم': [
             'أَخَذْنَاهُمْ'], 
   'خلقهم': [
           'خَلَقَهُمْ',
           'خَلْقَهُمْ'], 
   'خلقهن': [
           'خَلَقَهُنَّ'], 
   'وأولو': [
           'وَأُولُو'], 
   'وأولي': [
           'وَأُولِي'], 
   'لننزعن': [
            'لَنَنْزِعَنَّ'], 
   'قبلتك': [
           'قِبْلَتَكَ'], 
   'سائحات': [
            'سَائِحَاتٍ'], 
   'وسعيد': [
           'وَسَعِيدٌ'], 
   'حافظون': [
            'حَافِظُونَ'], 
   'تقعد': [
          'تَقْعُدْ'], 
   'لرحمة': [
           'لَرَحْمَةً'], 
   'أبلغه': [
           'أَبْلِغْهُ'], 
   'يعفو': [
          'يَعْفُوَ'], 
   'حسبهم': [
           'حَسْبُهُمْ'], 
   'أوحينا': [
            'أَوْحَيْنَا'], 
   'معرة': [
          'مَعَرَّةٌ'], 
   'واجعلني': [
             'وَاجْعَلْنِي'], 
   'يستجيبوا': [
              'يَسْتَجِيبُوا'], 
   'لصاحبه': [
            'لِصَاحِبِهِ'], 
   'رضيتم': [
           'رَضِيتُمْ'], 
   'هاد': [
         'هَادٍ'], 
   'وأهلكنا': [
             'وَأَهْلَكْنَا'], 
   'أإنك': [
          'أَإِنَّكَ'], 
   'نسوا': [
          'نَسُوا'], 
   'تبغ': [
         'تَبْغِ'], 
   'نشتري': [
           'نَشْتَرِي'], 
   'ثمود': [
          'ثَمُودُ',
          'ثَمُودَ'], 
   'يسرف': [
          'يُسْرِفْ'], 
   'بخلوا': [
           'بَخِلُوا'], 
   'قوتكم': [
           'قُوَّتِكُمْ'], 
   'وبركاته': [
             'وَبَرَكَاتُهُ'], 
   'أخرجنا': [
            'أَخْرِجْنَا',
            'أَخْرَجْنَا',
            'أُخْرِجْنَا'], 
   'بقرآن': [
           'بِقُرْآنٍ'], 
   'حطة': [
         'حِطَّةٌ'], 
   'لفرح': [
          'لَفَرِحٌ'], 
   'عتوا': [
          'عُتُوًّا',
          'عَتَوْا'], 
   'وسنجزي': [
            'وَسَنَجْزِي'], 
   'يحبرون': [
            'يُحْبَرُونَ'], 
   'العليا': [
            'الْعُلْيَا'], 
   'مواقيت': [
            'مَوَاقِيتُ'], 
   'عماتكم': [
            'عَمَّاتِكُمْ'], 
   'عقدة': [
          'عُقْدَةُ',
          'عُقْدَةَ',
          'عُقْدَةً'], 
   'كفى': [
         'كَفَى'], 
   'شطره': [
          'شَطْرَهُ'], 
   'فاسعوا': [
            'فَاسْعَوْا'], 
   'يعبدوها': [
             'يَعْبُدُوهَا'], 
   'حرما': [
          'حَرَمًا',
          'حُرُمًا'], 
   'لقادرون': [
             'لَقَادِرُونَ'], 
   'قواما': [
           'قَوَامًا'], 
   'الشهادة': [
             'الشَّهَادَةَ'], 
   'حرمت': [
          'حُرِّمَتْ'], 
   'إرم': [
         'إِرَمَ'], 
   'أربع': [
          'أَرْبَعُ',
          'أَرْبَعَ',
          'أَرْبَعٍ'], 
   'كفل': [
         'كِفْلٌ'], 
   'ينهى': [
          'يَنْهَى'], 
   'يصدنك': [
           'يَصُدُّنَّكَ',
           'يَصُدَّنَّكَ'], 
   'وخلقنا': [
            'وَخَلَقْنَا'], 
   'وتوقروه': [
             'وَتُوَقِّرُوهُ'], 
   'الذلة': [
           'الذِّلَّةُ'], 
   'عثر': [
         'عُثِرَ'], 
   'ممدكم': [
           'مُمِدُّكُمْ'], 
   'فبشره': [
           'فَبَشِّرْهُ'], 
   'كوكب': [
          'كَوْكَبٌ'], 
   'يغنيه': [
           'يُغْنِيهِ'], 
   'تصيبهم': [
            'تُصِيبَهُمْ',
            'تُصِيبُهُمْ'], 
   'نعمركم': [
            'نُعَمِّرْكُمْ'], 
   'نجزيه': [
           'نَجْزِيهِ'], 
   'حاضرا': [
           'حَاضِرًا'], 
   'أنشأها': [
            'أَنْشَأَهَا'], 
   'أنعاما': [
            'أَنْعَامًا'], 
   'لتعارفوا': [
              'لِتَعَارَفُوا'], 
   'بالكافرين': [
               'بِالْكَافِرِينَ'], 
   'اعتدينا': [
             'اعْتَدَيْنَا'], 
   'سميتموها': [
              'سَمَّيْتُمُوهَا'], 
   'الصخر': [
           'الصَّخْرَ'], 
   'والمغرب': [
             'وَالْمَغْرِبِ',
             'وَالْمَغْرِبُ'], 
   'بواد': [
          'بِوَادٍ'], 
   'الكنوز': [
            'الْكُنُوزِ'], 
   'تضحكون': [
            'تَضْحَكُونَ'], 
   'أفأنتم': [
            'أَفَأَنْتُمْ'], 
   'حاضري': [
           'حَاضِرِي'], 
   'طاغين': [
           'طَاغِينَ'], 
   'يصفون': [
           'يَصِفُونَ'], 
   'أسحر': [
          'أَسِحْرٌ'], 
   'آدم': [
         'آدَمَ',
         'آدَمُ'], 
   'ويأتيه': [
            'وَيَأْتِيهِ'], 
   'وأضلهم': [
            'وَأَضَلَّهُمُ'], 
   'وزرا': [
          'وِزْرًا'], 
   'ينقضون': [
            'يَنْقُضُونَ'], 
   'يسبحن': [
           'يُسَبِّحْنَ'], 
   'بوالدتي': [
             'بِوَالِدَتِي'], 
   'شركاؤكم': [
             'شُرَكَاؤُكُمُ'], 
   'كفر': [
         'كَفَرَ',
         'كُفِرَ',
         'كَفَّرَ'], 
   'أشده': [
          'أَشُدَّهُ'], 
   'فادخلوها': [
              'فَادْخُلُوهَا'], 
   'العليم': [
            'الْعَلِيمُ',
            'الْعَلِيمِ'], 
   'ورائهم': [
            'وَرَائِهِمْ'], 
   'رضوان': [
           'رِضْوَانَ',
           'رِضْوَانِ'], 
   'والصيف': [
            'وَالصَّيْفِ'], 
   'تلاوته': [
            'تِلَاوَتِهِ'], 
   'معين': [
          'مَعِينٍ'], 
   'حراما': [
           'حَرَامًا'], 
   'مساكنهم': [
             'مَسَاكِنِهِمْ',
             'مَسَاكِنُهُمْ'], 
   'يشهد': [
          'يَشْهَدُ',
          'يَشْهَدَ'], 
   'وأقبلوا': [
             'وَأَقْبَلُوا'], 
   'فاذكروني': [
              'فَاذْكُرُونِي'], 
   'نكتم': [
          'نَكْتُمُ'], 
   'نكتل': [
          'نَكْتَلْ'], 
   'دعوتهم': [
            'دَعَوْتُهُمْ'], 
   'تحط': [
         'تُحِطْ'], 
   'وادعوا': [
            'وَادْعُوا'], 
   'حلاف': [
          'حَلَّافٍ'], 
   'لهذا': [
          'لِهَذَا'], 
   'تسفكون': [
            'تَسْفِكُونَ'], 
   'الحمير': [
            'الْحَمِيرِ'], 
   'يميتكم': [
            'يُمِيتُكُمْ'], 
   'أرضا': [
          'أَرْضًا'], 
   'بسلام': [
           'بِسَلَامٍ'], 
   'وزرع': [
          'وَزَرْعٌ'], 
   'مقداره': [
            'مِقْدَارُهُ'], 
   'والعاملين': [
               'وَالْعَامِلِينَ'], 
   'أذهبتم': [
            'أَذْهَبْتُمْ'], 
   'عتت': [
         'عَتَتْ'], 
   'لقومه': [
           'لِقَوْمِهِ'], 
   'أنبتنا': [
            'أَنْبَتْنَا'], 
   'نملة': [
          'نَمْلَةٌ'], 
   'أكفر': [
          'أَكْفُرُ'], 
   'أيمسكه': [
            'أَيُمْسِكُهُ'], 
   'بعيسى': [
           'بِعِيسَى'], 
   'قصد': [
         'قَصْدُ'], 
   'تبعك': [
          'تَبِعَكَ'], 
   'الموسع': [
            'الْمُوسِعِ'], 
   'وصل': [
         'وَصَلِّ'], 
   'أربعين': [
            'أَرْبَعِينَ'], 
   'وتعزروه': [
             'وَتُعَزِّرُوهُ'], 
   'وشددنا': [
            'وَشَدَدْنَا'], 
   'عتو': [
         'عُتُوٍّ'], 
   'ومطهرك': [
            'وَمُطَهِّرُكَ'], 
   'نملي': [
          'نُمْلِي'], 
   'تبعا': [
          'تَبَعًا'], 
   'تمترن': [
           'تَمْتَرُنَّ'], 
   'جندنا': [
           'جُنْدَنَا'], 
   'وحبط': [
          'وَحَبِطَ'], 
   'ببطن': [
          'بِبَطْنِ'], 
   'جمعناكم': [
             'جَمَعْنَاكُمْ'], 
   'بميت': [
          'بِمَيِّتٍ'], 
   'الجزية': [
            'الْجِزْيَةَ'], 
   'ذكراها': [
            'ذِكْرَاهَا'], 
   'قتورا': [
           'قَتُورًا'], 
   'منزلين': [
            'مُنْزِلِينَ',
            'مُنْزَلِينَ'], 
   'الحميم': [
            'الْحَمِيمِ',
            'الْحَمِيمُ'], 
   'فأنفقوا': [
             'فَأَنْفِقُوا'], 
   'لصالو': [
           'لَصَالُو'], 
   'وادعوه': [
            'وَادْعُوهُ'], 
   'المغفرة': [
             'الْمَغْفِرَةِ'], 
   'رادوه': [
           'رَادُّوهُ'], 
   'عدتم': [
          'عُدْتُمْ'], 
   'الهدى': [
           'الْهُدَى'], 
   'الهدي': [
           'الْهَدْيِ',
           'الْهَدْيُ',
           'الْهَدْيَ'], 
   'وأوتيت': [
            'وَأُوتِيَتْ'], 
   'أأسجد': [
           'أَأَسْجُدُ'], 
   'تناله': [
           'تَنَالُهُ'], 
   'كدحا': [
          'كَدْحًا'], 
   'ألهم': [
          'أَلَهُمْ'], 
   'غشى': [
         'غَشَّى'], 
   'خاف': [
         'خَافَ'], 
   'للرسل': [
           'لِلرُّسُلِ'], 
   'طغيانا': [
            'طُغْيَانًا'], 
   'ولباسهم': [
             'وَلِبَاسُهُمْ'], 
   'فسيحوا': [
            'فَسِيحُوا'], 
   'ببينة': [
           'بِبَيِّنَةٍ'], 
   'الرزاق': [
            'الرَّزَّاقُ'], 
   'كالحون': [
            'كَالِحُونَ'], 
   'والضلال': [
             'وَالضَّلَالِ'], 
   'تنقصوا': [
            'تَنْقُصُوا'], 
   'العمر': [
           'الْعُمُرِ',
           'الْعُمُرُ'], 
   'وظننتم': [
            'وَظَنَنْتُمْ'], 
   'برسول': [
           'بِرَسُولٍ'], 
   'يصبروا': [
            'يَصْبِرُوا'], 
   'بجهنم': [
           'بِجَهَنَّمَ'], 
   'سطحت': [
          'سُطِحَتْ'], 
   'كفاتا': [
           'كِفَاتًا'], 
   'خافوا': [
           'خَافُوا'], 
   'كرهوا': [
           'كَرِهُوا'], 
   'ارحمهما': [
             'ارْحَمْهُمَا'], 
   'بصوتك': [
           'بِصَوْتِكَ'], 
   'وجنود': [
           'وَجُنُودُ'], 
   'ويعبدون': [
             'وَيَعْبُدُونَ'], 
   'ويوم': [
          'وَيَوْمَ'], 
   'يدخلوها': [
             'يَدْخُلُوهَا'], 
   'لنهلكن': [
            'لَنُهْلِكَنَّ'], 
   'فمتعناهم': [
              'فَمَتَّعْنَاهُمْ'], 
   'ولآمرنهم': [
              'وَلَآمُرَنَّهُمْ'], 
   'متوفيك': [
            'مُتَوَفِّيكَ'], 
   'وعذابا': [
            'وَعَذَابًا'], 
   'ويستخلف': [
             'وَيَسْتَخْلِفْ',
             'وَيَسْتَخْلِفُ'], 
   'بالخير': [
            'بِالْخَيْرِ'], 
   'ونزل': [
          'وَنُزِّلَ'], 
   'صدقات': [
           'صَدَقَاتٍ'], 
   'أصبرهم': [
            'أَصْبَرَهُمْ'], 
   'أجيب': [
          'أُجِيبُ'], 
   'فليملل': [
            'فَلْيُمْلِلْ'], 
   'خاب': [
         'خَابَ'], 
   'ففهمناها': [
              'فَفَهَّمْنَاهَا'], 
   'دينكم': [
           'دِينِكُمْ',
           'دِينَكُمْ',
           'دِينُكُمْ'], 
   'أرسل': [
          'أَرْسَلَ',
          'أُرْسِلَ',
          'أَرْسِلْ'], 
   'فتفجر': [
           'فَتُفَجِّرَ'], 
   'فأولئك': [
            'فَأُولَئِكَ'], 
   'حياتكم': [
            'حَيَاتِكُمُ'], 
   'بدعا': [
          'بِدْعًا'], 
   'فأصدق': [
           'فَأَصَّدَّقَ'], 
   'بإلحاد': [
            'بِإِلْحَادٍ'], 
   'رواكد': [
           'رَوَاكِدَ'], 
   'المشركون': [
              'الْمُشْرِكُونَ'], 
   'ظاهرة': [
           'ظَاهِرَةً'], 
   'بأمرنا': [
            'بِأَمْرِنَا'], 
   'وفتحت': [
           'وَفُتِحَتْ',
           'وَفُتِحَتِ'], 
   'وتعيها': [
            'وَتَعِيَهَا'], 
   'فإطعام': [
            'فَإِطْعَامُ'], 
   'مددا': [
          'مَدَدًا'], 
   'ظاهرا': [
           'ظَاهِرًا'], 
   'فاذهب': [
           'فَاذْهَبْ'], 
   'أضللن': [
           'أَضْلَلْنَ'], 
   'اتخذوهم': [
             'اتَّخَذُوهُمْ'], 
   'وللنساء': [
             'وَلِلنِّسَاءِ'], 
   'الغاوين': [
             'الْغَاوِينَ'], 
   'مكرا': [
          'مَكْرًا'], 
   'عورات': [
           'عَوْرَاتِ',
           'عَوْرَاتٍ'], 
   'سحران': [
           'سِحْرَانِ'], 
   'فانفروا': [
             'فَانْفِرُوا'], 
   'اهدنا': [
           'اهْدِنَا'], 
   'ليغيظ': [
           'لِيَغِيظَ'], 
   'ملتهم': [
           'مِلَّتِهِمْ',
           'مِلَّتَهُمْ'], 
   'فطال': [
          'فَطَالَ'], 
   'ختامه': [
           'خِتَامُهُ'], 
   'يضلل': [
          'يُضْلِلِ',
          'يُضْلِلْ'], 
   'وأحسن': [
           'وَأَحْسَنُ',
           'وَأَحْسِنْ',
           'وَأَحْسَنَ'], 
   'يضله': [
          'يُضِلُّهُ',
          'يُضِلَّهُ'], 
   'جعلناهم': [
             'جَعَلْنَاهُمْ'], 
   'يحكمون': [
            'يَحْكُمُونَ'], 
   'يستغفروا': [
              'يَسْتَغْفِرُوا'], 
   'تولاه': [
           'تَوَلَّاهُ'], 
   'يحكموك': [
            'يُحَكِّمُوكَ'], 
   'غفر': [
         'غَفَرَ'], 
   'بالإثم': [
            'بِالْإِثْمِ'], 
   'لتعلموا': [
             'لِتَعْلَمُوا'], 
   'بأشياعهم': [
              'بِأَشْيَاعِهِمْ'], 
   'ومعصيت': [
            'وَمَعْصِيَتِ'], 
   'أحسنوا': [
            'أَحْسَنُوا'], 
   'قدرناه': [
            'قَدَّرْنَاهُ'], 
   'بعثر': [
          'بُعْثِرَ'], 
   'يشكرون': [
            'يَشْكُرُونَ'], 
   'تخفيف': [
           'تَخْفِيفٌ'], 
   'اخرجوا': [
            'اخْرُجُوا'], 
   'وعجلت': [
           'وَعَجِلْتُ'], 
   'زعمتم': [
           'زَعَمْتُمْ'], 
   'مزدجر': [
           'مُزْدَجَرٌ'], 
   'جعلناها': [
             'جَعَلْنَاهَا'], 
   'يستغفرون': [
              'يَسْتَغْفِرُونَ'], 
   'أخيه': [
          'أَخِيهِ'], 
   'فاتبعوني': [
              'فَاتَّبِعُونِي'], 
   'خبرا': [
          'خُبْرًا'], 
   'وادخلي': [
            'وَادْخُلِي'], 
   'سارقين': [
            'سَارِقِينَ'], 
   'عوجا': [
          'عِوَجًا'], 
   'المخلصين': [
              'الْمُخْلَصِينَ'], 
   'ويولج': [
           'وَيُولِجُ'], 
   'أتقتلون': [
             'أَتَقْتُلُونَ'], 
   'أفتؤمنون': [
              'أَفَتُؤْمِنُونَ'], 
   'ورأيت': [
           'وَرَأَيْتَ'], 
   'يزيغ': [
          'يَزِيغُ'], 
   'اتخذوها': [
             'اتَّخَذُوهَا'], 
   'ويسخرون': [
             'وَيَسْخَرُونَ'], 
   'خفيفا': [
           'خَفِيفًا'], 
   'مكرم': [
          'مُكْرِمٍ'], 
   'بصره': [
          'بَصَرِهِ'], 
   'ويزداد': [
            'وَيَزْدَادَ'], 
   'نعجتك': [
           'نَعْجَتِكَ'], 
   'وأدخلنا': [
             'وَأَدْخِلْنَا'], 
   'بساطا': [
           'بِسَاطًا'], 
   'ظلمت': [
          'ظَلَمْتُ',
          'ظَلَمَتْ'], 
   'عجلا': [
          'عِجْلًا'], 
   'عليما': [
           'عَلِيمًا'], 
   'لظالمون': [
             'لَظَالِمُونَ'], 
   'وإمائكم': [
             'وَإِمَائِكُمْ'], 
   'لوليت': [
           'لَوَلَّيْتَ'], 
   'مرصوص': [
           'مَرْصُوصٌ'], 
   'الخمر': [
           'الْخَمْرِ',
           'الْخَمْرُ'], 
   'حملها': [
           'حِمْلِهَا',
           'حَمْلَهَا'], 
   'ساعة': [
          'سَاعَةً',
          'سَاعَةِ',
          'سَاعَةٍ'], 
   'لتبدي': [
           'لَتُبْدِي'], 
   'واردهم': [
            'وَارِدَهُمْ'], 
   'نفقه': [
          'نَفْقَهُ'], 
   'مائدة': [
           'مَائِدَةً'], 
   'منسيا': [
           'مَنْسِيًّا'], 
   'صلاتهم': [
            'صَلَاتِهِمْ',
            'صَلَاتُهُمْ'], 
   'منها': [
          'مِنْهَا'], 
   'اقتلوا': [
            'اقْتُلُوا'], 
   'لتجزى': [
           'لِتُجْزَى'], 
   'يبين': [
          'يُبَيِّنُ',
          'يُبَيِّنْ',
          'يُبِينُ',
          'يُبَيِّنَ'], 
   'تقواهم': [
            'تَقْوَاهُمْ'], 
   'ويلكم': [
           'وَيْلَكُمْ'], 
   'فأرسل': [
           'فَأَرْسِلْ',
           'فَأَرْسَلَ'], 
   'محتضر': [
           'مُحْتَضَرٌ'], 
   'أسفارنا': [
             'أَسْفَارِنَا'], 
   'تزال': [
          'تَزَالُ'], 
   'يغشيكم': [
            'يُغَشِّيكُمُ'], 
   'يلتكم': [
           'يَلِتْكُمْ'], 
   'مولانا': [
            'مَوْلَانَا'], 
   'رجعنا': [
           'رَجَعْنَا'], 
   'نفقا': [
          'نَفَقًا'], 
   'واردها': [
            'وَارِدُهَا'], 
   'منهم': [
          'مِنْهُمْ',
          'مِنْهُمُ'], 
   'منهن': [
          'مِنْهُنَّ'], 
   'اقتلوه': [
            'اقْتُلُوهُ'], 
   'وتوفيقا': [
             'وَتَوْفِيقًا'], 
   'نفقد': [
          'نَفْقِدُ'], 
   'فلولا': [
           'فَلَوْلَا'], 
   'نفقة': [
          'نَفَقَةٍ',
          'نَفَقَةً'], 
   'الهوى': [
           'الْهَوَى'], 
   'الجوع': [
           'الْجُوعِ'], 
   'يطير': [
          'يَطِيرُ'], 
   'وأدخلني': [
             'وَأَدْخِلْنِي'], 
   'ترتيلا': [
            'تَرْتِيلًا'], 
   'ويأتينا': [
             'وَيَأْتِينَا'], 
   'بصرت': [
          'بَصُرْتُ'], 
   'بكرة': [
          'بُكْرَةً'], 
   'برازقين': [
             'بِرَازِقِينَ'], 
   'ثوب': [
         'ثُوِّبَ'], 
   'لوليه': [
           'لِوَلِيِّهِ'], 
   'يغنيا': [
           'يُغْنِيَا'], 
   'قتالا': [
           'قِتَالًا'], 
   'فأطاعوه': [
             'فَأَطَاعُوهُ'], 
   'مكانتكم': [
             'مَكَانَتِكُمْ'], 
   'يموتون': [
            'يَمُوتُونَ'], 
   'أتى': [
         'أَتَى'], 
   'ليتني': [
           'لَيْتَنِي'], 
   'ينظرون': [
            'يَنْظُرُونَ',
            'يُنْظَرُونَ'], 
   'مقتكم': [
           'مَقْتِكُمْ'], 
   'رحمتي': [
           'رَحْمَتِي'], 
   'تخافون': [
            'تَخَافُونَ'], 
   'يستغشون': [
             'يَسْتَغْشُونَ'], 
   'دكا': [
         'دَكًّا'], 
   'وارتقبوا': [
              'وَارْتَقِبُوا'], 
   'والكاظمين': [
               'وَالْكَاظِمِينَ'], 
   'يسأمون': [
            'يَسْأَمُونَ'], 
   'هاجر': [
          'هَاجَرَ'], 
   'القاسطون': [
              'الْقَاسِطُونَ'], 
   'منعك': [
          'مَنَعَكَ'], 
   'سيئاتهم': [
             'سَيِّئَاتِهِمْ'], 
   'سجرت': [
          'سُجِّرَتْ'], 
   'يرضونه': [
            'يَرْضَوْنَهُ'], 
   'دخل': [
         'دَخَلَ'], 
   'بي': [
        'بِي',
        'بِيَ'], 
   'الشفاعة': [
             'الشَّفَاعَةُ',
             'الشَّفَاعَةَ'], 
   'بك': [
        'بِكَ'], 
   'تزعمون': [
            'تَزْعُمُونَ'], 
   'به': [
        'بِهِ'], 
   'بل': [
        'بَلْ',
        'بَلِ'], 
   'بم': [
        'بِمَ'], 
   'تموتن': [
           'تَمُوتُنَّ'], 
   'فالملقيات': [
               'فَالْمُلْقِيَاتِ'], 
   'ضدا': [
         'ضِدًّا'], 
   'يتنازعون': [
              'يَتَنَازَعُونَ'], 
   'وتوكل': [
           'وَتَوَكَّلْ'], 
   'الحيوان': [
             'الْحَيَوَانُ'], 
   'يجادلنا': [
             'يُجَادِلُنَا'], 
   'والخيل': [
            'وَالْخَيْلِ',
            'وَالْخَيْلَ'], 
   'بث': [
        'بَثَّ'], 
   'وآثارهم': [
             'وَآثَارَهُمْ'], 
   'لمسنا': [
           'لَمَسْنَا'], 
   'وسقاهم': [
            'وَسَقَاهُمْ'], 
   'سيء': [
         'سِيءَ'], 
   'لتجدن': [
           'لَتَجِدَنَّ'], 
   'سعته': [
          'سَعَتِهِ'], 
   'جوع': [
         'جُوعٍ'], 
   'أتت': [
         'أَتَتْ'], 
   'وتراهم': [
            'وَتَرَاهُمْ'], 
   'وتربصتم': [
             'وَتَرَبَّصْتُمْ'], 
   'لأجدن': [
           'لَأَجِدَنَّ'], 
   'ليتنا': [
           'لَيْتَنَا'], 
   'يبدلنا': [
            'يُبْدِلَنَا'], 
   'تخافوا': [
            'تَخَافُوا'], 
   'لذنوبهم': [
             'لِذُنُوبِهِمْ'], 
   'يقل': [
         'يَقُلْ'], 
   'القرار': [
            'الْقَرَارُ',
            'الْقَرَارِ'], 
   'تمنعهم': [
            'تَمْنَعُهُمْ'], 
   'وقولوا': [
            'وَقُولُوا'], 
   'وارتابت': [
             'وَارْتَابَتْ'], 
   'قانت': [
          'قَانِتٌ'], 
   'تليت': [
          'تُلِيَتْ'], 
   'وأمرهم': [
            'وَأَمْرُهُمْ'], 
   'للمصلين': [
             'لِلْمُصَلِّينَ'], 
   'طين': [
         'طِينٍ'], 
   'سرر': [
         'سُرُرٍ',
         'سُرُرٌ'], 
   'قاموا': [
           'قَامُوا'], 
   'ليست': [
          'لَيْسَتِ'], 
   'نسير': [
          'نُسَيِّرُ'], 
   'الكذب': [
           'الْكَذِبَ',
           'الْكَذِبِ'], 
   'بإحسان': [
            'بِإِحْسَانٍ'], 
   'نسيت': [
          'نَسِيتُ',
          'نَسِيتَ'], 
   'حرمات': [
           'حُرُمَاتِ'], 
   'نسيا': [
          'نَسْيًا',
          'نَسِيًّا',
          'نَسِيَا'], 
   'مستنفرة': [
             'مُسْتَنْفِرَةٌ'], 
   'واخفض': [
           'وَاخْفِضْ'], 
   'سرا': [
         'سِرًّا'], 
   'حسرتنا': [
            'حَسْرَتَنَا'], 
   'يقيموا': [
            'يُقِيمُوا'], 
   'أنطعم': [
           'أَنُطْعِمُ'], 
   'استعجالهم': [
               'اسْتِعْجَالَهُمْ'], 
   'يعجزون': [
            'يُعْجِزُونَ'], 
   'ونقلبهم': [
             'وَنُقَلِّبُهُمْ'], 
   'ترفع': [
          'تُرْفَعَ'], 
   'عرفات': [
           'عَرَفَاتٍ'], 
   'واجعلوا': [
             'وَاجْعَلُوا'], 
   'والعين': [
            'وَالْعَيْنَ'], 
   'والثمرات': [
              'وَالثَّمَرَاتِ'], 
   'لنحيي': [
           'لِنُحْيِيَ'], 
   'جائر': [
          'جَائِرٌ'], 
   'طور': [
         'طُورِ'], 
   'والعير': [
            'وَالْعِيرَ'], 
   'القربى': [
            'الْقُرْبَى'], 
   'لأظنه': [
           'لَأَظُنُّهُ'], 
   'وتسليما': [
             'وَتَسْلِيمًا'], 
   'لأظنك': [
           'لَأَظُنُّكَ'], 
   'وحاجه': [
           'وَحَاجَّهُ'], 
   'فأتياه': [
            'فَأْتِيَاهُ'], 
   'وبينوا': [
            'وَبَيَّنُوا'], 
   'بالوصيد': [
             'بِالْوَصِيدِ'], 
   'حرام': [
          'حَرَامٌ'], 
   'قارون': [
           'قَارُونُ',
           'قَارُونَ'], 
   'اتل': [
         'اتْلُ'], 
   'اتق': [
         'اتَّقِ'], 
   'ينطقون': [
            'يَنْطِقُونَ'], 
   'الهيم': [
           'الْهِيمِ'], 
   'أإله': [
          'أَإِلَهٌ'], 
   'تول': [
         'تَوَلَّ'], 
   'واستفزز': [
             'وَاسْتَفْزِزْ'], 
   'أنطقنا': [
            'أَنْطَقَنَا'], 
   'جهنم': [
          'جَهَنَّمَ',
          'جَهَنَّمُ'], 
   'ذرعا': [
          'ذَرْعًا'], 
   'تلين': [
          'تَلِينُ'], 
   'موبقا': [
           'مَوْبِقًا'], 
   'ينبئكم': [
            'يُنَبِّئُكُمْ'], 
   'يستطيع': [
            'يَسْتَطِيعُ'], 
   'بدأكم': [
           'بَدَأَكُمْ'], 
   'تثبيتا': [
            'تَثْبِيتًا'], 
   'تدرون': [
           'تَدْرُونَ'], 
   'سرق': [
         'سَرَقَ'], 
   'وفجرنا': [
            'وَفَجَّرْنَا'], 
   'فعجب': [
          'فَعَجَبٌ'], 
   'يقيمون': [
            'يُقِيمُونَ'], 
   'فجورها': [
            'فُجُورَهَا'], 
   'لأجد': [
          'لَأَجِدُ'], 
   'بميتين': [
            'بِمَيِّتِينَ'], 
   'ترضون': [
           'تَرْضَوْنَ'], 
   'تبشرون': [
            'تُبَشِّرُونَ'], 
   'أنشأتم': [
            'أَنْشَأْتُمْ'], 
   'الجاهل': [
            'الْجَاهِلُ'], 
   'لأعدل': [
           'لِأَعْدِلَ'], 
   'وأحيا': [
           'وَأَحْيَا'], 
   'ويكفرون': [
             'وَيَكْفُرُونَ'], 
   'واستعينوا': [
               'وَاسْتَعِينُوا'], 
   'وغضب': [
          'وَغَضِبَ',
          'وَغَضَبٌ'], 
   'والأنثى': [
             'وَالْأُنْثَى'], 
   'يبشرك': [
           'يُبَشِّرُكِ',
           'يُبَشِّرُكَ'], 
   'أريناك': [
            'أَرَيْنَاكَ'], 
   'بعلي': [
          'بَعْلِي'], 
   'وتشتكي': [
            'وَتَشْتَكِي'], 
   'ناداه': [
           'نَادَاهُ'], 
   'نفدت': [
          'نَفِدَتْ'], 
   'وتضحكون': [
             'وَتَضْحَكُونَ'], 
   'منقلبا': [
            'مُنْقَلَبًا'], 
   'عتيد': [
          'عَتِيدٌ'], 
   'يجاورونك': [
              'يُجَاوِرُونَكَ'], 
   'معرضين': [
            'مُعْرِضِينَ'], 
   'آلهتنا': [
            'آلِهَتِنَا'], 
   'بطونهم': [
            'بُطُونِهِمْ'], 
   'عتيا': [
          'عِتِيًّا'], 
   'والمتردية': [
               'وَالْمُتَرَدِّيَةُ'], 
   'المهلكين': [
              'الْمُهْلَكِينَ'], 
   'ولعنه': [
           'وَلَعَنَهُ'], 
   'والسارقة': [
              'وَالسَّارِقَةُ'], 
   'تكرهوا': [
            'تَكْرَهُوا',
            'تُكْرِهُوا'], 
   'المعلوم': [
             'الْمَعْلُومِ'], 
   'لتضيقوا': [
             'لِتُضَيِّقُوا'], 
   'بالقسط': [
            'بِالْقِسْطِ'], 
   'أفرأيت': [
            'أَفَرَأَيْتَ'], 
   'بنيانهم': [
             'بُنْيَانُهُمُ',
             'بُنْيَانَهُمْ'], 
   'سكت': [
         'سَكَتَ'], 
   'لأرجمنك': [
             'لَأَرْجُمَنَّكَ'], 
   'أئمة': [
          'أَئِمَّةً',
          'أَئِمَّةَ'], 
   'تخرجوهن': [
             'تُخْرِجُوهُنَّ'], 
   'مردفين': [
            'مُرْدِفِينَ'], 
   'لأجل': [
          'لِأَجَلٍ'], 
   'يتخبطه': [
            'يَتَخَبَّطُهُ'], 
   'نتوكل': [
           'نَتَوَكَّلَ'], 
   'حسبتهم': [
            'حَسِبْتَهُمْ'], 
   'مرشدا': [
           'مُرْشِدًا'], 
   'ويحب': [
          'وَيُحِبُّ'], 
   'معلم': [
          'مُعَلَّمٌ'], 
   'تفصيلا': [
            'تَفْصِيلًا'], 
   'وامسحوا': [
             'وَامْسَحُوا'], 
   'فلهما': [
           'فَلَهُمَا'], 
   'أجمعين': [
            'أَجْمَعِينَ'], 
   'للقمر': [
           'لِلْقَمَرِ'], 
   'ويدخله': [
            'وَيُدْخِلْهُ'], 
   'تستوي': [
           'تَسْتَوِي'], 
   'بإذني': [
           'بِإِذْنِي'], 
   'الكفرة': [
            'الْكَفَرَةُ'], 
   'أزواج': [
           'أَزْوَاجٍ',
           'أَزْوَاجٌ',
           'أَزْوَاجِ'], 
   'تفادوهم': [
             'تُفَادُوهُمْ'], 
   'ويزيدهم': [
             'وَيَزِيدُهُمْ',
             'وَيَزِيدَهُمْ'], 
   'وترغبون': [
             'وَتَرْغَبُونَ'], 
   'تلك': [
         'تِلْكَ'], 
   'يكذبوك': [
            'يُكَذِّبُوكَ'], 
   'ثبوتها': [
            'ثُبُوتِهَا'], 
   'يكذبون': [
            'يُكَذِّبُونِ',
            'يُكَذِّبُونَ',
            'يَكْذِبُونَ'], 
   'بصدقة': [
           'بِصَدَقَةٍ'], 
   'جادلوك': [
            'جَادَلُوكَ'], 
   'لصادق': [
           'لَصَادِقٌ'], 
   'زهرة': [
          'زَهْرَةَ'], 
   'اغفر': [
          'اغْفِرْ'], 
   'الكافرون': [
              'الْكَافِرُونَ'], 
   'اللعنة': [
            'اللَّعْنَةُ',
            'اللَّعْنَةَ'], 
   'بأنعام': [
            'بِأَنْعَامٍ'], 
   'يلونكم': [
            'يَلُونَكُمْ'], 
   'تك': [
        'تَكُ'], 
   'نطعم': [
          'نُطْعِمُ'], 
   'تتوفاهم': [
             'تَتَوَفَّاهُمُ'], 
   'تحاوركما': [
              'تَحَاوُرَكُمَا'], 
   'سادتنا': [
            'سَادَتَنَا'], 
   'تر': [
        'تَرَ'], 
   'حسرات': [
           'حَسَرَاتٍ'], 
   'الفسوق': [
            'الْفُسُوقُ'], 
   'لوطا': [
          'لُوطًا'], 
   'وبالمؤمنين': [
                'وَبِالْمُؤْمِنِينَ'], 
   'بظلمهم': [
            'بِظُلْمِهِمْ'], 
   'عفريت': [
           'عِفْرِيتٌ'], 
   'الأصوات': [
             'الْأَصْوَاتِ',
             'الْأَصْوَاتُ'], 
   'وعصيهم': [
            'وَعِصِيُّهُمْ',
            'وَعِصِيَّهُمْ'], 
   'ينته': [
          'يَنْتَهِ'], 
   'لفضله': [
           'لِفَضْلِهِ'], 
   'وجمع': [
          'وَجُمِعَ',
          'وَجَمَعَ'], 
   'أرضيتم': [
            'أَرَضِيتُمْ'], 
   'ليصبحن': [
            'لَيُصْبِحُنَّ'], 
   'أنهارا': [
            'أَنْهَارًا'], 
   'معذبين': [
            'مُعَذِّبِينَ'], 
   'والإنس': [
            'وَالْإِنْسِ',
            'وَالْإِنْسَ'], 
   'إصلاحا': [
            'إِصْلَاحًا'], 
   'القلوب': [
            'الْقُلُوبُ',
            'الْقُلُوبِ'], 
   'وليمسنكم': [
              'وَلَيَمَسَّنَّكُمْ'], 
   'يركضون': [
            'يَرْكُضُونَ'], 
   'الصفا': [
           'الصَّفَا'], 
   'أزلفت': [
           'أُزْلِفَتْ'], 
   'فضربنا': [
            'فَضَرَبْنَا'], 
   'تقر': [
         'تَقَرَّ'], 
   'ضير': [
         'ضَيْرَ'], 
   'ويحق': [
          'وَيُحِقُّ',
          'وَيَحِقَّ'], 
   'تقع': [
         'تَقَعَ'], 
   'أخلد': [
          'أَخْلَدَ'], 
   'يزيدون': [
            'يَزِيدُونَ'], 
   'توعدون': [
            'تُوعَدُونَ',
            'تُوعِدُونَ'], 
   'حسن': [
         'حُسْنُ',
         'حَسَنٍ'], 
   'تسبيحهم': [
             'تَسْبِيحَهُمْ'], 
   'والميزان': [
              'وَالْمِيزَانَ'], 
   'وأسلنا': [
            'وَأَسَلْنَا'], 
   'أولاهما': [
             'أُولَاهُمَا'], 
   'أضلانا': [
            'أَضَلَّانَا'], 
   'تؤذونني': [
             'تُؤْذُونَنِي'], 
   'مسغبة': [
           'مَسْغَبَةٍ'], 
   'خسرا': [
          'خُسْرًا'], 
   'بعير': [
          'بَعِيرٍ'], 
   'بعيد': [
          'بَعِيدٍ',
          'بَعِيدٌ'], 
   'افتدت': [
           'افْتَدَتْ'], 
   'اقترفتموها': [
                'اقْتَرَفْتُمُوهَا'], 
   'لفسق': [
          'لَفِسْقٌ'], 
   'أصابها': [
            'أَصَابَهَا'], 
   'واهية': [
           'وَاهِيَةٌ'], 
   'بمثلها': [
            'بِمِثْلِهَا'], 
   'مصرفا': [
           'مَصْرِفًا'], 
   'وبين': [
          'وَبَيْنَ'], 
   'لفاسقون': [
             'لَفَاسِقُونَ'], 
   'عرفوا': [
           'عَرَفُوا'], 
   'والله': [
           'وَاللَّهُ',
           'وَاللَّهِ'], 
   'جاءتنا': [
            'جَاءَتْنَا'], 
   'سببا': [
          'سَبَبًا'], 
   'بعصم': [
          'بِعِصَمِ'], 
   'سلمتم': [
           'سَلَّمْتُمْ'], 
   'والمتصدقين': [
                'وَالْمُتَصَدِّقِينَ'], 
   'وجئنا': [
           'وَجِئْنَا'], 
   'ولتصغى': [
            'وَلِتَصْغَى'], 
   'المتنافسون': [
                'الْمُتَنَافِسُونَ'], 
   'القبلة': [
            'الْقِبْلَةَ'], 
   'بركات': [
           'بَرَكَاتٍ'], 
   'قلنا': [
          'قُلْنَا'], 
   'الخروج': [
            'الْخُرُوجِ',
            'الْخُرُوجُ',
            'الْخُرُوجَ'], 
   'نكرا': [
          'نُكْرًا'], 
   'أمطرت': [
           'أُمْطِرَتْ'], 
   'ولتبتغوا': [
              'وَلِتَبْتَغُوا'], 
   'سرمدا': [
           'سَرْمَدًا'], 
   'بالألقاب': [
              'بِالْأَلْقَابِ'], 
   'ينهون': [
           'يَنْهَوْنَ'], 
   'ذهب': [
         'ذَهَبَ',
         'ذَهَبٍ'], 
   'حسد': [
         'حَسَدَ'], 
   'تقم': [
         'تَقُمْ'], 
   'تقل': [
         'تَقُلْ'], 
   'خرجا': [
          'خَرْجًا'], 
   'نهدي': [
          'نَهْدِي'], 
   'إحدى': [
          'إِحْدَى'], 
   'حسب': [
         'حَسِبَ'], 
   'خرجت': [
          'خَرَجْتَ'], 
   'ضيف': [
         'ضَيْفِ'], 
   'نجواهم': [
            'نَجْوَاهُمْ'], 
   'عهده': [
          'عَهْدَهُ'], 
   'وعمارة': [
            'وَعِمَارَةَ'], 
   'اغدوا': [
           'اغْدُوا'], 
   'احتمل': [
           'احْتَمَلَ'], 
   'نعمل': [
          'نَعْمَلُ',
          'نَعْمَلْ'], 
   'نعمه': [
          'نِعَمَهُ'], 
   'لسعيه': [
           'لِسَعْيِهِ'], 
   'أرجع': [
          'أَرْجِعُ'], 
   'وموعظة': [
            'وَمَوْعِظَةً',
            'وَمَوْعِظَةٌ'], 
   'صاحبهم': [
            'صَاحِبَهُمْ'], 
   'ويؤت': [
          'وَيُؤْتِ'], 
   'واسجدي': [
            'وَاسْجُدِي'], 
   'يهبط': [
          'يَهْبِطُ'], 
   'ولستم': [
           'وَلَسْتُمْ'], 
   'يرزقون': [
            'يُرْزَقُونَ'], 
   'كمن': [
         'كَمَنْ'], 
   'وتذكيري': [
             'وَتَذْكِيرِي'], 
   'فأن': [
         'فَأَنَّ'], 
   'أخذه': [
          'أَخْذَهُ'], 
   'يصبكم': [
           'يُصِبْكُمْ'], 
   'وهنوا': [
           'وَهَنُوا'], 
   'المفسدون': [
              'الْمُفْسِدُونَ'], 
   'لإلى': [
          'لَإِلَى'], 
   'فاستوى': [
            'فَاسْتَوَى'], 
   'الأعمى': [
            'الْأَعْمَى'], 
   'أفتعبدون': [
              'أَفَتَعْبُدُونَ'], 
   'شعيبا': [
           'شُعَيْبًا'], 
   'غمرتهم': [
            'غَمْرَتِهِمْ'], 
   'ويعمل': [
           'وَيَعْمَلْ'], 
   'لقدير': [
           'لَقَدِيرٌ'], 
   'لنبوئنهم': [
              'لَنُبَوِّئَنَّهُمْ'], 
   'كما': [
         'كَمَا'], 
   'مقام': [
          'مَقَامَ',
          'مُقَامَ',
          'مَقَامِ',
          'مَقَامُ',
          'مَقَامٍ',
          'مَقَامٌ'], 
   'والعنهم': [
             'وَالْعَنْهُمْ'], 
   'منتظرون': [
             'مُنْتَظِرُونَ'], 
   'بأهدى': [
           'بِأَهْدَى'], 
   'تصلى': [
          'تَصْلَى'], 
   'متعمدا': [
            'مُتَعَمِّدًا'], 
   'الساق': [
           'السَّاقُ'], 
   'ترونها': [
            'تَرَوْنَهَا'], 
   'بنصره': [
           'بِنَصْرِهِ'], 
   'فليتقوا': [
             'فَلْيَتَّقُوا'], 
   'ليجمعنكم': [
              'لَيَجْمَعَنَّكُمْ'], 
   'نعمة': [
          'نِعْمَةَ',
          'نِعْمَةً',
          'نِعْمَةٍ',
          'نِعْمَةٌ',
          'نِعْمَةُ'], 
   'عهدا': [
          'عَهْدًا'], 
   'تواب': [
          'تَوَّابٌ'], 
   'عسعس': [
          'عَسْعَسَ'], 
   'مشاء': [
          'مَشَّاءٍ'], 
   'أرجل': [
          'أَرْجُلٌ'], 
   'قانتا': [
           'قَانِتًا'], 
   'أرجه': [
          'أَرْجِهْ'], 
   'بآياتنا': [
             'بِآيَاتِنَا'], 
   'ووجدك': [
           'وَوَجَدَكَ'], 
   'خرقها': [
           'خَرَقَهَا'], 
   'عارضا': [
           'عَارِضًا'], 
   'فوقاه': [
           'فَوَقَاهُ'], 
   'ورائكم': [
            'وَرَائِكُمْ'], 
   'نفاقا': [
           'نِفَاقًا'], 
   'فرطا': [
          'فُرُطًا'], 
   'أنعمها': [
            'أَنْعَمَهَا'], 
   'ترجف': [
          'تَرْجُفُ'], 
   'والأنصار': [
              'وَالْأَنْصَارِ'], 
   'فارزقوهم': [
              'فَارْزُقُوهُمْ'], 
   'يضر': [
         'يَضُرَّ'], 
   'ونداء': [
           'وَنِدَاءً'], 
   'فرطت': [
          'فَرَّطْتُ'], 
   'تستفتيان': [
              'تَسْتَفْتِيَانِ'], 
   'بكتابي': [
            'بِكِتَابِي'], 
   'وزروع': [
           'وَزُرُوعٍ'], 
   'تصبهم': [
           'تُصِبْهُمْ'], 
   'الدواب': [
            'الدَّوَابِّ'], 
   'قضاها': [
           'قَضَاهَا'], 
   'الثقلان': [
             'الثَّقَلَانِ'], 
   'والأنصاب': [
              'وَالْأَنْصَابُ'], 
   'تأتوا': [
           'تَأْتُوا'], 
   'شهدتم': [
           'شَهِدْتُمْ'], 
   'بأسهم': [
           'بَأْسُهُمْ'], 
   'أهلها': [
           'أَهْلِهَا',
           'أَهْلَهَا',
           'أَهْلُهَا'], 
   'ونذيرا': [
            'وَنَذِيرًا'], 
   'اختلاق': [
            'اخْتِلَاقٌ'], 
   'مرتين': [
           'مَرَّتَيْنِ'], 
   'لآدم': [
          'لِآدَمَ'], 
   'لمجموعون': [
              'لَمَجْمُوعُونَ'], 
   'زجرة': [
          'زَجْرَةٌ'], 
   'تفندون': [
            'تُفَنِّدُونِ'], 
   'مائة': [
          'مِائَةَ',
          'مِائَةٌ',
          'مِائَةِ',
          'مِائَةُ',
          'مِائَةٍ'], 
   'مثلها': [
           'مِثْلُهَا',
           'مِثْلَهَا',
           'مِثْلِهَا'], 
   'نهار': [
          'نَهَارٍ'], 
   'شقا': [
         'شَقًّا'], 
   'ولنسألن': [
             'وَلَنَسْأَلَنَّ'], 
   'تتخذ': [
          'تَتَّخِذَ'], 
   'فوجا': [
          'فَوْجًا'], 
   'أهلهم': [
           'أَهْلِهِمْ',
           'أَهْلِهِمُ'], 
   'ينكرونها': [
              'يُنْكِرُونَهَا'], 
   'ألوانه': [
            'أَلْوَانُهُ'], 
   'إمام': [
          'إِمَامٍ'], 
   'العادين': [
             'الْعَادِّينَ'], 
   'فوجد': [
          'فَوَجَدَ'], 
   'فرطنا': [
           'فَرَّطْنَا'], 
   'مؤذن': [
          'مُؤَذِّنٌ'], 
   'شقي': [
         'شَقِيٌّ'], 
   'استحفظوا': [
              'اسْتُحْفِظُوا'], 
   'مستهم': [
           'مَسَّتْهُمْ',
           'مَسَّتْهُمُ'], 
   'وآتاني': [
            'وَآتَانِي'], 
   'تروها': [
           'تَرَوْهَا'], 
   'فحيوا': [
           'فَحَيُّوا'], 
   'وستردون': [
             'وَسَتُرَدُّونَ'], 
   'مشكورا': [
            'مَشْكُورًا'], 
   'يأخذهم': [
            'يَأْخُذَهُمْ'], 
   'مشتركون': [
             'مُشْتَرِكُونَ'], 
   'لآت': [
         'لَآتٍ'], 
   'لتعجل': [
           'لِتَعْجَلَ'], 
   'اؤتمن': [
           'اؤْتُمِنَ'], 
   'بخازنين': [
             'بِخَازِنِينَ'], 
   'تجعل': [
          'تَجْعَلْ',
          'تَجْعَلَ'], 
   'وسكنتم': [
            'وَسَكَنْتُمْ'], 
   'هلك': [
         'هَلَكَ'], 
   'هلم': [
         'هَلُمَّ'], 
   'يردونكم': [
             'يَرُدُّونَكُمْ'], 
   'نخيل': [
          'نَخِيلٍ'], 
   'الحلية': [
            'الْحِلْيَةِ'], 
   'تنذر': [
          'تُنْذِرُ'], 
   'ترجع': [
          'تُرْجَعُ'], 
   'يضل': [
         'يُضِلُّ',
         'يَضِلُّ',
         'يُضِلَّ',
         'يُضَلُّ'], 
   'يشفع': [
          'يَشْفَعْ',
          'يَشْفَعُ'], 
   'يأكلوا': [
            'يَأْكُلُوا'], 
   'أمرتهم': [
            'أَمَرْتَهُمْ'], 
   'وأبلغكم': [
             'وَأُبَلِّغُكُمْ'], 
   'جاز': [
         'جَازٍ'], 
   'ويميت': [
           'وَيُمِيتُ'], 
   'حية': [
         'حَيَّةٌ'], 
   'وأبصاركم': [
              'وَأَبْصَارَكُمْ'], 
   'فأنشأنا': [
             'فَأَنْشَأْنَا'], 
   'تدعوا': [
           'تَدْعُوا'], 
   'التوراة': [
             'التَّوْرَاةِ',
             'التَّوْرَاةَ',
             'التَّوْرَاةُ'], 
   'الإصلاح': [
             'الْإِصْلَاحَ'], 
   'بنيانه': [
            'بُنْيَانَهُ'], 
   'مستبشرة': [
             'مُسْتَبْشِرَةٌ'], 
   'تداركه': [
            'تَدَارَكَهُ'], 
   'والتقوى': [
             'وَالتَّقْوَى'], 
   'طرفك': [
          'طَرْفُكَ'], 
   'ليبلو': [
           'لِيَبْلُوَ'], 
   'ويقيموا': [
             'وَيُقِيمُوا'], 
   'علمنا': [
           'عَلِمْنَا',
           'عُلِّمْنَا'], 
   'طرفي': [
          'طَرَفَيِ'], 
   'أثاثا': [
           'أَثَاثًا'], 
   'أثمر': [
          'أَثْمَرَ'], 
   'فيميلون': [
             'فَيَمِيلُونَ'], 
   'وثمود': [
           'وَثَمُودَ',
           'وَثَمُودُ'], 
   'لضالون': [
            'لَضَالُّونَ'], 
   'تدعون': [
           'تَدْعُونَ',
           'تُدْعَوْنَ',
           'تَدَّعُونَ'], 
   'وزنا': [
          'وَزْنًا'], 
   'بحمد': [
          'بِحَمْدِ'], 
   'بنيانا': [
            'بُنْيَانًا'], 
   'بلحيتي': [
            'بِلِحْيَتِي'], 
   'آن': [
        'آنٍ'], 
   'وملئهم': [
            'وَمَلَئِهِمْ'], 
   'عجل': [
         'عَجِّلْ',
         'عَجَلٍ'], 
   'ونصرناه': [
             'وَنَصَرْنَاهُ'], 
   'طرفا': [
          'طَرَفًا'], 
   'وأقرب': [
           'وَأَقْرَبَ'], 
   'ويقيمون': [
             'وَيُقِيمُونَ'], 
   'ونذكرك': [
            'وَنَذْكُرَكَ'], 
   'يجعله': [
           'يَجْعَلُهُ',
           'يَجْعَلْهُ'], 
   'دخلوا': [
           'دَخَلُوا'], 
   'الحاسبين': [
              'الْحَاسِبِينَ'], 
   'الجوار': [
            'الْجَوَارِ'], 
   'تاب': [
         'تَابَ'], 
   'واستحيوا': [
              'وَاسْتَحْيُوا'], 
   'فساهم': [
           'فَسَاهَمَ'], 
   'تصديق': [
           'تَصْدِيقَ'], 
   'وللأرض': [
            'وَلِلْأَرْضِ'], 
   'كلمات': [
           'كَلِمَاتُ',
           'كَلِمَاتٍ'], 
   'والطير': [
            'وَالطَّيْرَ',
            'وَالطَّيْرِ',
            'وَالطَّيْرُ'], 
   'المباركة': [
              'الْمُبَارَكَةِ'], 
   'وميثاقه': [
             'وَمِيثَاقَهُ'], 
   'حافظا': [
           'حَافِظًا'], 
   'يحضرون': [
            'يَحْضُرُونِ'], 
   'اتباع': [
           'اتِّبَاعَ'], 
   'محررا': [
           'مُحَرَّرًا'], 
   'نقضهم': [
           'نَقْضِهِمْ'], 
   'خير': [
         'خَيْرٌ',
         'خَيْرُ',
         'خَيْرٍ',
         'خَيْرَ'], 
   'نزلت': [
          'نُزِّلَتْ'], 
   'قومنا': [
           'قَوْمَنَا',
           'قَوْمِنَا',
           'قَوْمُنَا'], 
   'أأشفقتم': [
             'أَأَشْفَقْتُمْ'], 
   'نبأني': [
           'نَبَّأَنِيَ'], 
   'والغارمين': [
               'وَالْغَارِمِينَ'], 
   'فغلوه': [
           'فَغُلُّوهُ'], 
   'نزلا': [
          'نُزُلًا'], 
   'تكفر': [
          'تَكْفُرْ'], 
   'جرم': [
         'جَرَمَ'], 
   'الإثم': [
           'الْإِثْمِ',
           'الْإِثْمَ'], 
   'جرف': [
         'جُرُفٍ'], 
   'ممدودا': [
            'مَمْدُودًا'], 
   'والإحسان': [
              'وَالْإِحْسَانِ'], 
   'ويهديكم': [
             'وَيَهْدِيَكُمْ'], 
   'نادوا': [
           'نَادُوا'], 
   'ولعب': [
          'وَلَعِبٌ'], 
   'وللمطلقات': [
               'وَلِلْمُطَلَّقَاتِ'], 
   'فرحين': [
           'فَرِحِينَ'], 
   'بالذين': [
            'بِالَّذِينَ'], 
   'يغررك': [
           'يَغْرُرْكَ'], 
   'لميتون': [
            'لَمَيِّتُونَ'], 
   'غفرانك': [
            'غُفْرَانَكَ'], 
   'ولتجزى': [
            'وَلِتُجْزَى'], 
   'فقرأه': [
           'فَقَرَأَهُ'], 
   'أجعلنا': [
            'أَجَعَلْنَا'], 
   'شعيب': [
          'شُعَيْبُ',
          'شُعَيْبٌ'], 
   'رأوها': [
           'رَأَوْهَا'], 
   'بشرناك': [
            'بَشَّرْنَاكَ'], 
   'كذاب': [
          'كَذَّابٌ'], 
   'تستطع': [
           'تَسْتَطِعْ'], 
   'مزجاة': [
           'مُزْجَاةٍ'], 
   'السر': [
          'السِّرَّ'], 
   'بالمهتدين': [
               'بِالْمُهْتَدِينَ'], 
   'وعيون': [
           'وَعُيُونٍ'], 
   'تخافي': [
           'تَخَافِي'], 
   'لنسفعا': [
            'لَنَسْفَعًا'], 
   'فسلام': [
           'فَسَلَامٌ'], 
   'ساجدا': [
           'سَاجِدًا'], 
   'نجيناه': [
            'نَجَّيْنَاهُ'], 
   'نزله': [
          'نَزَّلَهُ'], 
   'ومغانم': [
            'وَمَغَانِمَ'], 
   'عزيز': [
          'عَزِيزٌ',
          'عَزِيزٍ'], 
   'عزير': [
          'عُزَيْرٌ'], 
   'النار': [
           'النَّارِ',
           'النَّارُ',
           'النَّارَ'], 
   'يسرون': [
           'يُسِرُّونَ'], 
   'الناس': [
           'النَّاسِ',
           'النَّاسَ',
           'النَّاسُ'], 
   'عفوا': [
          'عَفُوًّا',
          'عَفَوْا'], 
   'وعظهم': [
           'وَعِظْهُمْ'], 
   'وكانت': [
           'وَكَانَتِ',
           'وَكَانَتْ'], 
   'جهرة': [
          'جَهْرَةً'], 
   'أحدث': [
          'أُحْدِثَ'], 
   'فاهدوهم': [
             'فَاهْدُوهُمْ'], 
   'والنطيحة': [
              'وَالنَّطِيحَةُ'], 
   'مسحورا': [
            'مَسْحُورًا'], 
   'أحدا': [
          'أَحَدًا'], 
   'أبرح': [
          'أَبْرَحُ',
          'أَبْرَحَ'], 
   'المدينة': [
             'الْمَدِينَةِ',
             'الْمَدِينَةَ'], 
   'أولئكم': [
            'أُولَئِكُمْ'], 
   'تقعدوا': [
            'تَقْعُدُوا'], 
   'مدبرين': [
            'مُدْبِرِينَ'], 
   'هزوا': [
          'هُزُوًا'], 
   'ردوا': [
          'رُدُّوا'], 
   'لووا': [
          'لَوَّوْا'], 
   'ويحيى': [
           'وَيَحْيَى'], 
   'ويحيي': [
           'وَيُحْيِي'], 
   'زيتونة': [
            'زَيْتُونَةٍ'], 
   'حمإ': [
         'حَمَإٍ'], 
   'وكأس': [
          'وَكَأْسٍ'], 
   'فذروها': [
            'فَذَرُوهَا'], 
   'بعدا': [
          'بُعْدًا'], 
   'عصيب': [
          'عَصِيبٌ'], 
   'لتشهدون': [
             'لَتَشْهَدُونَ'], 
   'تورون': [
           'تُورُونَ'], 
   'ويصلى': [
           'وَيَصْلَى'], 
   'حمر': [
         'حُمُرٌ'], 
   'فاقع': [
          'فَاقِعٌ'], 
   'فاقض': [
          'فَاقْضِ'], 
   'الفجر': [
           'الْفَجْرِ'], 
   'مقاليد': [
            'مَقَالِيدُ'], 
   'السيل': [
           'السَّيْلُ'], 
   'حمل': [
         'حَمْلٍ',
         'حِمْلُ',
         'حُمِّلَ',
         'حَمَلَ'], 
   'غدوا': [
          'غُدُوًّا'], 
   'بعدك': [
          'بَعْدِكَ'], 
   'جعلناكم': [
             'جَعَلْنَاكُمْ'], 
   'فلذلك': [
           'فَلِذَلِكَ'], 
   'بعده': [
          'بَعْدِهِ',
          'بَعْدَهُ'], 
   'اخرج': [
          'اخْرُجْ'], 
   'الأنفال': [
             'الْأَنْفَالِ',
             'الْأَنْفَالُ'], 
   'بعدي': [
          'بَعْدِي'], 
   'يذرؤكم': [
            'يَذْرَؤُكُمْ'], 
   'تشعرون': [
            'تَشْعُرُونَ'], 
   'ويصلح': [
           'وَيُصْلِحُ'], 
   'وأسررت': [
            'وَأَسْرَرْتُ'], 
   'وينقلب': [
            'وَيَنْقَلِبُ'], 
   'وعدك': [
          'وَعْدَكَ'], 
   'أوتي': [
          'أُوتِيَ'], 
   'نادينا': [
            'نَادَيْنَا'], 
   'والفواحش': [
              'وَالْفَوَاحِشَ'], 
   'يطمثهن': [
            'يَطْمِثْهُنَّ'], 
   'السيئ': [
           'السَّيِّئِ',
           'السَّيِّئُ'], 
   'قاتلوا': [
            'قَاتِلُوا',
            'قَاتَلُوا'], 
   'اليمين': [
            'الْيَمِينِ'], 
   'نخسف': [
          'نَخْسِفْ'], 
   'وإدبار': [
            'وَإِدْبَارَ'], 
   'صدقاتهن': [
             'صَدُقَاتِهِنَّ'], 
   'أكفرتم': [
            'أَكَفَرْتُمْ'], 
   'والسوء': [
            'وَالسُّوءَ'], 
   'ألفوا': [
           'أَلْفَوْا'], 
   'النعم': [
           'النَّعَمِ'], 
   'وعدو': [
          'وَعَدُوٌّ'], 
   'سبحانه': [
            'سُبْحَانَهُ'], 
   'شفاء': [
          'شِفَاءٌ'], 
   'سبحانك': [
            'سُبْحَانَكَ'], 
   'ويستعجلونك': [
                'وَيَسْتَعْجِلُونَكَ'], 
   'وسخر': [
          'وَسَخَّرَ'], 
   'تفقدون': [
            'تَفْقِدُونَ'], 
   'الصخرة': [
            'الصَّخْرَةِ'], 
   'عاكفين': [
            'عَاكِفِينَ'], 
   'خالاتكم': [
             'خَالَاتِكُمْ'], 
   'قطوفها': [
            'قُطُوفُهَا'], 
   'لنفسي': [
           'لِنَفْسِي'], 
   'لنفسه': [
           'لِنَفْسِهِ'], 
   'بقلها': [
           'بَقْلِهَا'], 
   'فبدل': [
          'فَبَدَّلَ'], 
   'يده': [
         'يَدَهُ'], 
   'أخفيها': [
            'أُخْفِيهَا'], 
   'رهبة': [
          'رَهْبَةً'], 
   'فاستجبتم': [
              'فَاسْتَجَبْتُمْ'], 
   'شيخ': [
         'شَيْخٌ'], 
   'وزين': [
          'وَزَيَّنَ',
          'وَزُيِّنَ'], 
   'وتودون': [
            'وَتَوَدُّونَ'], 
   'أومن': [
          'أَوَمَنْ'], 
   'بورقكم': [
            'بِوَرِقِكُمْ'], 
   'تسلمون': [
            'تُسْلِمُونَ'], 
   'خلف': [
         'خَلْفٌ'], 
   'خلق': [
         'خَلَقَ',
         'خَلْقٍ',
         'خَلْقِ',
         'خُلِقَ',
         'خَلْقَ',
         'خَلْقُ',
         'خُلُقُ',
         'خُلُقٍ'], 
   'يدعوهم': [
            'يَدْعُوهُمْ'], 
   'آباءنا': [
            'آبَاءَنَا'], 
   'صبغة': [
          'صِبْغَةَ',
          'صِبْغَةً'], 
   'بيوتا': [
           'بُيُوتًا'], 
   'يغنيكم': [
            'يُغْنِيكُمُ'], 
   'وحصيد': [
           'وَحَصِيدٌ'], 
   'تبايعتم': [
             'تَبَايَعْتُمْ'], 
   'العاكف': [
            'الْعَاكِفُ'], 
   'واستغشوا': [
              'وَاسْتَغْشَوْا'], 
   'فاسقا': [
           'فَاسِقًا'], 
   'خلة': [
         'خُلَّةٌ'], 
   'خلت': [
         'خَلَتْ',
         'خَلَتِ'], 
   'ليبعثن': [
            'لَيَبْعَثَنَّ'], 
   'تلقاء': [
           'تِلْقَاءَ',
           'تِلْقَاءِ'], 
   'خلا': [
         'خَلَا'], 
   'الأذلين': [
             'الْأَذَلِّينَ'], 
   'اشتدت': [
           'اشْتَدَّتْ'], 
   'أظفركم': [
            'أَظْفَرَكُمْ'], 
   'أتعدانني': [
              'أَتَعِدَانِنِي'], 
   'ولتعرفنهم': [
               'وَلَتَعْرِفَنَّهُمْ'], 
   'لنفسد': [
           'لِنُفْسِدَ'], 
   'فبدت': [
          'فَبَدَتْ'], 
   'تمنوا': [
           'تَمُنُّوا',
           'تَمَنَّوْا'], 
   'كالصريم': [
             'كَالصَّرِيمِ'], 
   'امرأة': [
           'امْرَأَةٌ',
           'امْرَأَةً'], 
   'فبدأ': [
          'فَبَدَأَ'], 
   'امرأت': [
           'امْرَأَتُ',
           'امْرَأَتَ'], 
   'سراجا': [
           'سِرَاجًا'], 
   'لنريك': [
           'لِنُرِيَكَ'], 
   'يتقون': [
           'يَتَّقُونَ'], 
   'آذانهم': [
            'آذَانِهِمْ'], 
   'سامدون': [
            'سَامِدُونَ'], 
   'الأميين': [
             'الْأُمِّيِّينَ'], 
   'فتشقى': [
           'فَتَشْقَى'], 
   'عماتك': [
           'عَمَّاتِكَ'], 
   'البرق': [
           'الْبَرْقَ',
           'الْبَرْقُ'], 
   'وسيدا': [
           'وَسَيِّدًا'], 
   'لقادر': [
           'لَقَادِرٌ'], 
   'أموت': [
          'أَمُوتُ'], 
   'لنريه': [
           'لِنُرِيَهُ'], 
   'استعينوا': [
              'اسْتَعِينُوا'], 
   'نورث': [
          'نُورِثُ'], 
   'وكلماته': [
             'وَكَلِمَاتِهِ'], 
   'زعيم': [
          'زَعِيمٌ'], 
   'للهدى': [
           'لَلْهُدَى'], 
   'شئنا': [
          'شِئْنَا'], 
   'ويقطع': [
           'وَيَقْطَعَ'], 
   'نورا': [
          'نُورًا'], 
   'يعمروا': [
            'يَعْمُرُوا'], 
   'عالم': [
          'عَالِمُ',
          'عَالِمِ',
          'عَالِمَ'], 
   'المهد': [
           'الْمَهْدِ'], 
   'تصدقوا': [
            'تَصَدَّقُوا'], 
   'فاعدلوا': [
             'فَاعْدِلُوا'], 
   'والتفت': [
            'وَالْتَفَّتِ'], 
   'خلالها': [
            'خِلَالَهَا'], 
   'فآمنوا': [
            'فَآمِنُوا',
            'فَآمَنُوا'], 
   'قردة': [
          'قِرَدَةً'], 
   'أعطوا': [
           'أُعْطُوا'], 
   'يلعنهم': [
            'يَلْعَنُهُمُ'], 
   'غاشية': [
           'غَاشِيَةٌ'], 
   'وطور': [
          'وَطُورِ'], 
   'الراحمين': [
              'الرَّاحِمِينَ'], 
   'سنكتب': [
           'سَنَكْتُبُ'], 
   'ضلال': [
          'ضَلَالٍ'], 
   'يأكلون': [
            'يَأْكُلُونَ'], 
   'وعدنا': [
           'وَعَدَنَا',
           'وُعِدْنَا'], 
   'تماما': [
           'تَمَامًا'], 
   'كانتا': [
           'كَانَتَا'], 
   'ينابيع': [
            'يَنَابِيعَ'], 
   'ضرب': [
         'ضَرَبَ',
         'ضُرِبَ'], 
   'تشاقون': [
            'تُشَاقُّونَ'], 
   'عفا': [
         'عَفَا'], 
   'تجلى': [
          'تَجَلَّى'], 
   'ضرا': [
         'ضَرًّا'], 
   'محله': [
          'مَحِلَّهُ'], 
   'يفتح': [
          'يَفْتَحِ',
          'يَفْتَحُ'], 
   'فذوقوه': [
            'فَذُوقُوهُ'], 
   'فأكثروا': [
             'فَأَكْثَرُوا'], 
   'ولتسمعن': [
             'وَلَتَسْمَعُنَّ'], 
   'تقاتلون': [
             'تُقَاتِلُونَ'], 
   'فصدوا': [
           'فَصَدُّوا'], 
   'فمنهم': [
           'فَمِنْهُمْ'], 
   'يلهث': [
          'يَلْهَثْ'], 
   'تعذبهم': [
            'تُعَذِّبْهُمْ'], 
   'فوجدا': [
           'فَوَجَدَا'], 
   'نعذب': [
          'نُعَذِّبْ'], 
   'نوره': [
          'نُورِهِ',
          'نُورَهُ'], 
   'يخسرون': [
            'يُخْسِرُونَ'], 
   'أشحة': [
          'أَشِحَّةً'], 
   'بعصاك': [
           'بِعَصَاكَ'], 
   'وصية': [
          'وَصِيَّةٍ',
          'وَصِيَّةً'], 
   'نقصه': [
          'نَقُصُّهُ'], 
   'شره': [
         'شَرُّهُ'], 
   'إحداهما': [
             'إِحْدَاهُمَا'], 
   'المفسدين': [
              'الْمُفْسِدِينَ'], 
   'الحسنيين': [
              'الْحُسْنَيَيْنِ'], 
   'وتضع': [
          'وَتَضَعُ'], 
   'وآخرنا': [
            'وَآخِرِنَا'], 
   'سأنزل': [
           'سَأُنْزِلُ'], 
   'الذنب': [
           'الذَّنْبِ'], 
   'تعقلون': [
            'تَعْقِلُونَ'], 
   'واجتبيناهم': [
                'وَاجْتَبَيْنَاهُمْ'], 
   'أزواجه': [
            'أَزْوَاجِهِ',
            'أَزْوَاجَهُ'], 
   'فهو': [
         'فَهُوَ'], 
   'مسلما': [
           'مُسْلِمًا'], 
   'وليأخذوا': [
              'وَلْيَأْخُذُوا'], 
   'بعثناكم': [
             'بَعَثْنَاكُمْ'], 
   'يحاجون': [
            'يُحَاجُّونَ'], 
   'حاجة': [
          'حَاجَةً'], 
   'بالمعروف': [
              'بِالْمَعْرُوفِ'], 
   'جهزهم': [
           'جَهَّزَهُمْ'], 
   'مقاعد': [
           'مَقَاعِدَ'], 
   'فهل': [
         'فَهَلْ'], 
   'أستغفرت': [
             'أَسْتَغْفَرْتَ'], 
   'فاجلدوا': [
             'فَاجْلِدُوا'], 
   'العجل': [
           'الْعِجْلَ'], 
   'واسجد': [
           'وَاسْجُدْ'], 
   'عندنا': [
           'عِنْدِنَا',
           'عِنْدَنَا'], 
   'فأي': [
         'فَأَيُّ',
         'فَأَيَّ'], 
   'ويدعون': [
            'وَيُدْعَوْنَ'], 
   'لأبي': [
          'لِأَبِي'], 
   'أبحر': [
          'أَبْحُرٍ'], 
   'ملكوت': [
           'مَلَكُوتُ',
           'مَلَكُوتِ',
           'مَلَكُوتَ'], 
   'غدا': [
         'غَدًا'], 
   'وليزيدن': [
             'وَلَيَزِيدَنَّ'], 
   'غروبها': [
            'غُرُوبِهَا'], 
   'كيدون': [
           'كِيدُونِ'], 
   'فبهت': [
          'فَبُهِتَ'], 
   'الرعب': [
           'الرُّعْبَ'], 
   'الخاشعين': [
              'الْخَاشِعِينَ'], 
   'وأنهار': [
            'وَأَنْهَارٌ'], 
   'يحزنهم': [
            'يَحْزُنُهُمُ'], 
   'يتيما': [
           'يَتِيمًا'], 
   'المقبوحين': [
               'الْمَقْبُوحِينَ'], 
   'وإسرائيل': [
              'وَإِسْرَائِيلَ'], 
   'يعفون': [
           'يَعْفُونَ'], 
   'نقصص': [
          'نَقْصُصْ'], 
   'يولهم': [
           'يُوَلِّهِمْ'], 
   'حطبا': [
          'حَطَبًا'], 
   'فبذلك': [
           'فَبِذَلِكَ'], 
   'نخوض': [
          'نَخُوضُ'], 
   'كذلك': [
          'كَذَلِكَ',
          'كَذَلِكِ'], 
   'ونريد': [
           'وَنُرِيدُ'], 
   'يطهرن': [
           'يَطْهُرْنَ'], 
   'سمعوا': [
           'سَمِعُوا'], 
   'وله': [
         'وَلَهُ'], 
   'ولن': [
         'وَلَنْ'], 
   'ولم': [
         'وَلَمْ'], 
   'ولك': [
         'وَلَكَ'], 
   'أؤنبئكم': [
             'أَؤُنَبِّئُكُمْ'], 
   'افتريته': [
             'افْتَرَيْتُهُ'], 
   'تبدونها': [
             'تُبْدُونَهَا'], 
   'ولي': [
         'وَلِيٍّ',
         'وَلِيٌّ',
         'وَلِيُّ',
         'وَلِيَ'], 
   'ولى': [
         'وَلَّى'], 
   'ولو': [
         'وَلَوْ',
         'وَلَوِ'], 
   'يضاعفها': [
             'يُضَاعِفْهَا'], 
   'لظلوا': [
           'لَظَلُّوا'], 
   'عتل': [
         'عُتُلٍّ'], 
   'خاطبهم': [
            'خَاطَبَهُمُ'], 
   'ونعم': [
          'وَنِعْمَ'], 
   'حفظهما': [
            'حِفْظُهُمَا'], 
   'أعجاز': [
           'أَعْجَازُ'], 
   'أحدنا': [
           'أَحَدَنَا'], 
   'وأهله': [
           'وَأَهْلَهُ'], 
   'ظهرك': [
          'ظَهْرَكَ'], 
   'وأهلك': [
           'وَأَهْلَكَ'], 
   'الوالدين': [
              'الْوَالِدَيْنِ'], 
   'أنصح': [
          'أَنْصَحَ'], 
   'ظلمتم': [
           'ظَلَمْتُمْ'], 
   'فتعالين': [
             'فَتَعَالَيْنَ'], 
   'وبمن': [
          'وَبِمَنْ'], 
   'فسواها': [
            'فَسَوَّاهَا'], 
   'لظلوم': [
           'لَظَلُومٌ'], 
   'وماذا': [
           'وَمَاذَا'], 
   'وخفية': [
           'وَخُفْيَةً'], 
   'إيمانا': [
            'إِيمَانًا'], 
   'بضاعتهم': [
             'بِضَاعَتَهُمْ'], 
   'تقسموا': [
            'تُقْسِمُوا'], 
   'خرابها': [
            'خَرَابِهَا'], 
   'ودسر': [
          'وَدُسُرٍ'], 
   'الصمد': [
           'الصَّمَدُ'], 
   'فأخرجهما': [
              'فَأَخْرَجَهُمَا'], 
   'يتلقى': [
           'يَتَلَقَّى'], 
   'يظلم': [
          'يَظْلِمُ',
          'يَظْلِمْ'], 
   'حسنات': [
           'حَسَنَاتٍ'], 
   'وحفظناها': [
              'وَحَفِظْنَاهَا'], 
   'هذان': [
          'هَذَانِ'], 
   'البلاء': [
            'الْبَلَاءُ'], 
   'وبما': [
          'وَبِمَا'], 
   'فسواهن': [
            'فَسَوَّاهُنَّ'], 
   'رأيت': [
          'رَأَيْتَ',
          'رَأَيْتُ'], 
   'وواعدنا': [
             'وَوَاعَدْنَا'], 
   'أنطق': [
          'أَنْطَقَ'], 
   'ثاقب': [
          'ثَاقِبٌ'], 
   'مظلوما': [
            'مَظْلُومًا'], 
   'متاعهم': [
            'مَتَاعَهُمْ'], 
   'ولا': [
         'وَلَا'], 
   'بطشا': [
          'بَطْشًا'], 
   'أبوك': [
          'أَبُوكِ'], 
   'فينا': [
          'فِينَا'], 
   'يظن': [
         'يَظُنُّ'], 
   'ولد': [
         'وَلَدٌ',
         'وَلَدَ',
         'وَلَدٍ',
         'وُلِدَ'], 
   'بفاكهة': [
            'بِفَاكِهَةٍ'], 
   'ألقها': [
           'أَلْقِهَا'], 
   'الأقاويل': [
              'الْأَقَاوِيلِ'], 
   'قرئ': [
         'قُرِئَ'], 
   'يشكر': [
          'يَشْكُرُ',
          'يَشْكُرْ'], 
   'العماد': [
            'الْعِمَادِ'], 
   'تستطيعوا': [
              'تَسْتَطِيعُوا'], 
   'قرح': [
         'قَرْحٌ'], 
   'قرت': [
         'قُرَّتُ'], 
   'أتستبدلون': [
               'أَتَسْتَبْدِلُونَ'], 
   'لتشقى': [
           'لِتَشْقَى'], 
   'قبضناه': [
            'قَبَضْنَاهُ'], 
   'ومعين': [
           'وَمَعِينٍ'], 
   'أيدك': [
          'أَيَّدَكَ'], 
   'وجاءتهم': [
             'وَجَاءَتْهُمْ'], 
   'جعله': [
          'جَعَلَهُ'], 
   'رطبا': [
          'رُطَبًا'], 
   'أيدي': [
          'أَيْدِيَ',
          'أَيْدِي'], 
   'وأغطش': [
           'وَأَغْطَشَ'], 
   'وعفا': [
          'وَعَفَا'], 
   'ينادونك': [
             'يُنَادُونَكَ'], 
   'تنكح': [
          'تَنْكِحَ'], 
   'سمعتم': [
           'سَمِعْتُمْ'], 
   'طريق': [
          'طَرِيقَ',
          'طَرِيقٍ'], 
   'يرضه': [
          'يَرْضَهُ'], 
   'واللذان': [
             'وَاللَّذَانِ'], 
   'لجعلناه': [
             'لَجَعَلْنَاهُ'], 
   'فأخرجنا': [
             'فَأَخْرَجْنَا'], 
   'ويستغفرون': [
               'وَيَسْتَغْفِرُونَ'], 
   'رسوله': [
           'رَسُولِهِ',
           'رَسُولَهُ',
           'رَسُولُهُ'], 
   'أبصار': [
           'أَبْصَارُ'], 
   'المودة': [
            'الْمَوَدَّةَ'], 
   'لنحضرنهم': [
              'لَنُحْضِرَنَّهُمْ'], 
   'فالزاجرات': [
               'فَالزَّاجِرَاتِ'], 
   'أبا': [
         'أَبَا',
         'أَبًا'], 
   'يغشاه': [
           'يَغْشَاهُ'], 
   'المنتهى': [
             'الْمُنْتَهَى'], 
   'واليتامى': [
              'وَالْيَتَامَى'], 
   'يستكبرون': [
              'يَسْتَكْبِرُونَ'], 
   'ويستغفروا': [
               'وَيَسْتَغْفِرُوا'], 
   'رسولا': [
           'رَسُولًا',
           'رَسُولَا'], 
   'والنساء': [
             'وَالنِّسَاءِ'], 
   'الزينة': [
            'الزِّينَةِ'], 
   'تستفتحوا': [
              'تَسْتَفْتِحُوا'], 
   'واصبا': [
           'وَاصِبًا'], 
   'ننسها': [
           'نُنْسِهَا'], 
   'لتهدي': [
           'لَتَهْدِي'], 
   'والأمر': [
            'وَالْأَمْرُ'], 
   'والطور': [
            'وَالطُّورِ'], 
   'الفاحشة': [
             'الْفَاحِشَةَ',
             'الْفَاحِشَةُ'], 
   'المرجومين': [
               'الْمَرْجُومِينَ'], 
   'تستطيعون': [
              'تَسْتَطِيعُونَ'], 
   'الفرحين': [
             'الْفَرِحِينَ'], 
   'أخانا': [
           'أَخَانَا'], 
   'قرى': [
         'قُرًى'], 
   'مقتدون': [
            'مُقْتَدُونَ'], 
   'فيحلفون': [
             'فَيَحْلِفُونَ'], 
   'أصابكم': [
            'أَصَابَكُمْ'], 
   'يعرجون': [
            'يَعْرُجُونَ'], 
   'سدرة': [
          'سِدْرَةِ'], 
   'وصدوكم': [
            'وَصَدُّوكُمْ'], 
   'أيقاظا': [
            'أَيْقَاظًا'], 
   'يرثها': [
           'يَرِثُهَا'], 
   'تخاف': [
          'تَخَافُ'], 
   'ترضونها': [
             'تَرْضَوْنَهَا'], 
   'ولزوجك': [
            'وَلِزَوْجِكَ'], 
   'بسا': [
         'بَسًّا'], 
   'كتاب': [
          'كِتَابٌ',
          'كِتَابٍ',
          'كِتَابِ',
          'كِتَابَ',
          'كِتَابُ'], 
   'يدرككم': [
            'يُدْرِكْكُمُ'], 
   'غلظة': [
          'غِلْظَةً'], 
   'آتوني': [
           'آتُونِي'], 
   'ألكم': [
          'أَلَكُمُ'], 
   'وللكافرين': [
               'وَلِلْكَافِرِينَ'], 
   'ولولا': [
           'وَلَوْلَا'], 
   'العسر': [
           'الْعُسْرِ',
           'الْعُسْرَ'], 
   'بسط': [
         'بَسَطَ'], 
   'بكيدهن': [
            'بِكَيْدِهِنَّ'], 
   'الرفث': [
           'الرَّفَثُ'], 
   'الرفد': [
           'الرِّفْدُ'], 
   'القسط': [
           'الْقِسْطَ'], 
   'تظمأ': [
          'تَظْمَأُ'], 
   'وأعمى': [
           'وَأَعْمَى'], 
   'سدا': [
         'سَدًّا'], 
   'تحيي': [
          'تُحْيِي'], 
   'اهبطوا': [
            'اهْبِطُوا'], 
   'وسلطان': [
            'وَسُلْطَانٍ'], 
   'القرح': [
           'الْقَرْحُ'], 
   'فاعبد': [
           'فَاعْبُدْ',
           'فَاعْبُدِ'], 
   'الرجفة': [
            'الرَّجْفَةُ'], 
   'صبار': [
          'صَبَّارٍ'], 
   'فظن': [
         'فَظَنَّ'], 
   'بالحق': [
           'بِالْحَقِّ'], 
   'لسلطهم': [
            'لَسَلَّطَهُمْ'], 
   'ويشترون': [
             'وَيَشْتَرُونَ'], 
   'بالحر': [
           'بِالْحُرِّ'], 
   'رقيب': [
          'رَقِيبٌ'], 
   'نتلو': [
          'نَتْلُو'], 
   'القرى': [
           'الْقُرَى'], 
   'وظنوا': [
           'وَظَنُّوا'], 
   'بالخنس': [
            'بِالْخُنَّسِ'], 
   'فظا': [
         'فَظًّا'], 
   'اللغو': [
           'اللَّغْوِ',
           'اللَّغْوَ'], 
   'بالحج': [
           'بِالْحَجِّ'], 
   'وسنقول': [
            'وَسَنَقُولُ'], 
   'وقلبه': [
           'وَقَلْبِهِ',
           'وَقَلْبُهُ'], 
   'تموتون': [
            'تَمُوتُونَ'], 
   'بالرحمن': [
             'بِالرَّحْمَنِ'], 
   'أمروا': [
           'أُمِرُوا'], 
   'إخوانا': [
            'إِخْوَانًا'], 
   'بقنطار': [
            'بِقِنْطَارٍ'], 
   'فمأواهم': [
             'فَمَأْوَاهُمُ'], 
   'راضية': [
           'رَاضِيَةٍ',
           'رَاضِيَةٌ',
           'رَاضِيَةً'], 
   'واتخذوا': [
             'وَاتَّخَذُوا',
             'وَاتَّخِذُوا'], 
   'وانه': [
          'وَانْهَ'], 
   'رزقناكم': [
             'رَزَقْنَاكُمْ'], 
   'أجنة': [
          'أَجِنَّةٌ'], 
   'خمرا': [
          'خَمْرًا'], 
   'بسؤال': [
           'بِسُؤَالِ'], 
   'دينهم': [
           'دِينَهُمْ',
           'دِينَهُمُ',
           'دِينِهِمْ',
           'دِينُهُمْ'], 
   'عملكم': [
           'عَمَلَكُمْ',
           'عَمَلُكُمْ'], 
   'المتكبر': [
             'الْمُتَكَبِّرُ'], 
   'حيلة': [
          'حِيلَةً'], 
   'اجعل': [
          'اجْعَلْ'], 
   'ذبح': [
         'ذُبِحَ'], 
   'أحوى': [
          'أَحْوَى'], 
   'فأماته': [
            'فَأَمَاتَهُ'], 
   'ليذهب': [
           'لِيُذْهِبَ'], 
   'نتكلم': [
           'نَتَكَلَّمَ'], 
   'أنعامهم': [
             'أَنْعَامُهُمْ'], 
   'عليها': [
           'عَلَيْهَا'], 
   'ذاقوا': [
           'ذَاقُوا'], 
   'اعملوا': [
            'اعْمَلُوا'], 
   'يطوف': [
          'يَطَّوَّفَ',
          'يَطُوفُ'], 
   'لقاءنا': [
            'لِقَاءَنَا'], 
   'وقلبوا': [
            'وَقَلَّبُوا'], 
   'لنقولن': [
            'لَنَقُولَنَّ'], 
   'مسلمات': [
            'مُسْلِمَاتٍ'], 
   'سبيلهم': [
            'سَبِيلَهُمْ'], 
   'كسبا': [
          'كَسَبَا'], 
   'يومئذ': [
           'يَوْمَئِذٍ',
           'يَوْمِئِذٍ'], 
   'يفلحون': [
            'يُفْلِحُونَ'], 
   'علموا': [
           'عَلِمُوا'], 
   'وعرضنا': [
            'وَعَرَضْنَا'], 
   'صراط': [
          'صِرَاطٍ',
          'صِرَاطٌ',
          'صِرَاطِ',
          'صِرَاطُ',
          'صِرَاطَ'], 
   'لهدى': [
          'لَهُدًى',
          'لَهَدَى'], 
   'حافظ': [
          'حَافِظٌ'], 
   'ستجدون': [
            'سَتَجِدُونَ'], 
   'يراءون': [
            'يُرَاءُونَ'], 
   'استكبارا': [
              'اسْتِكْبَارًا'], 
   'وزنوا': [
           'وَزِنُوا'], 
   'فجعلنا': [
            'فَجَعَلْنَا'], 
   'ليضلنا': [
            'لَيُضِلُّنَا'], 
   'الآزفة': [
            'الْآزِفَةِ',
            'الْآزِفَةُ'], 
   'يبور': [
          'يَبُورُ'], 
   'قيمة': [
          'قَيِّمَةٌ'], 
   'بليغا': [
           'بَلِيغًا'], 
   'اسم': [
         'اسْمَ',
         'اسْمُ'], 
   'ذكرتم': [
           'ذُكِّرْتُمْ'], 
   'ويفعل': [
           'وَيَفْعَلُ'], 
   'ولقائه': [
            'وَلِقَائِهِ'], 
   'السوء': [
           'السَّوْءِ',
           'السُّوءَ',
           'السُّوءُ',
           'السُّوءِ'], 
   'تستعجل': [
            'تَسْتَعْجِلْ'], 
   'سوقه': [
          'سُوقِهِ'], 
   'فهب': [
         'فَهَبْ'], 
   'المسجور': [
             'الْمَسْجُورِ'], 
   'أبرموا': [
            'أَبْرَمُوا'], 
   'عليهن': [
           'عَلَيْهِنَّ'], 
   'عليهم': [
           'عَلَيْهِمْ',
           'عَلَيْهِمُ'], 
   'إل': [
        'إِلْ'], 
   'يجعلوه': [
            'يَجْعَلُوهُ'], 
   'يجعلون': [
            'يَجْعَلُونَ'], 
   'استيأس': [
            'اسْتَيْأَسَ'], 
   'نرزقك': [
           'نَرْزُقُكَ'], 
   'فليدع': [
           'فَلْيَدْعُ'], 
   'يعتذرون': [
             'يَعْتَذِرُونَ'], 
   'وسق': [
         'وَسَقَ'], 
   'نريد': [
          'نُرِيدُ'], 
   'إن': [
        'إِنَّ',
        'إِنْ',
        'إِنِ'], 
   'قلبها': [
           'قَلْبِهَا'], 
   'تلقوا': [
           'تُلْقُوا'], 
   'بريئون': [
            'بَرِيئُونَ'], 
   'لآتينهم': [
             'لَآتِيَنَّهُمْ'], 
   'خطئا': [
          'خِطْئًا'], 
   'قومي': [
          'قَوْمِي'], 
   'بذنبه': [
           'بِذَنْبِهِ'], 
   'إنما': [
          'إِنَّمَا'], 
   'أعلم': [
          'أَعْلَمُ'], 
   'مخرج': [
          'مُخْرِجٌ',
          'مُخْرَجَ'], 
   'نسلكه': [
           'نَسْلُكُهُ'], 
   'صواف': [
          'صَوَافَّ'], 
   'فدمرناها': [
              'فَدَمَّرْنَاهَا'], 
   'آذناك': [
           'آذَنَّاكَ'], 
   'الخالص': [
            'الْخَالِصُ'], 
   'مخلف': [
          'مُخْلِفَ'], 
   'بصير': [
          'بَصِيرٌ'], 
   'أعدت': [
          'أُعِدَّتْ'], 
   'الأعرج': [
            'الْأَعْرَجِ'], 
   'الإحسان': [
             'الْإِحْسَانِ',
             'الْإِحْسَانُ'], 
   'أثقلت': [
           'أَثْقَلَتْ'], 
   'شأن': [
         'شَأْنٍ',
         'شَأْنٌ'], 
   'لربك': [
          'لِرَبِّكِ',
          'لِرَبِّكَ'], 
   'تظاهرا': [
            'تَظَاهَرَا'], 
   'آوى': [
         'آوَى'], 
   'وأحيينا': [
             'وَأَحْيَيْنَا'], 
   'آوي': [
         'آوِي'], 
   'وأولئكم': [
             'وَأُولَئِكُمْ'], 
   'معجزين': [
            'مُعْجِزِينَ'], 
   'أدعوتموهم': [
               'أَدَعَوْتُمُوهُمْ'], 
   'فدمرناهم': [
              'فَدَمَّرْنَاهُمْ'], 
   'بدءوكم': [
            'بَدَءُوكُمْ'], 
   'لمسرفون': [
             'لَمُسْرِفُونَ'], 
   'بمثل': [
          'بِمِثْلِ',
          'بِمَثَلٍ'], 
   'رآه': [
         'رَآهُ'], 
   'الخالق': [
            'الْخَالِقُ'], 
   'لرسوله': [
            'لَرَسُولُهُ'], 
   'تزولا': [
           'تَزُولَا'], 
   'يتجرعه': [
            'يَتَجَرَّعُهُ'], 
   'ذلول': [
          'ذَلُولٌ'], 
   'المضغة': [
            'الْمُضْغَةَ'], 
   'سنقرئك': [
            'سَنُقْرِئُكَ'], 
   'تلقوه': [
           'تَلْقَوْهُ'], 
   'تلقون': [
           'تُلْقُونَ'], 
   'يقطين': [
           'يَقْطِينٍ'], 
   'السعي': [
           'السَّعْيَ'], 
   'نريك': [
          'نُرِيَكَ'], 
   'الأنامل': [
             'الْأَنَامِلَ'], 
   'طعمه': [
          'طَعْمُهُ'], 
   'ينتصرون': [
             'يَنْتَصِرُونَ'], 
   'فاعترفوا': [
              'فَاعْتَرَفُوا'], 
   'الناظرين': [
              'النَّاظِرِينَ'], 
   'ألحقنا': [
            'أَلْحَقْنَا'], 
   'فأصمهم': [
            'فَأَصَمَّهُمْ'], 
   'عاكفون': [
            'عَاكِفُونَ'], 
   'لحليم': [
           'لَحَلِيمٌ'], 
   'عاكفا': [
           'عَاكِفًا'], 
   'فاضربوا': [
             'فَاضْرِبُوا'], 
   'تقاسموا': [
             'تَقَاسَمُوا'], 
   'الأيكة': [
            'الْأَيْكَةِ'], 
   'خاسئين': [
            'خَاسِئِينَ'], 
   'والسن': [
           'وَالسِّنَّ'], 
   'خطيئاتهم': [
              'خَطِيئَاتِهِمْ'], 
   'هديا': [
          'هَدْيًا'], 
   'فليصلوا': [
             'فَلْيُصَلُّوا'], 
   'أحصيناه': [
             'أَحْصَيْنَاهُ'], 
   'أخي': [
         'أَخِي'], 
   'الحمية': [
            'الْحَمِيَّةَ'], 
   'هار': [
         'هَارٍ'], 
   'واصنع': [
           'وَاصْنَعِ'], 
   'تأتوني': [
            'تَأْتُونِي'], 
   'أبلغكم': [
            'أُبَلِّغُكُمْ'], 
   'ويستكبر': [
             'وَيَسْتَكْبِرْ'], 
   'سيئاتكم': [
             'سَيِّئَاتِكُمْ'], 
   'يهديه': [
           'يَهْدِيَهُ',
           'يَهْدِيهِ'], 
   'يهدين': [
           'يَهْدِيَنِ',
           'يَهْدِينِ'], 
   'وأبنائنا': [
              'وَأَبْنَائِنَا'], 
   'بالعقود': [
             'بِالْعُقُودِ'], 
   'فاصفح': [
           'فَاصْفَحْ',
           'فَاصْفَحِ'], 
   'فروح': [
          'فَرَوْحٌ'], 
   'ومتاعا': [
            'وَمَتَاعًا'], 
   'ويستأذن': [
             'وَيَسْتَأْذِنُ'], 
   'لكنتم': [
           'لَكُنْتُمْ'], 
   'وعدلا': [
           'وَعَدْلًا'], 
   'وأخذهم': [
            'وَأَخْذِهِمُ'], 
   'البر': [
          'الْبَرِّ',
          'الْبِرَّ',
          'الْبِرِّ',
          'الْبِرُّ',
          'الْبَرُّ'], 
   'البغاء': [
            'الْبِغَاءِ'], 
   'وفساد': [
           'وَفَسَادٌ'], 
   'غصة': [
         'غُصَّةٍ'], 
   'فاعفوا': [
            'فَاعْفُوا'], 
   'خزائن': [
           'خَزَائِنُ',
           'خَزَائِنِ',
           'خَزَائِنَ'], 
   'بعهدهم': [
            'بِعَهْدِهِمْ'], 
   'اثنتين': [
            'اثْنَتَيْنِ'], 
   'بمعجز': [
           'بِمُعْجِزٍ'], 
   'حفظة': [
          'حَفَظَةً'], 
   'وحلائل': [
            'وَحَلَائِلُ'], 
   'ورافعك': [
            'وَرَافِعُكَ'], 
   'رعوها': [
           'رَعَوْهَا'], 
   'علماء': [
           'عُلَمَاءُ'], 
   'ويغفر': [
           'وَيَغْفِرْ',
           'وَيَغْفِرُ'], 
   'ادعهن': [
           'ادْعُهُنَّ'], 
   'فشدوا': [
           'فَشُدُّوا'], 
   'اللوامة': [
             'اللَّوَّامَةِ'], 
   'محصنات': [
            'مُحْصَنَاتٍ'], 
   'ميسرة': [
           'مَيْسَرَةٍ'], 
   'لقول': [
          'لَقَوْلُ',
          'لَقَوْلٌ'], 
   'أخذ': [
         'أَخَذَ',
         'أُخِذَ',
         'أَخْذُ',
         'أَخْذَ'], 
   'أخر': [
         'أُخَرَ'], 
   'تنسوا': [
           'تَنْسَوُا'], 
   'آتيتكم': [
            'آتَيْتُكُمْ'], 
   'أخا': [
         'أَخَا'], 
   'المعارج': [
             'الْمَعَارِجِ'], 
   'غر': [
        'غَرَّ'], 
   'وارحمنا': [
             'وَارْحَمْنَا'], 
   'نساء': [
          'نِسَاءَ',
          'نِسَاءِ',
          'نِسَاءٍ',
          'نِسَاءٌ',
          'نِسَاءً'], 
   'دحاها': [
           'دَحَاهَا'], 
   'فكفروا': [
            'فَكَفَرُوا'], 
   'أخت': [
         'أُخْتٌ',
         'أُخْتَ'], 
   'فتخرجوه': [
             'فَتُخْرِجُوهُ'], 
   'يزيد': [
          'يَزِيدُ'], 
   'ويأكلون': [
             'وَيَأْكُلُونَ'], 
   'فعلموا': [
            'فَعَلِمُوا'], 
   'تبتغوا': [
            'تَبْتَغُوا'], 
   'يعلمهم': [
            'يَعْلَمُهُمْ'], 
   'نهاكما': [
            'نَهَاكُمَا'], 
   'ضربا': [
          'ضَرْبًا'], 
   'فنبذناهم': [
              'فَنَبَذْنَاهُمْ'], 
   'ذمة': [
         'ذِمَّةً'], 
   'أزواجا': [
            'أَزْوَاجًا'], 
   'ضربت': [
          'ضُرِبَتْ'], 
   'ننقصها': [
            'نَنْقُصُهَا'], 
   'صدوكم': [
           'صَدُّوكُمْ'], 
   'محرما': [
           'مُحَرَّمًا'], 
   'لعبا': [
          'لَعِبًا'], 
   'يزال': [
          'يَزَالُ'], 
   'محرمة': [
           'مُحَرَّمَةٌ'], 
   'أزري': [
          'أَزْرِي'], 
   'ورضوا': [
           'وَرَضُوا'], 
   'المصيطرون': [
               'الْمُصَيْطِرُونَ'], 
   'ورحمتي': [
            'وَرَحْمَتِي'], 
   'بناء': [
          'بِنَاءً',
          'بَنَّاءٍ'], 
   'أبينا': [
           'أَبِينَا'], 
   'بعلا': [
          'بَعْلًا'], 
   'بنات': [
          'بَنَاتٍ'], 
   'حفرة': [
          'حُفْرَةٍ'], 
   'لسنت': [
          'لِسُنَّتِ'], 
   'ورحمته': [
            'وَرَحْمَتُهُ'], 
   'صاعقة': [
           'صَاعِقَةِ',
           'صَاعِقَةُ',
           'صَاعِقَةً'], 
   'نصرهم': [
           'نَصْرِهِمْ',
           'نَصْرَهُمْ',
           'نَصَرَهُمُ'], 
   'الثقال': [
            'الثِّقَالَ'], 
   'أفغير': [
           'أَفَغَيْرَ'], 
   'حافظين': [
            'حَافِظِينَ'], 
   'سيجعل': [
           'سَيَجْعَلُ'], 
   'بعلم': [
          'بِعِلْمٍ',
          'بِعِلْمِ'], 
   'مكة': [
         'مَكَّةَ'], 
   'والعمرة': [
             'وَالْعُمْرَةَ'], 
   'ليكفروا': [
             'لِيَكْفُرُوا'], 
   'يمترون': [
            'يَمْتَرُونَ'], 
   'ونمكن': [
           'وَنُمَكِّنَ'], 
   'نشاء': [
          'نَشَاءُ'], 
   'ويمحق': [
           'وَيَمْحَقَ'], 
   'صارمين': [
            'صَارِمِينَ'], 
   'انتقام': [
            'انْتِقَامٍ'], 
   'أخذت': [
          'أَخَذْتُ',
          'أَخَذَتِ'], 
   'بنور': [
          'بِنُورِ'], 
   'موليها': [
            'مُوَلِّيهَا'], 
   'تحصوها': [
            'تُحْصُوهَا'], 
   'إنكم': [
          'إِنَّكُمْ'], 
   'تبتغون': [
            'تَبْتَغُونَ'], 
   'حياة': [
          'حَيَاةً',
          'حَيَاةٍ',
          'حَيَاةٌ'], 
   'يعلمها': [
            'يَعْلَمُهَا'], 
   'بإيمان': [
            'بِإِيمَانٍ'], 
   'تساقط': [
           'تُسَاقِطْ'], 
   'بنوا': [
          'بَنَوْا'], 
   'أخرجوا': [
            'أُخْرِجُوا',
            'أَخْرِجُوا'], 
   'ينبئهم': [
            'يُنَبِّئُهُمْ',
            'يُنَبِّئُهُمُ'], 
   'حصب': [
         'حَصَبُ'], 
   'تطرد': [
          'تَطْرُدِ'], 
   'وإرصادا': [
             'وَإِرْصَادًا'], 
   'سألتموهن': [
              'سَأَلْتُمُوهُنَّ'], 
   'نبرأها': [
            'نَبْرَأَهَا'], 
   'الضعف': [
           'الضِّعْفِ'], 
   'دساها': [
           'دَسَّاهَا'], 
   'لأنذركم': [
             'لِأُنْذِرَكُمْ'], 
   'بسكارى': [
            'بِسُكَارَى'], 
   'فتكون': [
           'فَتَكُونَ',
           'فَتَكُونُ'], 
   'راودوه': [
            'رَاوَدُوهُ'], 
   'المصدقين': [
              'الْمُصَّدِّقِينَ',
              'الْمُصَدِّقِينَ'], 
   'ويخشونه': [
             'وَيَخْشَوْنَهُ'], 
   'وتتخذون': [
             'وَتَتَّخِذُونَ'], 
   'سحيق': [
          'سَحِيقٍ'], 
   'أدبر': [
          'أَدْبَرَ'], 
   'يعرشون': [
            'يَعْرِشُونَ'], 
   'ادخلوها': [
             'ادْخُلُوهَا'], 
   'لغني': [
          'لَغَنِيٌّ'], 
   'أمثالها': [
             'أَمْثَالِهَا',
             'أَمْثَالُهَا'], 
   'الآثمين': [
             'الْآثِمِينَ'], 
   'فأقم': [
          'فَأَقِمْ'], 
   'وسارعوا': [
             'وَسَارِعُوا'], 
   'ليقطع': [
           'لْيَقْطَعْ',
           'لِيَقْطَعَ'], 
   'تؤتونهن': [
             'تُؤْتُونَهُنَّ'], 
   'أعين': [
          'أَعْيُنٍ',
          'أَعْيُنٌ',
          'أَعْيُنِ',
          'أَعْيُنَ'], 
   'دخلوه': [
           'دَخَلُوهُ'], 
   'مغرقون': [
            'مُغْرَقُونَ'], 
   'بدخان': [
           'بِدُخَانٍ'], 
   'بناصيتها': [
              'بِنَاصِيَتِهَا'], 
   'يأمرون': [
            'يَأْمُرُونَ'], 
   'تكتمون': [
            'تَكْتُمُونَ'], 
   'بثلاثة': [
            'بِثَلَاثَةِ'], 
   'بربنا': [
           'بِرَبِّنَا'], 
   'فزعوا': [
           'فَزِعُوا'], 
   'وجعلكم': [
            'وَجَعَلَكُمْ'], 
   'ويلتنا': [
            'وَيْلَتَنَا'], 
   'لأجعلنك': [
             'لَأَجْعَلَنَّكَ'], 
   'الأسماء': [
             'الْأَسْمَاءُ',
             'الْأَسْمَاءَ'], 
   'ترجوها': [
            'تَرْجُوهَا'], 
   'وحيدا': [
           'وَحِيدًا'], 
   'فاستبقوا': [
              'فَاسْتَبِقُوا',
              'فَاسْتَبَقُوا'], 
   'يداك': [
          'يَدَاكَ'], 
   'موازينه': [
             'مَوَازِينُهُ'], 
   'يداه': [
          'يَدَاهُ'], 
   'فلبئس': [
           'فَلَبِئْسَ'], 
   'أعلنت': [
           'أَعْلَنْتُ'], 
   'أفتأتون': [
             'أَفَتَأْتُونَ'], 
   'للشيطان': [
             'لِلشَّيْطَانِ'], 
   'مخرجا': [
           'مَخْرَجًا'], 
   'أسمعهم': [
            'أَسْمَعَهُمْ'], 
   'وينأون': [
            'وَيَنْأَوْنَ'], 
   'تصرف': [
          'تَصْرِفْ'], 
   'بغتة': [
          'بَغْتَةً'], 
   'يضرهم': [
           'يَضُرُّهُمْ'], 
   'التلاق': [
            'التَّلَاقِ'], 
   'التذكرة': [
             'التَّذْكِرَةِ'], 
   'سرابا': [
           'سَرَابًا'], 
   'ثمر': [
         'ثَمَرٌ'], 
   'الحريق': [
            'الْحَرِيقِ'], 
   'منكرا': [
           'مُنْكَرًا'], 
   'محفوظ': [
           'مَحْفُوظٍ'], 
   'يحزنك': [
           'يَحْزُنْكَ'], 
   'أينا': [
          'أَيُّنَا'], 
   'بيتا': [
          'بَيْتًا'], 
   'بالوحي': [
            'بِالْوَحْيِ'], 
   'يتبعوكم': [
             'يَتَّبِعُوكُمْ'], 
   'الكبرياء': [
              'الْكِبْرِيَاءُ'], 
   'السيئة': [
            'السَّيِّئَةَ',
            'السَّيِّئَةِ',
            'السَّيِّئَةُ'], 
   'محلي': [
          'مُحِلِّي'], 
   'نداولها': [
             'نُدَاوِلُهَا'], 
   'يسأل': [
          'يُسْأَلُ',
          'يَسْأَلُ'], 
   'يسأم': [
          'يَسْأَمُ'], 
   'بدعاء': [
           'بِدُعَاءِ'], 
   'وطلح': [
          'وَطَلْحٍ'], 
   'أنقض': [
          'أَنْقَضَ'], 
   'وبيلا': [
           'وَبِيلًا'], 
   'الشجر': [
           'الشَّجَرِ'], 
   'نجمع': [
          'نَجْمَعَ'], 
   'يحبونهم': [
             'يُحِبُّونَهُمْ'], 
   'بدينكم': [
            'بِدِينِكُمْ'], 
   'يقنطون': [
            'يَقْنَطُونَ'], 
   'اذكرني': [
            'اذْكُرْنِي'], 
   'قرنا': [
          'قَرْنًا'], 
   'نرينك': [
           'نُرِيَنَّكَ'], 
   'أنجينا': [
            'أَنْجَيْنَا'], 
   'فقالت': [
           'فَقَالَتْ'], 
   'يعرفن': [
           'يُعْرَفْنَ'], 
   'نزلناه': [
            'نَزَّلْنَاهُ'], 
   'غما': [
         'غَمًّا'], 
   'وآويناهما': [
               'وَآوَيْنَاهُمَا'], 
   'ففتقناهما': [
               'فَفَتَقْنَاهُمَا'], 
   'فنسيتها': [
             'فَنَسِيتَهَا'], 
   'ويفسدون': [
             'وَيُفْسِدُونَ'], 
   'لينفروا': [
             'لِيَنْفِرُوا'], 
   'قربات': [
           'قُرُبَاتٍ'], 
   'بيتك': [
          'بَيْتِكَ'], 
   'بأييكم': [
            'بِأَيْيِكُمُ'], 
   'بيته': [
          'بَيْتِهِ'], 
   'البصر': [
           'الْبَصَرُ',
           'الْبَصَرَ',
           'الْبَصَرِ'], 
   'بيتي': [
          'بَيْتِيَ'], 
   'فمستقر': [
            'فَمُسْتَقَرٌّ'], 
   'فمنكم': [
           'فَمِنْكُمْ'], 
   'والحق': [
           'وَالْحَقَّ'], 
   'يبدأ': [
          'يَبْدَأُ'], 
   'إخوتك': [
           'إِخْوَتِكَ'], 
   'سبقونا': [
            'سَبَقُونَا'], 
   'بجنوده': [
            'بِجُنُودِهِ'], 
   'فأواري': [
            'فَأُوَارِيَ'], 
   'ويستحيون': [
              'وَيَسْتَحْيُونَ'], 
   'الطائفتين': [
               'الطَّائِفَتَيْنِ'], 
   'سيجزون': [
            'سَيُجْزَوْنَ'], 
   'ومنكم': [
           'وَمِنْكُمْ'], 
   'تحزنوا': [
            'تَحْزَنُوا'], 
   'وذللناها': [
              'وَذَلَّلْنَاهَا'], 
   'مسنون': [
           'مَسْنُونٍ'], 
   'تعالوا': [
            'تَعَالَوْا'], 
   'وفتناك': [
            'وَفَتَنَّاكَ'], 
   'فتكوى': [
           'فَتُكْوَى'], 
   'وسقوا': [
           'وَسُقُوا'], 
   'عمد': [
         'عَمَدٍ'], 
   'المغربين': [
              'الْمَغْرِبَيْنِ'], 
   'ويعلمكم': [
             'وَيُعَلِّمُكُمُ',
             'وَيُعَلِّمُكُمْ'], 
   'خطابا': [
           'خِطَابًا'], 
   'فروجهم': [
            'فُرُوجَهُمْ'], 
   'هجرا': [
          'هَجْرًا'], 
   'عما': [
         'عَمَّا'], 
   'فروجهن': [
            'فُرُوجَهُنَّ'], 
   'نخل': [
         'نَخْلٍ'], 
   'يقبل': [
          'يُقْبَلُ',
          'يُقْبَلَ',
          'يَقْبَلُ'], 
   'لعبادي': [
            'لِعِبَادِيَ',
            'لِعِبَادِي'], 
   'المقدس': [
            'الْمُقَدَّسِ'], 
   'تبتم': [
          'تُبْتُمْ'], 
   'لعباده': [
            'لِعِبَادِهِ'], 
   'وينجي': [
           'وَيُنَجِّي'], 
   'عمى': [
         'عَمًى'], 
   'منطق': [
          'مَنْطِقَ'], 
   'عمي': [
         'عُمْيٌ',
         'عَمِيَ'], 
   'يقبض': [
          'يَقْبِضُ'], 
   'ويتولوا': [
             'وَيَتَوَلَّوْا'], 
   'يرغب': [
          'يَرْغَبُ'], 
   'عمك': [
         'عَمِّكَ'], 
   'ضربتم': [
           'ضَرَبْتُمْ'], 
   'مكث': [
         'مُكْثٍ'], 
   'عمل': [
         'عَمِلَ',
         'عَمَلِ',
         'عَمَلَ',
         'عَمَلٍ',
         'عَمَلٌ'], 
   'مهاجرات': [
             'مُهَاجِرَاتٍ'], 
   'رسالات': [
            'رِسَالَاتِ'], 
   'سلم': [
         'سُلَّمٌ',
         'سَلَّمَ'], 
   'لأيمانكم': [
              'لِأَيْمَانِكُمْ'], 
   'سلف': [
         'سَلَفَ'], 
   'مكر': [
         'مَكْرَ',
         'مَكَرَ',
         'مَكْرُ',
         'مَكْرٌ'], 
   'تمسسكم': [
            'تَمْسَسْكُمْ'], 
   'يجري': [
          'يَجْرِي'], 
   'يجمحون': [
            'يَجْمَحُونَ'], 
   'أبابيل': [
            'أَبَابِيلَ'], 
   'أنفسنا': [
            'أَنْفُسِنَا',
            'أَنْفُسَنَا'], 
   'إبراهيم': [
             'إِبْرَاهِيمَ',
             'إِبْرَاهِيمُ'], 
   'فأوحينا': [
             'فَأَوْحَيْنَا'], 
   'لأولي': [
           'لِأُولِي'], 
   'الأخضر': [
            'الْأَخْضَرِ'], 
   'تحزنون': [
            'تَحْزَنُونَ'], 
   'فأمطر': [
           'فَأَمْطِرْ'], 
   'تستغفرون': [
              'تَسْتَغْفِرُونَ'], 
   'وتفصيلا': [
             'وَتَفْصِيلًا'], 
   'وابتغ': [
           'وَابْتَغِ'], 
   'صلاتي': [
           'صَلَاتِي'], 
   'موعده': [
           'مَوْعِدُهُ'], 
   'وذكر': [
          'وَذَكِّرْ',
          'وَذَكَرَ',
          'وَذِكْرُ',
          'وَذُكِرَ'], 
   'يبدئ': [
          'يُبْدِئُ'], 
   'موعدك': [
           'مَوْعِدَكَ'], 
   'الفريقين': [
              'الْفَرِيقَيْنِ'], 
   'فارجع': [
           'فَارْجِعِ'], 
   'موعدي': [
           'مَوْعِدِي'], 
   'خليفة': [
           'خَلِيفَةً'], 
   'طاعة': [
          'طَاعَةٌ'], 
   'وآخرون': [
            'وَآخَرُونَ'], 
   'ففررت': [
           'فَفَرَرْتُ'], 
   'فعدة': [
          'فَعِدَّةٌ'], 
   'وبكما': [
           'وَبُكْمًا'], 
   'قصيا': [
          'قَصِيًّا'], 
   'لجوا': [
          'لَجُّوا'], 
   'اتخذتم': [
            'اتَّخَذْتُمْ',
            'اتَّخَذْتُمُ'], 
   'وابتغاء': [
             'وَابْتِغَاءَ'], 
   'بإيمانهم': [
              'بِإِيمَانِهِمْ'], 
   'صاحبكم': [
            'صَاحِبُكُمْ'], 
   'أرأيتم': [
            'أَرَأَيْتُمْ'], 
   'ويذرون': [
            'وَيَذَرُونَ'], 
   'أرأيتك': [
            'أَرَأَيْتَكَ'], 
   'رافعة': [
           'رَافِعَةٌ'], 
   'وقومها': [
            'وَقَوْمَهَا'], 
   'يخفين': [
           'يُخْفِينَ'], 
   'فان': [
         'فَانٍ'], 
   'بعاد': [
          'بِعَادٍ'], 
   'أخطأتم': [
            'أَخْطَأْتُمْ'], 
   'تفعلون': [
            'تَفْعَلُونَ'], 
   'تفعلوه': [
            'تَفْعَلُوهُ'], 
   'وانصرنا': [
             'وَانْصُرْنَا'], 
   'أعذبه': [
           'أُعَذِّبُهُ'], 
   'الأنفس': [
            'الْأَنْفُسُ',
            'الْأَنْفُسِ',
            'الْأَنْفُسَ'], 
   'يوثق': [
          'يُوثِقُ'], 
   'وجعلناهم': [
              'وَجَعَلْنَاهُمْ'], 
   'تبيعا': [
           'تَبِيعًا'], 
   'وقومهم': [
            'وَقَوْمَهُمْ'], 
   'الفرار': [
            'الْفِرَارُ'], 
   'أشركتمون': [
              'أَشْرَكْتُمُونِ'], 
   'مخلقة': [
           'مُخَلَّقَةٍ'], 
   'الوثقى': [
            'الْوُثْقَى'], 
   'حمئة': [
          'حَمِئَةٍ'], 
   'ويذيق': [
           'وَيُذِيقَ'], 
   'ولوموا': [
            'وَلُومُوا'], 
   'تفعلوا': [
            'تَفْعَلُوا'], 
   'همزات': [
           'هَمَزَاتِ'], 
   'سلطان': [
           'سُلْطَانٍ',
           'سُلْطَانٌ'], 
   'فراشا': [
           'فِرَاشًا'], 
   'لنكفرن': [
            'لَنُكَفِّرَنَّ'], 
   'وجعلناها': [
              'وَجَعَلْنَاهَا'], 
   'فاز': [
         'فَازَ'], 
   'الدبر': [
           'الدُّبُرَ'], 
   'فنعم': [
          'فَنِعْمَ'], 
   'يثرب': [
          'يَثْرِبَ'], 
   'يبدل': [
          'يُبَدِّلْ',
          'يُبَدِّلُ',
          'يُبَدِّلَ',
          'يُبَدَّلُ'], 
   'الظانين': [
             'الظَّانِّينَ'], 
   'العلقة': [
            'الْعَلَقَةَ'], 
   'موعدة': [
           'مَوْعِدَةٍ'], 
   'القاعدين': [
              'الْقَاعِدِينَ'], 
   'فاه': [
         'فَاهُ'], 
   'وتذل': [
          'وَتُذِلُّ'], 
   'بمزحزحه': [
             'بِمُزَحْزِحِهِ'], 
   'أبصارها': [
             'أَبْصَارُهَا'], 
   'ترزقانه': [
             'تُرْزَقَانِهِ'], 
   'عقاب': [
          'عِقَابِ',
          'عِقَابٍ'], 
   'ذرعها': [
           'ذَرْعُهَا'], 
   'قصيه': [
          'قُصِّيهِ'], 
   'طاعم': [
          'طَاعِمٍ'], 
   'أسرهم': [
           'أَسْرَهُمْ'], 
   'وأضعف': [
           'وَأَضْعَفُ'], 
   'ذرأ': [
         'ذَرَأَ'], 
   'ويدخلكم': [
             'وَيُدْخِلْكُمْ',
             'وَيُدْخِلَكُمْ'], 
   'ينسلون': [
            'يَنْسِلُونَ'], 
   'ذرة': [
         'ذَرَّةٍ'], 
   'اتقيتن': [
            'اتَّقَيْتُنَّ'], 
   'فاختلفوا': [
              'فَاخْتَلَفُوا'], 
   'فيتعلمون': [
              'فَيَتَعَلَّمُونَ'], 
   'والبغضاء': [
              'وَالْبَغْضَاءَ',
              'وَالْبَغْضَاءُ'], 
   'والصافات': [
              'وَالصَّافَّاتِ'], 
   'الواعظين': [
              'الْوَاعِظِينَ'], 
   'زرقا': [
          'زُرْقًا'], 
   'بركنه': [
           'بِرُكْنِهِ'], 
   'يطمع': [
          'يَطْمَعُ'], 
   'فاستأذنوك': [
               'فَاسْتَأْذَنُوكَ'], 
   'عالمين': [
            'عَالِمِينَ'], 
   'سيؤتينا': [
             'سَيُؤْتِينَا'], 
   'وحب': [
         'وَحَبَّ'], 
   'تنهر': [
          'تَنْهَرْ'], 
   'موالي': [
           'مَوَالِيَ'], 
   'السفلى': [
            'السُّفْلَى'], 
   'يتبعهم': [
            'يَتَّبِعُهُمُ'], 
   'طرف': [
         'طَرْفٍ'], 
   'بطرا': [
          'بَطَرًا'], 
   'تنهى': [
          'تَنْهَى'], 
   'لقائه': [
           'لِقَائِهِ'], 
   'مشوا': [
          'مَشَوْا'], 
   'أصواتكم': [
             'أَصْوَاتَكُمْ'], 
   'تزرعون': [
            'تَزْرَعُونَ'], 
   'وعصى': [
          'وَعَصَى'], 
   'صلاتك': [
           'صَلَاتَكَ'], 
   'وحي': [
         'وَحْيٌ'], 
   'يتبعها': [
            'يَتْبَعُهَا'], 
   'كراما': [
           'كِرَامًا'], 
   'يعصون': [
           'يَعْصُونَ'], 
   'ومزاجه': [
            'وَمِزَاجُهُ'], 
   'وحق': [
         'وَحَقَّ'], 
   'أبغي': [
          'أَبْغِي'], 
   'ضرارا': [
           'ضِرَارًا'], 
   'تصدون': [
           'تَصُدُّونَ'], 
   'فارتدا': [
            'فَارْتَدَّا'], 
   'يستطع': [
           'يَسْتَطِعْ'], 
   'بالمرحمة': [
              'بِالْمَرْحَمَةِ'], 
   'هماز': [
          'هَمَّازٍ'], 
   'ومأواكم': [
             'وَمَأْوَاكُمُ'], 
   'فامتحنوهن': [
               'فَامْتَحِنُوهُنَّ'], 
   'أتقن': [
          'أَتْقَنَ'], 
   'أصابهم': [
            'أَصَابَهُمْ',
            'أَصَابَهُمُ'], 
   'واقع': [
          'وَاقِعٌ',
          'وَاقِعٍ'], 
   'لناصحون': [
             'لَنَاصِحُونَ'], 
   'عملهم': [
           'عَمَلِهِمْ',
           'عَمَلَهُمْ'], 
   'وصموا': [
           'وَصَمُّوا'], 
   'تركناها': [
             'تَرَكْنَاهَا'], 
   'فخلف': [
          'فَخَلَفَ'], 
   'تأسوا': [
           'تَأْسَوْا'], 
   'قانتين': [
            'قَانِتِينَ'], 
   'لنبيتنه': [
             'لَنُبَيِّتَنَّهُ'], 
   'أألقي': [
           'أَأُلْقِيَ'], 
   'الزانية': [
             'الزَّانِيَةُ'], 
   'لاتخذناه': [
              'لَاتَّخَذْنَاهُ'], 
   'واستكبرت': [
              'وَاسْتَكْبَرْتَ'], 
   'المهتدون': [
              'الْمُهْتَدُونَ'], 
   'نأتيكم': [
            'نَأْتِيَكُمْ'], 
   'أقررتم': [
            'أَقْرَرْتُمْ'], 
   'بطش': [
         'بَطْشَ'], 
   'الإربة': [
            'الْإِرْبَةِ'], 
   'واحلل': [
           'وَاحْلُلْ'], 
   'العدة': [
           'الْعِدَّةَ'], 
   'داخرون': [
            'دَاخِرُونَ'], 
   'القصص': [
           'الْقَصَصَ',
           'الْقَصَصِ',
           'الْقَصَصُ'], 
   'وأنفقوا': [
             'وَأَنْفِقُوا',
             'وَأَنْفَقُوا'], 
   'يتخلفوا': [
             'يَتَخَلَّفُوا'], 
   'تمنى': [
          'تَمَنَّى',
          'تُمْنَى'], 
   'طلقتموهن': [
              'طَلَّقْتُمُوهُنَّ'], 
   'واحدة': [
           'وَاحِدَةً',
           'وَاحِدَةٍ',
           'وَاحِدَةٌ'], 
   'رجعتم': [
           'رَجَعْتُمْ'], 
   'ليبغي': [
           'لَيَبْغِي'], 
   'جئتمونا': [
             'جِئْتُمُونَا'], 
   'الحطمة': [
            'الْحُطَمَةِ',
            'الْحُطَمَةُ'], 
   'وعباد': [
           'وَعِبَادُ'], 
   'تكلمهم': [
            'تُكَلِّمُهُمْ'], 
   'زكيا': [
          'زَكِيًّا'], 
   'واحدا': [
           'وَاحِدًا'], 
   'بالحسنى': [
             'بِالْحُسْنَى'], 
   'تسخروا': [
            'تَسْخَرُوا'], 
   'تغلبون': [
            'تَغْلِبُونَ'], 
   'وابتغاؤكم': [
               'وَابْتِغَاؤُكُمْ'], 
   'أرضعن': [
           'أَرْضَعْنَ'], 
   'ولتكونن': [
             'وَلَتَكُونَنَّ'], 
   'يفقهوه': [
            'يَفْقَهُوهُ'], 
   'الجان': [
           'الْجَانَّ'], 
   'فيدمغه': [
            'فَيَدْمَغُهُ'], 
   'منازل': [
           'مَنَازِلَ'], 
   'نتربص': [
           'نَتَرَبَّصُ'], 
   'وتحسبونه': [
              'وَتَحْسَبُونَهُ'], 
   'فاقرة': [
           'فَاقِرَةٌ'], 
   'يعبدونني': [
              'يَعْبُدُونَنِي'], 
   'لكافرون': [
             'لَكَافِرُونَ'], 
   'تنفروا': [
            'تَنْفِرُوا'], 
   'والعاكفين': [
               'وَالْعَاكِفِينَ'], 
   'بطن': [
         'بَطَنَ'], 
   'تستأخرون': [
              'تَسْتَأْخِرُونَ'], 
   'تحبرون': [
            'تُحْبَرُونَ'], 
   'ويسفك': [
           'وَيَسْفِكُ'], 
   'فاستفتهم': [
              'فَاسْتَفْتِهِمْ'], 
   'ضلالا': [
           'ضَلَالًا'], 
   'وعجبوا': [
            'وَعَجِبُوا'], 
   'ولوا': [
          'وَلَّوْا'], 
   'جامع': [
          'جَامِعُ',
          'جَامِعٍ'], 
   'تخفوها': [
            'تُخْفُوهَا'], 
   'العدو': [
           'الْعَدُوُّ'], 
   'وليسألوا': [
              'وَلْيَسْأَلُوا'], 
   'وأخذن': [
           'وَأَخَذْنَ'], 
   'يصبها': [
           'يُصِبْهَا'], 
   'فننبئهم': [
             'فَنُنَبِّئُهُمْ'], 
   'يختصمون': [
             'يَخْتَصِمُونَ'], 
   'سنبلات': [
            'سُنْبُلَاتٍ'], 
   'غفارا': [
           'غَفَّارًا'], 
   'المتلقيان': [
               'الْمُتَلَقِّيَانِ'], 
   'سليم': [
          'سَلِيمٍ'], 
   'لإخوانهم': [
              'لِإِخْوَانِهِمْ',
              'لِإِخْوَانِهِمُ'], 
   'صفوان': [
           'صَفْوَانٍ'], 
   'نغادر': [
           'نُغَادِرْ'], 
   'نختم': [
          'نَخْتِمُ'], 
   'يزنين': [
           'يَزْنِينَ'], 
   'وأناب': [
           'وَأَنَابَ'], 
   'بتابع': [
           'بِتَابِعٍ'], 
   'ضلالة': [
           'ضَلَالَةٌ'], 
   'أنذركم': [
            'أُنْذِرُكُمْ'], 
   'يعيدنا': [
            'يُعِيدُنَا'], 
   'تأتينا': [
            'تَأْتِينَا',
            'تَأْتِيَنَا'], 
   'ويهديهم': [
             'وَيَهْدِيهِمْ'], 
   'فيسبوا': [
            'فَيَسُبُّوا'], 
   'أينما': [
           'أَيْنَمَا'], 
   'آثم': [
         'آثِمٌ'], 
   'الثلثان': [
             'الثُّلُثَانِ'], 
   'منظرين': [
            'مُنْظَرِينَ'], 
   'ينفقون': [
            'يُنْفِقُونَ'], 
   'القسمة': [
            'الْقِسْمَةَ'], 
   'يسألون': [
            'يَسْأَلُونَ',
            'يُسْأَلُونَ'], 
   'وآتين': [
           'وَآتِينَ'], 
   'موعدا': [
           'مَوْعِدًا'], 
   'أصبتم': [
           'أَصَبْتُمْ'], 
   'وذروا': [
           'وَذَرُوا'], 
   'أركسهم': [
            'أَرْكَسَهُمْ'], 
   'والبيت': [
            'وَالْبَيْتِ'], 
   'عشيرتك': [
            'عَشِيرَتَكَ'], 
   'وأخذت': [
           'وَأَخَذَتِ'], 
   'يكذبونك': [
             'يُكَذِّبُونَكَ'], 
   'يخشون': [
           'يَخْشَوْنَ'], 
   'ذنوب': [
          'ذَنُوبِ'], 
   'يؤخذ': [
          'يُؤْخَذْ',
          'يُؤْخَذُ'], 
   'يؤخر': [
          'يُؤَخِّرَ',
          'يُؤَخَّرُ'], 
   'فعلتك': [
           'فَعْلَتَكَ'], 
   'فعلتم': [
           'فَعَلْتُمْ'], 
   'الفحشاء': [
             'الْفَحْشَاءِ'], 
   'أفتطمعون': [
              'أَفَتَطْمَعُونَ'], 
   'يتبين': [
           'يَتَبَيَّنَ'], 
   'قرينا': [
           'قَرِينًا'], 
   'وكلوا': [
           'وَكُلُوا'], 
   'أبيكم': [
           'أَبِيكُمْ'], 
   'والأرض': [
            'وَالْأَرْضِ',
            'وَالْأَرْضَ',
            'وَالْأَرْضُ'], 
   'أخذة': [
          'أَخْذَةً'], 
   'شواظ': [
          'شُوَاظٌ'], 
   'تخاصم': [
           'تَخَاصُمُ'], 
   'سأريكم': [
            'سَأُرِيكُمْ'], 
   'ونزلناه': [
             'وَنَزَّلْنَاهُ'], 
   'وريحان': [
            'وَرَيْحَانٌ'], 
   'الطلاق': [
            'الطَّلَاقُ',
            'الطَّلَاقَ'], 
   'والعذاب': [
             'وَالْعَذَابَ'], 
   'ركزا': [
          'رِكْزًا'], 
   'ابتغوا': [
            'ابْتَغَوُا'], 
   'حفظ': [
         'حَفِظَ'], 
   'بطائنها': [
             'بَطَائِنُهَا'], 
   'بأنفسهم': [
             'بِأَنْفُسِهِمْ'], 
   'ورئاء': [
           'وَرِئَاءَ'], 
   'بأنفسهن': [
             'بِأَنْفُسِهِنَّ'], 
   'فترة': [
          'فَتْرَةٍ'], 
   'للذي': [
          'لِلَّذِي',
          'لَلَّذِي'], 
   'محجورا': [
            'مَحْجُورًا'], 
   'يتخذونك': [
             'يَتَّخِذُونَكَ'], 
   'بحديث': [
           'بِحَدِيثٍ'], 
   'وتجعلون': [
             'وَتَجْعَلُونَ'], 
   'ملاقيكم': [
             'مُلَاقِيكُمْ'], 
   'روحه': [
          'رُوحِهِ'], 
   'يجعل': [
          'يَجْعَلْ',
          'يَجْعَلُ',
          'يَجْعَلَ',
          'يَجْعَلِ'], 
   'زيادة': [
           'زِيَادَةٌ'], 
   'وشاورهم': [
             'وَشَاوِرْهُمْ'], 
   'وأمروا': [
            'وَأَمَرُوا'], 
   'فترى': [
          'فَتَرَى'], 
   'غيره': [
          'غَيْرُهُ',
          'غَيْرِهِ',
          'غَيْرَهُ'], 
   'بالخيرات': [
              'بِالْخَيْرَاتِ'], 
   'يؤمنون': [
            'يُؤْمِنُونَ'], 
   'غيري': [
          'غَيْرِي'], 
   'حفي': [
         'حَفِيٌّ'], 
   'يستحبون': [
             'يَسْتَحِبُّونَ'], 
   'وكان': [
          'وَكَانَ'], 
   'الجوارح': [
             'الْجَوَارِحِ'], 
   'يتخذ': [
          'يَتَّخِذَ',
          'يَتَّخِذْ',
          'يَتَّخِذِ',
          'يَتَّخِذُ'], 
   'قرينه': [
           'قَرِينُهُ'], 
   'يستنبطونه': [
               'يَسْتَنْبِطُونَهُ'], 
   'لكبيركم': [
             'لَكَبِيرُكُمُ'], 
   'جدلا': [
          'جَدَلًا'], 
   'فيأخذكم': [
             'فَيَأْخُذَكُمْ'], 
   'بنانه': [
           'بَنَانَهُ'], 
   'أضحك': [
          'أَضْحَكَ'], 
   'وكفرتم': [
            'وَكَفَرْتُمْ'], 
   'فرهان': [
           'فَرِهَانٌ'], 
   'بورا': [
          'بُورًا'], 
   'خلفه': [
          'خَلْفِهِ'], 
   'أنبائها': [
             'أَنْبَائِهَا'], 
   'خلفك': [
          'خَلْفَكَ'], 
   'المسيء': [
            'الْمُسِيءُ'], 
   'مستقرا': [
            'مُسْتَقَرًّا',
            'مُسْتَقِرًّا'], 
   'الحرور': [
            'الْحَرُورُ'], 
   'يكسبه': [
           'يَكْسِبُهُ'], 
   'يرقبون': [
            'يَرْقُبُونَ'], 
   'أفتتخذونه': [
               'أَفَتَتَّخِذُونَهُ'], 
   'يضلهم': [
           'يُضِلَّهُمْ'], 
   'ينقص': [
          'يُنْقَصُ'], 
   'يتوبون': [
            'يَتُوبُونَ'], 
   'وربنا': [
           'وَرَبِّنَا',
           'وَرَبُّنَا'], 
   'يشري': [
          'يَشْرِي'], 
   'الكلم': [
           'الْكَلِمَ',
           'الْكَلِمُ'], 
   'يشرك': [
          'يُشْرِكْ',
          'يُشْرَكَ',
          'يُشْرِكُ',
          'يُشْرَكْ'], 
   'ويقدر': [
           'وَيَقْدِرُ'], 
   'ثمانين': [
            'ثَمَانِينَ'], 
   'يهدني': [
           'يَهْدِنِي'], 
   'وجدتموهم': [
              'وَجَدْتُمُوهُمْ'], 
   'فاجتنبوا': [
              'فَاجْتَنِبُوا'], 
   'واعملوا': [
             'وَاعْمَلُوا'], 
   'الجن': [
          'الْجِنِّ',
          'الْجِنَّ',
          'الْجِنُّ'], 
   'يشرب': [
          'يَشْرَبُ'], 
   'بالقارعة': [
              'بِالْقَارِعَةِ'], 
   'يشرح': [
          'يَشْرَحْ'], 
   'صغت': [
         'صَغَتْ'], 
   'أمات': [
          'أَمَاتَ'], 
   'تقبلوا': [
            'تَقْبَلُوا'], 
   'الزراع': [
            'الزُّرَّاعَ'], 
   'شيئا': [
          'شَيْئًا'], 
   'الجب': [
          'الْجُبِّ'], 
   'يسيغه': [
           'يُسِيغُهُ'], 
   'كصيب': [
          'كَصَيِّبٍ'], 
   'فاجتنبوه': [
              'فَاجْتَنِبُوهُ'], 
   'ليحبطن': [
            'لَيَحْبَطَنَّ'], 
   'وبينه': [
           'وَبَيْنَهُ'], 
   'معشار': [
           'مِعْشَارَ'], 
   'فاصبر': [
           'فَاصْبِرْ'], 
   'وبينك': [
           'وَبَيْنَكَ',
           'وَبَيْنِكَ'], 
   'يخاف': [
          'يَخَافُ'], 
   'أزكى': [
          'أَزْكَى'], 
   'قاصدا': [
           'قَاصِدًا'], 
   'أمين': [
          'أَمِينٌ',
          'أَمِينٍ'], 
   'بالجنود': [
             'بِالْجُنُودِ'], 
   'خلفة': [
          'خِلْفَةً'], 
   'منكر': [
          'مُنْكَرٍ'], 
   'بكلماته': [
             'بِكَلِمَاتِهِ'], 
   'يرقبوا': [
            'يَرْقُبُوا'], 
   'زكى': [
         'زَكَى'], 
   'يقذف': [
          'يَقْذِفُ'], 
   'وسيرى': [
           'وَسَيَرَى'], 
   'يتوبوا': [
            'يَتُوبُوا'], 
   'وتلذ': [
          'وَتَلَذُّ'], 
   'تلقف': [
          'تَلْقَفُ',
          'تَلْقَفْ'], 
   'أضلوا': [
           'أَضَلُّوا'], 
   'بالفحشاء': [
              'بِالْفَحْشَاءِ'], 
   'تلقي': [
          'تُلْقِيَ'], 
   'مباركة': [
            'مُبَارَكَةٍ',
            'مُبَارَكَةً'], 
   'فيهما': [
           'فِيهِمَا'], 
   'آنس': [
         'آنَسَ'], 
   'إنها': [
          'إِنَّهَا'], 
   'استهوته': [
             'اسْتَهْوَتْهُ'], 
   'لوقعتها': [
             'لِوَقْعَتِهَا'], 
   'ممن': [
         'مِمَّنْ',
         'مِمَّنِ'], 
   'أيمانهم': [
             'أَيْمَانِهِمْ',
             'أَيْمَانُهُمْ',
             'أَيْمَانَهُمْ'], 
   'يسحبون': [
            'يُسْحَبُونَ'], 
   'أيمانهن': [
             'أَيْمَانُهُنَّ'], 
   'يعبدون': [
            'يَعْبُدُونَ',
            'يُعْبَدُونَ'], 
   'حسبتم': [
           'حَسِبْتُمْ'], 
   'سقر': [
         'سَقَرَ',
         'سَقَرُ'], 
   'حرم': [
         'حَرَّمَ',
         'حُرُمٌ',
         'حُرِّمَ'], 
   'سقط': [
         'سُقِطَ'], 
   'الزاد': [
           'الزَّادِ'], 
   'نبي': [
         'نَبِيٍّ'], 
   'عهد': [
         'عَهِدَ',
         'عَهْدَ',
         'عَهْدُ',
         'عَهْدٍ',
         'عَهْدٌ'], 
   'ومحياي': [
            'وَمَحْيَايَ'], 
   'تيأسوا': [
            'تَيْأَسُوا'], 
   'بالأفق': [
            'بِالْأُفُقِ'], 
   'أمنيته': [
            'أُمْنِيَّتِهِ'], 
   'يسبتون': [
            'يَسْبِتُونَ'], 
   'أنؤمن': [
           'أَنُؤْمِنُ'], 
   'وردوا': [
           'وَرُدُّوا'], 
   'واتبعك': [
            'وَاتَّبَعَكَ'], 
   'وتقواها': [
             'وَتَقْوَاهَا'], 
   'أتجعل': [
           'أَتَجْعَلُ'], 
   'حرا': [
         'حَرًّا'], 
   'فتياتكم': [
             'فَتَيَاتِكُمْ',
             'فَتَيَاتِكُمُ'], 
   'نبإ': [
         'نَبَإِ',
         'نَبَإٍ'], 
   'عرف': [
         'عَرَّفَ'], 
   'حرث': [
         'حَرْثَ',
         'حَرْثٌ'], 
   'نبئ': [
         'نَبِّئْ'], 
   'عاتية': [
           'عَاتِيَةٍ'], 
   'حرج': [
         'حَرَجٌ',
         'حَرَجٍ'], 
   'نبأ': [
         'نَبَأُ',
         'نَبَأَ',
         'نَبَأٌ'], 
   'لفاسقين': [
             'لَفَاسِقِينَ'], 
   'أضيع': [
          'أُضِيعُ'], 
   'تحمله': [
           'تَحْمِلُهُ'], 
   'تقاة': [
          'تُقَاةً'], 
   'والبغي': [
            'وَالْبَغْيِ',
            'وَالْبَغْيَ'], 
   'واتبعت': [
            'وَاتَّبَعْتُ'], 
   'نبغ': [
         'نَبْغِ'], 
   'للقاسية': [
             'لِلْقَاسِيَةِ'], 
   'نبذ': [
         'نَبَذَ'], 
   'ليكفر': [
           'لِيُكَفِّرَ'], 
   'آذان': [
          'آذَانٌ',
          'آذَانَ'], 
   'لأكثرهم': [
             'لِأَكْثَرِهِمْ'], 
   'إنهم': [
          'إِنَّهُمْ',
          'إِنَّهُمُ'], 
   'عندي': [
          'عِنْدِي'], 
   'تصيبن': [
           'تُصِيبَنَّ'], 
   'أفتمارونه': [
               'أَفَتُمَارُونَهُ'], 
   'مما': [
         'مِمَّا'], 
   'عنده': [
          'عِنْدَهُ',
          'عِنْدِهِ'], 
   'ثمنا': [
          'ثَمَنًا'], 
   'عندك': [
          'عِنْدِكَ',
          'عِنْدَكَ'], 
   'فخذوهم': [
            'فَخُذُوهُمْ'], 
   'وليدخلوا': [
              'وَلِيَدْخُلُوا'], 
   'لنراها': [
            'لَنَرَاهَا'], 
   'وآخرين': [
            'وَآخَرِينَ'], 
   'ممزق': [
          'مُمَزَّقٍ'], 
   'يهيمون': [
            'يَهِيمُونَ'], 
   'ويحفظوا': [
             'وَيَحْفَظُوا'], 
   'استغفر': [
            'اسْتَغْفِرْ'], 
   'مصلحون': [
            'مُصْلِحُونَ'], 
   'يحاجوكم': [
             'يُحَاجُّوكُمْ'], 
   'غفورا': [
           'غَفُورًا'], 
   'اجعلوا': [
            'اجْعَلُوا'], 
   'للكتب': [
           'لِلْكُتُبِ'], 
   'وجهها': [
           'وَجْهِهَا',
           'وَجْهَهَا'], 
   'ركبوا': [
           'رَكِبُوا'], 
   'وواعدناكم': [
               'وَوَاعَدْنَاكُمْ'], 
   'خصيم': [
          'خَصِيمٌ'], 
   'صفحا': [
          'صَفْحًا'], 
   'العير': [
           'الْعِيرُ'], 
   'نفسها': [
           'نَفْسِهَا',
           'نَفْسَهَا'], 
   'يرحمكم': [
            'يَرْحَمْكُمْ',
            'يَرْحَمَكُمْ'], 
   'بيع': [
         'بَيْعٌ'], 
   'إستبرق': [
            'إِسْتَبْرَقٍ'], 
   'نفاد': [
          'نَفَادٍ'], 
   'قليلون': [
            'قَلِيلُونَ'], 
   'بيد': [
         'بِيَدِ'], 
   'زهوقا': [
           'زَهُوقًا'], 
   'الودق': [
           'الْوَدْقَ'], 
   'بيت': [
         'بَيْتٍ',
         'بَيْتٌ',
         'بَيَّتَ'], 
   'شططا': [
          'شَطَطًا'], 
   'الرحيم': [
            'الرَّحِيمُ',
            'الرَّحِيمِ'], 
   'ليمكروا': [
             'لِيَمْكُرُوا'], 
   'فادفعوا': [
             'فَادْفَعُوا'], 
   'موثقا': [
           'مَوْثِقًا'], 
   'ناصر': [
          'نَاصِرَ',
          'نَاصِرٍ'], 
   'يزكيهم': [
            'يُزَكِّيهِمْ'], 
   'لجاءهم': [
            'لَجَاءَهُمُ'], 
   'بين': [
         'بَيْنَ',
         'بَيْنِ',
         'بَيِّنٍ'], 
   'هاتين': [
           'هَاتَيْنِ'], 
   'ناشئة': [
           'نَاشِئَةَ'], 
   'تسرون': [
           'تُسِرُّونَ'], 
   'اتقوا': [
           'اتَّقَوْا',
           'اتَّقُوا'], 
   'أساء': [
          'أَسَاءَ'], 
   'العين': [
           'الْعَيْنِ'], 
   'يمسسني': [
            'يَمْسَسْنِي'], 
   'نقعد': [
          'نَقْعُدُ'], 
   'أدهى': [
          'أَدْهَى'], 
   'ائتوني': [
            'ائْتُونِي'], 
   'لسريع': [
           'لَسَرِيعُ'], 
   'نقعا': [
          'نَقْعًا'], 
   'فلقاتلوكم': [
               'فَلَقَاتَلُوكُمْ'], 
   'وزادهم': [
            'وَزَادَهُمْ'], 
   'ونور': [
          'وَنُورٌ'], 
   'ويمنيهم': [
             'وَيُمَنِّيهِمْ'], 
   'عميق': [
          'عَمِيقٍ'], 
   'الأسرى': [
            'الْأَسْرَى'], 
   'خنزير': [
           'خِنْزِيرٍ'], 
   'اجتمعت': [
            'اجْتَمَعَتِ'], 
   'خبت': [
         'خَبَتْ'], 
   'نخشى': [
          'نَخْشَى'], 
   'تنزل': [
          'تَنَزَّلُ',
          'تُنَزِّلَ',
          'تُنَزَّلَ'], 
   'تمرحون': [
            'تَمْرَحُونَ'], 
   'يحلونه': [
            'يُحِلُّونَهُ'], 
   'الحرام': [
            'الْحَرَامِ',
            'الْحَرَامَ',
            'الْحَرَامُ'], 
   'دراستهم': [
             'دِرَاسَتِهِمْ'], 
   'للناظرين': [
              'لِلنَّاظِرِينَ'], 
   'الحول': [
           'الْحَوْلِ'], 
   'يشإ': [
         'يَشَإِ'], 
   'والصلاة': [
             'وَالصَّلَاةِ'], 
   'استيأسوا': [
              'اسْتَيْأَسُوا'], 
   'فخشينا': [
            'فَخَشِينَا'], 
   'يشأ': [
         'يَشَأْ'], 
   'صددتم': [
           'صَدَدْتُمْ'], 
   'ونادوا': [
            'وَنَادَوْا'], 
   'داعي': [
          'دَاعِيَ'], 
   'قصورا': [
           'قُصُورًا'], 
   'أصحابهم': [
             'أَصْحَابِهِمْ'], 
   'يستبشرون': [
              'يَسْتَبْشِرُونَ'], 
   'مستمر': [
           'مُسْتَمِرٍّ',
           'مُسْتَمِرٌّ'], 
   'أيدتك': [
           'أَيَّدْتُكَ'], 
   'وسبحان': [
            'وَسُبْحَانَ'], 
   'استغفار': [
             'اسْتِغْفَارُ'], 
   'المجرم': [
            'الْمُجْرِمُ'], 
   'تخلدون': [
            'تَخْلُدُونَ'], 
   'ردوها': [
           'رُدُّوهَا'], 
   'استمتعتم': [
              'اسْتَمْتَعْتُمْ'], 
   'الحاج': [
           'الْحَاجِّ'], 
   'أكرمكم': [
            'أَكْرَمَكُمْ'], 
   'ذنوبا': [
           'ذَنُوبًا'], 
   'تتبع': [
          'تَتَّبِعْ',
          'تَتَّبِعِ',
          'تَتَّبِعَ'], 
   'تحسبنهم': [
             'تَحْسَبَنَّهُمْ'], 
   'منفكين': [
            'مُنْفَكِّينَ'], 
   'الجنب': [
           'الْجُنُبِ'], 
   'تكونوا': [
            'تَكُونُوا'], 
   'تصطلون': [
            'تَصْطَلُونَ'], 
   'مأمنه': [
           'مَأْمَنَهُ'], 
   'جعلها': [
           'جَعَلَهَا'], 
   'لداوود': [
            'لِدَاوُودَ'], 
   'سأتلو': [
           'سَأَتْلُو'], 
   'وقثائها': [
             'وَقِثَّائِهَا'], 
   'بالهم': [
           'بَالَهُمْ'], 
   'بالناصية': [
              'بِالنَّاصِيَةِ'], 
   'وينصرك': [
            'وَيَنْصُرَكَ'], 
   'تركتم': [
           'تَرَكْتُمْ'], 
   'عميا': [
          'عُمْيًا'], 
   'كلي': [
         'كُلِي'], 
   'يذكرهم': [
            'يَذْكُرُهُمْ'], 
   'وحسنت': [
           'وَحَسُنَتْ'], 
   'القدير': [
            'الْقَدِيرُ'], 
   'فواكه': [
           'فَوَاكِهُ'], 
   'تنزع': [
          'تَنْزِعُ'], 
   'بعوضة': [
           'بَعُوضَةً'], 
   'مرساها': [
            'مُرْسَاهَا'], 
   'يستفتونك': [
              'يَسْتَفْتُونَكَ'], 
   'يأتيها': [
            'يَأْتِيهَا'], 
   'مصيبها': [
            'مُصِيبُهَا'], 
   'شعائر': [
           'شَعَائِرِ',
           'شَعَائِرَ'], 
   'تملى': [
          'تُمْلَى'], 
   'أنبنا': [
           'أَنَبْنَا'], 
   'تملك': [
          'تَمْلِكُ',
          'تَمْلِكَ'], 
   'بعولتهن': [
             'بُعُولَتِهِنَّ'], 
   'داخرين': [
            'دَاخِرِينَ'], 
   'العرش': [
           'الْعَرْشِ',
           'الْعَرْشَ'], 
   'مقتدرا': [
            'مُقْتَدِرًا'], 
   'مناص': [
          'مَنَاصٍ'], 
   'الذنوب': [
            'الذُّنُوبَ'], 
   'أجله': [
          'أَجَلِهِ',
          'أَجَلَهُ'], 
   'نصليهم': [
            'نُصْلِيهِمْ'], 
   'بمصابيح': [
             'بِمَصَابِيحَ'], 
   'ويمشون': [
            'وَيَمْشُونَ'], 
   'كلوا': [
          'كُلُوا'], 
   'بمثله': [
           'بِمِثْلِهِ'], 
   'ليوسف': [
           'لِيُوسُفَ',
           'لَيُوسُفُ'], 
   'وقدره': [
           'وَقَدَّرَهُ'], 
   'والنسل': [
            'وَالنَّسْلَ'], 
   'قميصه': [
           'قَمِيصُهُ',
           'قَمِيصَهُ',
           'قَمِيصِهِ'], 
   'القطر': [
           'الْقِطْرِ'], 
   'اقترب': [
           'اقْتَرَبَ'], 
   'الموقنين': [
              'الْمُوقِنِينَ'], 
   'تفتح': [
          'تُفَتَّحُ'], 
   'أجلا': [
          'أَجَلًا'], 
   'بالأزلام': [
              'بِالْأَزْلَامِ'], 
   'طريقة': [
           'طَرِيقَةً'], 
   'أذبحك': [
           'أَذْبَحُكَ'], 
   'مبديه': [
           'مُبْدِيهِ'], 
   'قولك': [
          'قَوْلِكَ'], 
   'فتنتك': [
           'فِتْنَتُكَ'], 
   'أقلت': [
          'أَقَلَّتْ'], 
   'فتنته': [
           'فِتْنَتَهُ'], 
   'فتنتم': [
           'فُتِنْتُمْ',
           'فَتَنْتُمْ'], 
   'رقود': [
          'رُقُودٌ'], 
   'فليمدد': [
            'فَلْيَمْدُدْ'], 
   'تقف': [
         'تَقْفُ'], 
   'أمرنا': [
           'أَمْرُنَا',
           'أَمْرِنَا',
           'أَمْرَنَا',
           'أَمَرْنَا',
           'أَمَرَنَا'], 
   'العرم': [
           'الْعَرِمِ'], 
   'بالهدى': [
            'بِالْهُدَى'], 
   'ألفا': [
          'أَلْفًا'], 
   'طائفتان': [
             'طَائِفَتَانِ'], 
   'فانتشروا': [
              'فَانْتَشِرُوا'], 
   'خمسة': [
          'خَمْسَةٍ',
          'خَمْسَةٌ'], 
   'فلسوف': [
           'فَلَسَوْفَ'], 
   'سنجزي': [
           'سَنَجْزِي'], 
   'أحسوا': [
           'أَحَسُّوا'], 
   'بدأنا': [
           'بَدَأْنَا'], 
   'وغساقا': [
            'وَغَسَّاقًا'], 
   'اللهب': [
           'اللَّهَبِ'], 
   'مترفوها': [
             'مُتْرَفُوهَا'], 
   'بوجوهكم': [
             'بِوُجُوهِكُمْ'], 
   'أيحسب': [
           'أَيَحْسَبُ'], 
   'العنت': [
           'الْعَنَتَ'], 
   'تطيعوه': [
            'تُطِيعُوهُ'], 
   'لمسجد': [
           'لَمَسْجِدٌ'], 
   'ثلاث': [
          'ثَلَاثَ',
          'ثَلَاثِ',
          'ثَلَاثُ',
          'ثَلَاثٍ'], 
   'يزعمون': [
            'يَزْعُمُونَ'], 
   'وللذين': [
            'وَلِلَّذِينَ'], 
   'المهيمن': [
             'الْمُهَيْمِنُ'], 
   'فاسق': [
          'فَاسِقٌ'], 
   'أفرأيتم': [
             'أَفَرَأَيْتُمْ',
             'أَفَرَأَيْتُمُ'], 
   'وآتوا': [
           'وَآتُوا',
           'وَآتَوُا'], 
   'الأبتر': [
            'الْأَبْتَرُ'], 
   'يضحكون': [
            'يَضْحَكُونَ'], 
   'السقاية': [
             'السِّقَايَةَ'], 
   'للوالدين': [
              'لِلْوَالِدَيْنِ'], 
   'ويريد': [
           'وَيُرِيدُ'], 
   'مختوم': [
           'مَخْتُومٍ'], 
   'والنازعات': [
               'وَالنَّازِعَاتِ'], 
   'منظرون': [
            'مُنْظَرُونَ'], 
   'بأعيننا': [
             'بِأَعْيُنِنَا'], 
   'بالخلق': [
            'بِالْخَلْقِ'], 
   'خطيئتي': [
            'خَطِيئَتِي'], 
   'يتفرقون': [
             'يَتَفَرَّقُونَ'], 
   'نسألك': [
           'نَسْأَلُكَ'], 
   'التقى': [
           'الْتَقَى'], 
   'ناديه': [
           'نَادِيَهُ'], 
   'واصفحوا': [
             'وَاصْفَحُوا'], 
   'تعرضن': [
           'تُعْرِضَنَّ'], 
   'الرس': [
          'الرَّسِّ'], 
   'مقنعي': [
           'مُقْنِعِي'], 
   'وليمكنن': [
             'وَلَيُمَكِّنَنَّ'], 
   'يجمعون': [
            'يَجْمَعُونَ'], 
   'وأنعام': [
            'وَأَنْعَامٌ'], 
   'تخافن': [
           'تَخَافَنَّ'], 
   'ورزق': [
          'وَرِزْقٌ',
          'وَرِزْقُ'], 
   'للنبي': [
           'لِلنَّبِيِّ'], 
   'بالقسطاس': [
              'بِالْقِسْطَاسِ'], 
   'يتوفاهن': [
             'يَتَوَفَّاهُنَّ'], 
   'كالأعمى': [
             'كَالْأَعْمَى'], 
   'يطيروا': [
            'يَطَّيَّرُوا'], 
   'لانتصر': [
            'لَانْتَصَرَ'], 
   'ونطبع': [
           'وَنَطْبَعُ'], 
   'وبسر': [
          'وَبَسَرَ'], 
   'باسطو': [
           'بَاسِطُو'], 
   'برشيد': [
           'بِرَشِيدٍ'], 
   'مناسككم': [
             'مَنَاسِكَكُمْ'], 
   'عليكم': [
           'عَلَيْكُمْ',
           'عَلَيْكُمُ'], 
   'بأننا': [
           'بِأَنَّنَا'], 
   'التواب': [
            'التَّوَّابُ'], 
   'حام': [
         'حَامٍ'], 
   'صلاة': [
          'صَلَاةِ'], 
   'فاسمعون': [
             'فَاسْمَعُونِ'], 
   'هواه': [
          'هَوَاهُ'], 
   'فغلبوا': [
            'فَغُلِبُوا'], 
   'وتؤوي': [
           'وَتُؤْوِي'], 
   'وجاعل': [
           'وَجَاعِلُ'], 
   'يتبوأ': [
           'يَتَبَوَّأُ'], 
   'أنعامكم': [
             'أَنْعَامَكُمْ'], 
   'تحسونهم': [
             'تَحُسُّونَهُمْ'], 
   'مشرقين': [
            'مُشْرِقِينَ'], 
   'كيده': [
          'كَيْدُهُ',
          'كَيْدَهُ'], 
   'شفيع': [
          'شَفِيعٍ',
          'شَفِيعٌ'], 
   'والفلك': [
            'وَالْفُلْكِ',
            'وَالْفُلْكَ'], 
   'ترثوا': [
           'تَرِثُوا'], 
   'تحل': [
         'تَحِلُّ',
         'تَحُلُّ'], 
   'مستبصرين': [
              'مُسْتَبْصِرِينَ'], 
   'يأخذه': [
           'يَأْخُذْهُ'], 
   'أصطفى': [
           'أَصْطَفَى'], 
   'دوننا': [
           'دُونِنَا'], 
   'كورت': [
          'كُوِّرَتْ'], 
   'أحياء': [
           'أَحْيَاءٌ',
           'أَحْيَاءٍ',
           'أَحْيَاءً'], 
   'الفتح': [
           'الْفَتْحِ',
           'الْفَتْحُ'], 
   'تكذبون': [
            'تُكَذِّبُونَ',
            'تَكْذِبُونَ'], 
   'الأكبر': [
            'الْأَكْبَرِ',
            'الْأَكْبَرُ',
            'الْأَكْبَرَ'], 
   'خوضهم': [
           'خَوْضِهِمْ'], 
   'كاذبة': [
           'كَاذِبَةٍ',
           'كَاذِبَةٌ'], 
   'حكم': [
         'حُكْمُ',
         'حَكَمَ'], 
   'الغراب': [
            'الْغُرَابِ'], 
   'ظهيرا': [
           'ظَهِيرًا'], 
   'ويصنع': [
           'وَيَصْنَعُ'], 
   'فاتبع': [
           'فَاتَّبِعْ'], 
   'سيكون': [
           'سَيَكُونُ'], 
   'المكنون': [
             'الْمَكْنُونِ'], 
   'عني': [
         'عَنِّي'], 
   'فخلق': [
          'فَخَلَقَ'], 
   'تكذبوا': [
            'تُكَذِّبُوا'], 
   'الجنة': [
           'الْجَنَّةِ',
           'الْجَنَّةَ',
           'الْجَنَّةُ',
           'الْجِنَّةِ',
           'الْجِنَّةُ'], 
   'وقرآن': [
           'وَقُرْآنَ',
           'وَقُرْآنٍ',
           'وَقُرْآنٌ'], 
   'فاعبدني': [
             'فَاعْبُدْنِي'], 
   'والحافظات': [
               'وَالْحَافِظَاتِ'], 
   'والنوى': [
            'وَالنَّوَى'], 
   'أشد': [
         'أَشَدُّ',
         'أَشَدَّ',
         'أَشَدِّ'], 
   'مرحبا': [
           'مَرْحَبًا'], 
   'وسيعلم': [
            'وَسَيَعْلَمُ'], 
   'كيدي': [
          'كَيْدِي'], 
   'مآب': [
         'مَآبٍ',
         'مَآبِ'], 
   'الزاني': [
            'الزَّانِي'], 
   'والنوم': [
            'وَالنَّوْمَ'], 
   'أوبي': [
          'أَوِّبِي'], 
   'هواء': [
          'هَوَاءٌ'], 
   'مثابة': [
           'مَثَابَةً'], 
   'ونسرا': [
           'وَنَسْرًا'], 
   'يابس': [
          'يَابِسٍ'], 
   'درست': [
          'دَرَسْتَ'], 
   'زكريا': [
           'زَكَرِيَّا'], 
   'يخزيه': [
           'يُخْزِيهِ'], 
   'يحيطوا': [
            'يُحِيطُوا'], 
   'وزيتونا': [
             'وَزَيْتُونًا'], 
   'ذللا': [
          'ذُلُلًا'], 
   'نعبد': [
          'نَعْبُدُ',
          'نَعْبُدَ'], 
   'لذائقو': [
            'لَذَائِقُو'], 
   'طائر': [
          'طَائِرٍ'], 
   'بالعروة': [
             'بِالْعُرْوَةِ'], 
   'بعورة': [
           'بِعَوْرَةٍ'], 
   'يمسك': [
          'يُمْسِكْ',
          'يُمْسِكُ',
          'يَمَسَّكَ'], 
   'وأمطرنا': [
             'وَأَمْطَرْنَا'], 
   'أوآباؤنا': [
              'أَوَآبَاؤُنَا'], 
   'يمسه': [
          'يَمَسُّهُ'], 
   'أهلكناهم': [
              'أَهْلَكْنَاهُمْ'], 
   'أبصرنا': [
            'أَبْصَرْنَا'], 
   'وبست': [
          'وَبُسَّتِ'], 
   'ومثواكم': [
             'وَمَثْوَاكُمْ'], 
   'وبالحق': [
            'وَبِالْحَقِّ'], 
   'وجدناه': [
            'وَجَدْنَاهُ'], 
   'مرسلة': [
           'مُرْسِلَةٌ'], 
   'اهتديتم': [
             'اهْتَدَيْتُمْ'], 
   'وحشرناهم': [
              'وَحَشَرْنَاهُمْ'], 
   'وثلثه': [
           'وَثُلُثَهُ'], 
   'يخوضوا': [
            'يَخُوضُوا'], 
   'للخائنين': [
              'لِلْخَائِنِينَ'], 
   'وولدا': [
           'وَوَلَدًا'], 
   'ونذرهم': [
            'وَنَذَرُهُمْ'], 
   'مرسلا': [
           'مُرْسَلًا'], 
   'بالحسنة': [
             'بِالْحَسَنَةِ'], 
   'دانية': [
           'دَانِيَةٌ'], 
   'تسخرون': [
            'تَسْخَرُونَ'], 
   'قرناء': [
           'قُرَنَاءَ'], 
   'مرسلو': [
           'مُرْسِلُو'], 
   'وجاعلوه': [
             'وَجَاعِلُوهُ'], 
   'القمر': [
           'الْقَمَرَ',
           'الْقَمَرُ'], 
   'الودود': [
            'الْوَدُودُ'], 
   'المراضع': [
             'الْمَرَاضِعَ'], 
   'وولده': [
           'وَوَلَدُهُ'], 
   'أعوذ': [
          'أَعُوذُ'], 
   'تكتبوه': [
            'تَكْتُبُوهُ'], 
   'الرعاء': [
            'الرِّعَاءُ'], 
   'أتخذتم': [
            'أَتَّخَذْتُمْ'], 
   'طائف': [
          'طَائِفٌ'], 
   'يحيطون': [
            'يُحِيطُونَ'], 
   'أمري': [
          'أَمْرِي'], 
   'فعصوا': [
           'فَعَصَوْا'], 
   'تمنن': [
          'تَمْنُنْ'], 
   'تصدق': [
          'تَصَدَّقَ'], 
   'فأدخلوا': [
             'فَأُدْخِلُوا'], 
   'بأهلكم': [
            'بِأَهْلِكُمْ'], 
   'الأطفال': [
             'الْأَطْفَالُ'], 
   'لذنبك': [
           'لِذَنْبِكَ',
           'لِذَنْبِكِ'], 
   'يسيركم': [
            'يُسَيِّرُكُمْ'], 
   'يؤتى': [
          'يُؤْتَى'], 
   'يؤتي': [
          'يُؤْتِي'], 
   'بلغت': [
          'بَلَغَتِ',
          'بَلَّغْتَ',
          'بَلَغْتُ',
          'بَلَغْتَ'], 
   'فيضل': [
          'فَيُضِلُّ'], 
   'زبر': [
         'زُبُرِ',
         'زُبَرَ'], 
   'بلغا': [
          'بَلَغَا'], 
   'ميلة': [
          'مَيْلَةً'], 
   'يثخن': [
          'يُثْخِنَ'], 
   'وأحيي': [
           'وَأُحْيِي'], 
   'زبد': [
         'زَبَدٌ'], 
   'جعلتم': [
           'جَعَلْتُمُ'], 
   'يغشاهم': [
            'يَغْشَاهُمُ'], 
   'كالرميم': [
             'كَالرَّمِيمِ'], 
   'أعمالنا': [
             'أَعْمَالُنَا'], 
   'والضفادع': [
              'وَالضَّفَادِعَ'], 
   'ينصرونكم': [
              'يَنْصُرُونَكُمْ'], 
   'يظهر': [
          'يُظْهِرُ',
          'يُظْهِرَ'], 
   'ارتابوا': [
             'ارْتَابُوا'], 
   'الخالية': [
             'الْخَالِيَةِ'], 
   'زكية': [
          'زَكِيَّةً'], 
   'تمسسه': [
           'تَمْسَسْهُ'], 
   'جعل': [
         'جَعَلَ',
         'جُعِلَ'], 
   'سائبة': [
           'سَائِبَةٍ'], 
   'وآتنا': [
           'وَآتِنَا'], 
   'قطران': [
           'قَطِرَانٍ'], 
   'الديار': [
            'الدِّيَارِ'], 
   'أضاءت': [
           'أَضَاءَتْ'], 
   'طائعين': [
            'طَائِعِينَ'], 
   'وتذوقوا': [
             'وَتَذُوقُوا'], 
   'بأموالهم': [
              'بِأَمْوَالِهِمْ'], 
   'أوأمن': [
           'أَوَأَمِنَ'], 
   'لإبراهيم': [
              'لِإِبْرَاهِيمَ',
              'لَإِبْرَاهِيمَ'], 
   'فأوجس': [
           'فَأَوْجَسَ'], 
   'تنفعها': [
            'تَنْفَعُهَا'], 
   'واصطفاك': [
             'وَاصْطَفَاكِ'], 
   'وتجارة': [
            'وَتِجَارَةٌ'], 
   'فاكتبنا': [
             'فَاكْتُبْنَا'], 
   'جزوعا': [
           'جَزُوعًا'], 
   'كفرنا': [
           'كَفَرْنَا'], 
   'فحكمه': [
           'فَحُكْمُهُ'], 
   'حي': [
        'حَيَّ',
        'حَيٍّ'], 
   'يعملون': [
            'يَعْمَلُونَ'], 
   'فأتبع': [
           'فَأَتْبَعَ'], 
   'جلابيبهن': [
              'جَلَابِيبِهِنَّ'], 
   'ورأوا': [
           'وَرَأَوُا',
           'وَرَأَوْا'], 
   'وذرياتنا': [
              'وَذُرِّيَّاتِنَا'], 
   'يصهر': [
          'يُصْهَرُ'], 
   'بلغن': [
          'بَلَغْنَ'], 
   'بالعصبة': [
             'بِالْعُصْبَةِ'], 
   'وفصاله': [
            'وَفِصَالُهُ'], 
   'تركتموها': [
              'تَرَكْتُمُوهَا'], 
   'اداركوا': [
             'ادَّارَكُوا'], 
   'آثارهم': [
            'آثَارِهِمْ'], 
   'أذلة': [
          'أَذِلَّةً',
          'أَذِلَّةٍ',
          'أَذِلَّةٌ'], 
   'لكارهون': [
             'لَكَارِهُونَ'], 
   'والأصم': [
            'وَالْأَصَمِّ'], 
   'كفور': [
          'كَفُورٍ',
          'كَفُورٌ'], 
   'تفجر': [
          'تَفْجُرَ'], 
   'بحسبان': [
            'بِحُسْبَانٍ'], 
   'فلننبئن': [
             'فَلَنُنَبِّئَنَّ'], 
   'وليكونا': [
             'وَلَيَكُونًا'], 
   'الشاكرين': [
              'الشَّاكِرِينَ'], 
   'فيضلك': [
           'فَيُضِلَّكَ'], 
   'كفوا': [
          'كُفُّوا',
          'كُفُوًا'], 
   'أبيهم': [
           'أَبِيهِمْ'], 
   'صلحا': [
          'صُلْحًا'], 
   'يجعلني': [
            'يَجْعَلْنِي'], 
   'سحاب': [
          'سَحَابٌ'], 
   'نري': [
         'نُرِي'], 
   'نرى': [
         'نَرَى'], 
   'وأحاط': [
           'وَأَحَاطَ'], 
   'عقدت': [
          'عَقَدَتْ'], 
   'وزفيرا': [
            'وَزَفِيرًا'], 
   'والمساكين': [
               'وَالْمَسَاكِينِ',
               'وَالْمَسَاكِينَ',
               'وَالْمَسَاكِينُ'], 
   'بملوم': [
           'بِمَلُومٍ'], 
   'خولناه': [
            'خَوَّلْنَاهُ'], 
   'عدوانا': [
            'عُدْوَانًا'], 
   'الذكران': [
             'الذُّكْرَانَ'], 
   'لنعبد': [
           'لِنَعْبُدَ'], 
   'أنجيتنا': [
             'أَنْجَيْتَنَا'], 
   'نرث': [
         'نَرِثُ'], 
   'البيان': [
            'الْبَيَانَ'], 
   'نرد': [
         'نُرَدُّ'], 
   'استحقا': [
            'اسْتَحَقَّا'], 
   'الغم': [
          'الْغَمِّ'], 
   'يحرفونه': [
             'يُحَرِّفُونَهُ'], 
   'مفاتح': [
           'مَفَاتِحُ'], 
   'فكانوا': [
            'فَكَانُوا'], 
   'شركائهم': [
             'شُرَكَائِهِمْ'], 
   'أضللتم': [
            'أَضْلَلْتُمْ'], 
   'أتتخذنا': [
             'أَتَتَّخِذُنَا'], 
   'لمسخناهم': [
              'لَمَسَخْنَاهُمْ'], 
   'عجوز': [
          'عَجُوزٌ'], 
   'تأثيم': [
           'تَأْثِيمٌ'], 
   'أذلك': [
          'أَذَلِكَ'], 
   'وكادوا': [
            'وَكَادُوا'], 
   'أحاط': [
          'أَحَاطَ'], 
   'أحصروا': [
            'أُحْصِرُوا'], 
   'تحرص': [
          'تَحْرِصْ'], 
   'حافين': [
           'حَافِّينَ'], 
   'وثلة': [
          'وَثُلَّةٌ'], 
   'نشورا': [
           'نُشُورًا'], 
   'تصدونا': [
            'تَصُدُّونَا'], 
   'يتطهروا': [
             'يَتَطَهَّرُوا'], 
   'يهتدون': [
            'يَهْتَدُونَ'], 
   'سنطيعكم': [
             'سَنُطِيعُكُمْ'], 
   'كالقصر': [
            'كَالْقَصْرِ'], 
   'للطاغين': [
             'لِلطَّاغِينَ'], 
   'فارهين': [
            'فَارِهِينَ'], 
   'مصفرا': [
           'مُصْفَرًّا'], 
   'أعظم': [
          'أَعْظَمُ'], 
   'الأغلال': [
             'الْأَغْلَالُ',
             'الْأَغْلَالَ'], 
   'ثماني': [
           'ثَمَانِيَ'], 
   'وجاءكم': [
            'وَجَاءَكُمُ'], 
   'شريك': [
          'شَرِيكٌ',
          'شَرِيكَ'], 
   'الأيد': [
           'الْأَيْدِ'], 
   'وقضى': [
          'وَقَضَى'], 
   'وقضي': [
          'وَقُضِيَ'], 
   'فرحون': [
           'فَرِحُونَ'], 
   'فقليلا': [
            'فَقَلِيلًا'], 
   'فارتقبهم': [
              'فَارْتَقِبْهُمْ'], 
   'المؤمنون': [
              'الْمُؤْمِنُونَ'], 
   'تسريح': [
           'تَسْرِيحٌ'], 
   'فأنه': [
          'فَأَنَّهُ'], 
   'فيسخرون': [
             'فَيَسْخَرُونَ'], 
   'وجعلها': [
            'وَجَعَلَهَا'], 
   'محظورا': [
            'مَحْظُورًا'], 
   'أعظك': [
          'أَعِظُكَ'], 
   'سنبلة': [
           'سُنْبُلَةٍ'], 
   'فأنى': [
          'فَأَنَّى'], 
   'فرحوا': [
           'فَرِحُوا'], 
   'تذرني': [
           'تَذَرْنِي'], 
   'لغير': [
          'لِغَيْرِ'], 
   'يفصل': [
          'يَفْصِلُ',
          'يُفَصِّلُ'], 
   'يتسنه': [
           'يَتَسَنَّهْ'], 
   'مكظوم': [
           'مَكْظُومٌ'], 
   'يحادد': [
           'يُحَادِدِ'], 
   'والأولاد': [
              'وَالْأَوْلَادِ'], 
   'تبتيلا': [
            'تَبْتِيلًا'], 
   'رويدا': [
           'رُوَيْدًا'], 
   'أرسلوا': [
            'أُرْسِلُوا'], 
   'فأنت': [
          'فَأَنْتَ'], 
   'الرجعى': [
            'الرُّجْعَى'], 
   'وأسلمت': [
            'وَأَسْلَمْتُ'], 
   'والجار': [
            'وَالْجَارِ'], 
   'يتطهرون': [
             'يَتَطَهَّرُونَ'], 
   'بغلام': [
           'بِغُلَامٍ'], 
   'يهتدوا': [
            'يَهْتَدُوا'], 
   'تحسدوننا': [
              'تَحْسُدُونَنَا'], 
   'الغائط': [
            'الْغَائِطِ'], 
   'شحومهما': [
             'شُحُومَهُمَا'], 
   'القصاص': [
            'الْقِصَاصِ',
            'الْقِصَاصُ'], 
   'العظم': [
           'الْعَظْمُ'], 
   'ربك': [
         'رَبِّكَ',
         'رَبَّكَ',
         'رَبُّكَ',
         'رَبِّكِ',
         'رَبُّكِ'], 
   'ربه': [
         'رَبِّهِ',
         'رَبَّهُ',
         'رَبُّهُ'], 
   'ربي': [
         'رَبِّي',
         'رَبِّيَ'], 
   'أحيي': [
          'أُحْيِي'], 
   'القبور': [
            'الْقُبُورِ',
            'الْقُبُورُ'], 
   'جزاء': [
          'جَزَاءً',
          'جَزَاءُ'], 
   'تشيع': [
          'تَشِيعَ'], 
   'ظلمنا': [
           'ظَلَمْنَا'], 
   'أليما': [
           'أَلِيمًا'], 
   'استمعوه': [
             'اسْتَمَعُوهُ'], 
   'وضربنا': [
            'وَضَرَبْنَا'], 
   'وأبيه': [
           'وَأَبِيهِ'], 
   'أضاء': [
          'أَضَاءَ'], 
   'والذين': [
            'وَالَّذِينَ'], 
   'النفاق': [
            'النِّفَاقِ'], 
   'مدكر': [
          'مُدَّكِرٍ'], 
   'بقوة': [
          'بِقُوَّةٍ'], 
   'آتيتك': [
           'آتَيْتُكَ'], 
   'لوح': [
         'لَوْحٍ'], 
   'نومكم': [
           'نَوْمَكُمْ'], 
   'وحنانا': [
            'وَحَنَانًا'], 
   'نطبع': [
          'نَطْبَعُ'], 
   'أزاغ': [
          'أَزَاغَ'], 
   'فقال': [
          'فَقَالَ'], 
   'مارد': [
          'مَارِدٍ'], 
   'فيتبعون': [
             'فَيَتَّبِعُونَ'], 
   'تحبسونهما': [
               'تَحْبِسُونَهُمَا'], 
   'مارج': [
          'مَارِجٍ'], 
   'أظن': [
         'أَظُنُّ'], 
   'وفضل': [
          'وَفَضْلٍ',
          'وَفَضَّلَ'], 
   'لوط': [
         'لُوطٍ',
         'لُوطُ',
         'لُوطٌ'], 
   'ببكة': [
          'بِبَكَّةَ'], 
   'فتعالى': [
            'فَتَعَالَى'], 
   'أرضهم': [
           'أَرْضَهُمْ'], 
   'يحتسبوا': [
             'يَحْتَسِبُوا'], 
   'لنخرجنكم': [
              'لَنُخْرِجَنَّكُمْ'], 
   'تشطط': [
          'تُشْطِطْ'], 
   'وجاءوا': [
            'وَجَاءُوا'], 
   'يستفزهم': [
             'يَسْتَفِزَّهُمْ'], 
   'الغالبون': [
              'الْغَالِبُونَ'], 
   'يحبونكم': [
             'يُحِبُّونَكُمْ'], 
   'لجبريل': [
            'لِجِبْرِيلَ'], 
   'شقيا': [
          'شَقِيًّا'], 
   'يأتونك': [
            'يَأْتُونَكَ'], 
   'وكأين': [
           'وَكَأَيِّنْ'], 
   'المصطفين': [
              'الْمُصْطَفَيْنَ'], 
   'يأتوني': [
            'يَأْتُونِي'], 
   'بخمسة': [
           'بِخَمْسَةِ'], 
   'جلودهم': [
            'جُلُودُهُمْ'], 
   'فاصبروا': [
             'فَاصْبِرُوا'], 
   'الشهر': [
           'الشَّهْرَ',
           'الشَّهْرِ',
           'الشَّهْرُ'], 
   'متشابهات': [
              'مُتَشَابِهَاتٌ'], 
   'أقصى': [
          'أَقْصَى'], 
   'لأزينن': [
            'لَأُزَيِّنَنَّ'], 
   'آتاهما': [
            'آتَاهُمَا'], 
   'الخسران': [
             'الْخُسْرَانُ'], 
   'بقول': [
          'بِقَوْلِ'], 
   'بقوم': [
          'بِقَوْمٍ'], 
   'أنتم': [
          'أَنْتُمْ',
          'أَنْتُمُ'], 
   'البعث': [
           'الْبَعْثِ'], 
   'ويلبسون': [
             'وَيَلْبَسُونَ'], 
   'تحزني': [
           'تَحْزَنِي'], 
   'الثاقب': [
            'الثَّاقِبُ'], 
   'أوعجبتم': [
             'أَوَعَجِبْتُمْ'], 
   'وهذه': [
          'وَهَذِهِ'], 
   'خالصا': [
           'خَالِصًا'], 
   'لتعتدوا': [
             'لِتَعْتَدُوا'], 
   'ملأ': [
         'مَلَأٌ'], 
   'السحت': [
           'السُّحْتَ'], 
   'وخلقناكم': [
              'وَخَلَقْنَاكُمْ'], 
   'وبقية': [
           'وَبَقِيَّةٌ'], 
   'فاستمتعتم': [
               'فَاسْتَمْتَعْتُمْ'], 
   'السحر': [
           'السِّحْرَ',
           'السِّحْرِ',
           'السِّحْرُ'], 
   'فآتهم': [
           'فَآتِهِمْ'], 
   'ولأبويه': [
             'وَلِأَبَوَيْهِ'], 
   'نقتبس': [
           'نَقْتَبِسْ'], 
   'لبعولتهن': [
              'لِبُعُولَتِهِنَّ'], 
   'ونذيقه': [
            'وَنُذِيقُهُ'], 
   'فارتد': [
           'فَارْتَدَّ'], 
   'اخترناهم': [
              'اخْتَرْنَاهُمْ'], 
   'تستكثر': [
            'تَسْتَكْثِرُ'], 
   'أمهلهم': [
            'أَمْهِلْهُمْ'], 
   'ولمن': [
          'وَلِمَنْ',
          'وَلَمَنْ',
          'وَلَمَنِ'], 
   'يخلقكم': [
            'يَخْلُقُكُمْ'], 
   'لدلوك': [
           'لِدُلُوكِ'], 
   'بالشهر': [
            'بِالشَّهْرِ'], 
   'الأعراف': [
             'الْأَعْرَافِ'], 
   'وينزل': [
           'وَيُنَزِّلُ'], 
   'لأخيه': [
           'لِأَخِيهِ'], 
   'يخفون': [
           'يُخْفُونَ',
           'يَخْفَوْنَ'], 
   'يجاهدوا': [
             'يُجَاهِدُوا'], 
   'المطوعين': [
              'الْمُطَّوِّعِينَ'], 
   'فإن': [
         'فَإِنْ',
         'فَإِنَّ',
         'فَإِنِ'], 
   'إثما': [
          'إِثْمًا'], 
   'محاريب': [
            'مَحَارِيبَ'], 
   'تحرك': [
          'تُحَرِّكْ'], 
   'الزور': [
           'الزُّورِ',
           'الزُّورَ'], 
   'فإذ': [
         'فَإِذْ'], 
   'يزده': [
          'يَزِدْهُ'], 
   'الأعراب': [
             'الْأَعْرَابِ',
             'الْأَعْرَابُ'], 
   'يخرجوكم': [
             'يُخْرِجُوكُمْ'], 
   'والتي': [
           'وَالَّتِي'], 
   'وقرآنه': [
            'وَقُرْآنَهُ'], 
   'أتممت': [
           'أَتْمَمْتَ'], 
   'كوني': [
          'كُونِي'], 
   'ريحا': [
          'رِيحًا'], 
   'إثمه': [
          'إِثْمُهُ'], 
   'مدبرا': [
           'مُدْبِرًا'], 
   'كبتوا': [
           'كُبِتُوا'], 
   'ندري': [
          'نَدْرِي'], 
   'عورة': [
          'عَوْرَةٌ'], 
   'وهذا': [
          'وَهَذَا'], 
   'عبادتكم': [
             'عِبَادَتِكُمْ'], 
   'أحبارهم': [
             'أَحْبَارَهُمْ'], 
   'المضاجع': [
             'الْمَضَاجِعِ'], 
   'وأوذوا': [
            'وَأُوذُوا'], 
   'لتخرجوا': [
             'لِتُخْرِجُوا'], 
   'وآباءهم': [
             'وَآبَاءَهُمْ'], 
   'غم': [
        'غَمٍّ'], 
   'ويخش': [
          'وَيَخْشَ'], 
   'لحكمهم': [
            'لِحُكْمِهِمْ'], 
   'المسخر': [
            'الْمُسَخَّرِ'], 
   'النذير': [
            'النَّذِيرُ'], 
   'ووقع': [
          'وَوَقَعَ'], 
   'أرضعنكم': [
             'أَرْضَعْنَكُمْ'], 
   'وقبائل': [
            'وَقَبَائِلَ'], 
   'تشابه': [
           'تَشَابَهَ'], 
   'يجدونه': [
            'يَجِدُونَهُ'], 
   'وزادكم': [
            'وَزَادَكُمْ'], 
   'حب': [
        'حُبُّ',
        'حُبَّ'], 
   'آخرين': [
           'آخَرِينَ'], 
   'يصبح': [
          'يُصْبِحَ'], 
   'آبائكم': [
            'آبَائِكُمُ',
            'آبَائِكُمْ'], 
   'آلهتي': [
           'آلِهَتِي'], 
   'يخافه': [
           'يَخَافُهُ'], 
   'لظى': [
         'لَظَى'], 
   'ربكم': [
          'رَبِّكُمْ',
          'رَبُّكُمْ',
          'رَبَّكُمْ',
          'رَبَّكُمُ',
          'رَبُّكُمُ'], 
   'وسرابيل': [
             'وَسَرَابِيلَ'], 
   'المنزلين': [
              'الْمُنْزِلِينَ'], 
   'يهب': [
         'يَهَبُ'], 
   'للمحسنين': [
              'لِلْمُحْسِنِينَ'], 
   'يهد': [
         'يَهْدِ'], 
   'نارا': [
          'نَارًا'], 
   'سوط': [
         'سَوْطَ'], 
   'الدهر': [
           'الدَّهْرِ',
           'الدَّهْرُ'], 
   'أترفتم': [
            'أُتْرِفْتُمْ'], 
   'طائره': [
           'طَائِرَهُ'], 
   'والجبال': [
             'وَالْجِبَالُ',
             'وَالْجِبَالَ',
             'وَالْجِبَالِ'], 
   'يمسكون': [
            'يُمَسِّكُونَ'], 
   'ديني': [
          'دِينِي'], 
   'دينه': [
          'دِينِهِ'], 
   'تختصمون': [
             'تَخْتَصِمُونَ'], 
   'بنفسك': [
           'بِنَفْسِكَ'], 
   'فيسحتكم': [
             'فَيُسْحِتَكُمْ'], 
   'البيوت': [
            'الْبُيُوتِ',
            'الْبُيُوتَ'], 
   'ظفر': [
         'ظُفُرٍ'], 
   'والأولين': [
              'وَالْأَوَّلِينَ'], 
   'متحرفا': [
            'مُتَحَرِّفًا'], 
   'يهن': [
         'يُهِنِ'], 
   'قربا': [
          'قَرَّبَا'], 
   'وحلالا': [
            'وَحَلَالًا'], 
   'يكفلونه': [
             'يَكْفُلُونَهُ'], 
   'دينا': [
          'دِينًا'], 
   'تختصموا': [
             'تَخْتَصِمُوا'], 
   'يفعلون': [
            'يَفْعَلُونَ'], 
   'مقمحون': [
            'مُقْمَحُونَ'], 
   'الفاسقون': [
              'الْفَاسِقُونَ'], 
   'أشركت': [
           'أَشْرَكْتَ'], 
   'ليتخذ': [
           'لِيَتَّخِذَ'], 
   'متبر': [
          'مُتَبَّرٌ'], 
   'صرفكم': [
           'صَرَفَكُمْ'], 
   'الحديث': [
            'الْحَدِيثِ'], 
   'الأسفلين': [
              'الْأَسْفَلِينَ'], 
   'الحديد': [
            'الْحَدِيدَ',
            'الْحَدِيدِ'], 
   'سبع': [
         'سَبْعَ',
         'سَبْعٌ',
         'سَبْعِ'], 
   'شغفها': [
           'شَغَفَهَا'], 
   'ليوفيهم': [
             'لِيُوَفِّيَهُمْ'], 
   'بأمرهم': [
            'بِأَمْرِهِمْ'], 
   'ومأواهم': [
             'وَمَأْوَاهُمْ',
             'وَمَأْوَاهُمُ'], 
   'فاعبدوا': [
             'فَاعْبُدُوا'], 
   'عسيتم': [
           'عَسَيْتُمْ'], 
   'لأخذنا': [
            'لَأَخَذْنَا'], 
   'خلائف': [
           'خَلَائِفَ'], 
   'نموت': [
          'نَمُوتُ'], 
   'واشهدوا': [
             'وَاشْهَدُوا'], 
   'فكبر': [
          'فَكَبِّرْ'], 
   'تعبرون': [
            'تَعْبُرُونَ'], 
   'بمصرخي': [
            'بِمُصْرِخِيَّ'], 
   'ويدخلهم': [
             'وَيُدْخِلُهُمْ',
             'وَيُدْخِلُهُمُ'], 
   'فاعتبروا': [
              'فَاعْتَبِرُوا'], 
   'وكفرنا': [
            'وَكَفَرْنَا'], 
   'معروفا': [
            'مَعْرُوفًا'], 
   'وأكواب': [
            'وَأَكْوَابٍ',
            'وَأَكْوَابٌ'], 
   'يكلمهم': [
            'يُكَلِّمُهُمُ',
            'يُكَلِّمُهُمْ'], 
   'ونسوه': [
           'وَنَسُوهُ'], 
   'ونسوق': [
           'وَنَسُوقُ'], 
   'لسحر': [
          'لَسِحْرٌ'], 
   'وآياته': [
            'وَآيَاتِهِ'], 
   'كذبوا': [
           'كَذَّبُوا',
           'كَذَبُوا',
           'كُذِّبُوا',
           'كُذِبُوا'], 
   'وليقترفوا': [
               'وَلِيَقْتَرِفُوا'], 
   'تستقدمون': [
              'تَسْتَقْدِمُونَ'], 
   'كتابا': [
           'كِتَابًا'], 
   'بعهدي': [
           'بِعَهْدِي'], 
   'ويستخلفكم': [
               'وَيَسْتَخْلِفَكُمْ'], 
   'أيان': [
          'أَيَّانَ'], 
   'ويفعلون': [
             'وَيَفْعَلُونَ'], 
   'ونرد': [
          'وَنُرَدُّ'], 
   'أيام': [
          'أَيَّامٍ',
          'أَيَّامِ',
          'أَيَّامَ'], 
   'يقومون': [
            'يَقُومُونَ'], 
   'فظلموا': [
            'فَظَلَمُوا'], 
   'يكفر': [
          'يَكْفُرْ',
          'يَكْفُرُ',
          'يُكَفِّرْ',
          'يُكْفَرُ',
          'يُكَفِّرَ'], 
   'مآرب': [
          'مَآرِبُ'], 
   'وإخوته': [
            'وَإِخْوَتِهِ'], 
   'يسلط': [
          'يُسَلِّطُ'], 
   'واستغفر': [
             'وَاسْتَغْفِرْ',
             'وَاسْتَغْفِرِ',
             'وَاسْتَغْفَرَ'], 
   'رميم': [
          'رَمِيمٌ'], 
   'يتناهون': [
             'يَتَنَاهَوْنَ'], 
   'كذبون': [
           'كَذَّبُونِ'], 
   'كذبوه': [
           'كَذَّبُوهُ'], 
   'يكفل': [
          'يَكْفُلُ'], 
   'كتابه': [
           'كِتَابَهُ'], 
   'كذبوك': [
           'كَذَّبُوكَ'], 
   'يسلم': [
          'يُسْلِمْ'], 
   'يسلك': [
          'يَسْلُكُ'], 
   'بتأويل': [
            'بِتَأْوِيلِ'], 
   'متعناهم': [
             'مَتَّعْنَاهُمْ'], 
   'شديد': [
          'شَدِيدُ',
          'شَدِيدٌ',
          'شَدِيدٍ',
          'شَدِيدِ'], 
   'والنبيين': [
              'وَالنَّبِيِّينَ'], 
   'لفشلتم': [
            'لَفَشِلْتُمْ'], 
   'فتحسسوا': [
             'فَتَحَسَّسُوا'], 
   'ساوى': [
          'سَاوَى'], 
   'رعبا': [
          'رُعْبًا'], 
   'يفلح': [
          'يُفْلِحُ'], 
   'فاعبدون': [
             'فَاعْبُدُونِ'], 
   'الأشرار': [
             'الْأَشْرَارِ'], 
   'الفلق': [
           'الْفَلَقِ'], 
   'وينهون': [
            'وَيَنْهَوْنَ'], 
   'يشتهون': [
            'يَشْتَهُونَ'], 
   'وتفاخر': [
            'وَتَفَاخُرٌ'], 
   'الولاية': [
             'الْوَلَايَةُ'], 
   'تضلوا': [
           'تَضِلُّوا'], 
   'تجعلوا': [
            'تَجْعَلُوا'], 
   'ونسوا': [
           'وَنَسُوا'], 
   'داخلون': [
            'دَاخِلُونَ'], 
   'لزلفى': [
           'لَزُلْفَى'], 
   'للسائل': [
            'لِلسَّائِلِ'], 
   'ضلالتهم': [
             'ضَلَالَتِهِمْ'], 
   'أتدعون': [
            'أَتَدْعُونَ'], 
   'شيعته': [
           'شِيعَتِهِ'], 
   'لتعرضوا': [
             'لِتُعْرِضُوا'], 
   'إلحافا': [
            'إِلْحَافًا'], 
   'بجالوت': [
            'بِجَالُوتَ'], 
   'نزلنا': [
           'نَزَّلْنَا'], 
   'نصيبا': [
           'نَصِيبًا'], 
   'لأهل': [
          'لِأَهْلِ'], 
   'راودتن': [
            'رَاوَدْتُنَّ'], 
   'إيمانهم': [
             'إِيمَانِهِمْ',
             'إِيمَانُهُمْ',
             'إِيمَانَهُمْ'], 
   'يطيقونه': [
             'يُطِيقُونَهُ'], 
   'ابتغاء': [
            'ابْتِغَاءَ',
            'ابْتِغَاءِ'], 
   'للغيب': [
           'لِلْغَيْبِ'], 
   'يتكئون': [
            'يَتَّكِئُونَ'], 
   'فبما': [
          'فَبِمَا'], 
   'فاختلط': [
            'فَاخْتَلَطَ'], 
   'يتولونه': [
             'يَتَوَلَّوْنَهُ'], 
   'أحسنه': [
           'أَحْسَنَهُ'], 
   'وماء': [
          'وَمَاءٍ'], 
   'وأوتينا': [
             'وَأُوتِينَا'], 
   'سماعون': [
            'سَمَّاعُونَ'], 
   'وقود': [
          'وَقُودُ'], 
   'المولود': [
             'الْمَوْلُودِ'], 
   'بعيدا': [
           'بَعِيدًا'], 
   'إيمانها': [
             'إِيمَانُهَا',
             'إِيمَانِهَا'], 
   'أكرمن': [
           'أَكْرَمَنِ'], 
   'نطمع': [
          'نَطْمَعُ'], 
   'خوفا': [
          'خَوْفًا'], 
   'فاختلف': [
            'فَاخْتُلِفَ',
            'فَاخْتَلَفَ'], 
   'القلائد': [
             'الْقَلَائِدَ'], 
   'حرجا': [
          'حَرَجًا'], 
   'ضعافا': [
           'ضِعَافًا'], 
   'عجوزا': [
           'عَجُوزًا'], 
   'أفسحر': [
           'أَفَسِحْرٌ'], 
   'وقول': [
          'وَقَوْلٌ'], 
   'وقوم': [
          'وَقَوْمُ',
          'وَقَوْمَ',
          'وَقَوْمِ'], 
   'وآباؤكم': [
             'وَآبَاؤُكُمْ',
             'وَآبَاؤُكُمُ'], 
   'ففروا': [
           'فَفِرُّوا'], 
   'استحبوا': [
             'اسْتَحَبُّوا'], 
   'ظهريا': [
           'ظِهْرِيًّا'], 
   'خسر': [
         'خَسِرَ',
         'خُسْرٍ'], 
   'تميد': [
          'تَمِيدَ'], 
   'أقول': [
          'أَقُولُ',
          'أَقُولَ'], 
   'استجيبوا': [
              'اسْتَجِيبُوا'], 
   'الأعلون': [
             'الْأَعْلَوْنَ'], 
   'ثمرات': [
           'ثَمَرَاتٍ',
           'ثَمَرَاتِ',
           'ثَمَرَاتُ'], 
   'آتيناك': [
            'آتَيْنَاكَ'], 
   'أنجاكم': [
            'أَنْجَاكُمْ'], 
   'وملائكته': [
              'وَمَلَائِكَتِهِ',
              'وَمَلَائِكَتُهُ',
              'وَمَلَائِكَتَهُ'], 
   'الرسول': [
            'الرَّسُولَ',
            'الرَّسُولِ',
            'الرَّسُولُ'], 
   'يضروكم': [
            'يَضُرُّوكُمْ'], 
   'قوارير': [
            'قَوَارِيرَ'], 
   'بالشفق': [
            'بِالشَّفَقِ'], 
   'عشية': [
          'عَشِيَّةً'], 
   'لأهب': [
          'لِأَهَبَ'], 
   'ناصحون': [
            'نَاصِحُونَ'], 
   'لشديد': [
           'لَشَدِيدٌ',
           'لَشَدِيدُ'], 
   'نصيبك': [
           'نَصِيبَكَ'], 
   'أطغيته': [
            'أَطْغَيْتُهُ'], 
   'لسليمان': [
             'لِسُلَيْمَانَ'], 
   'وعليه': [
           'وَعَلَيْهِ'], 
   'لمدين': [
           'لِمَدْيَنَ'], 
   'وأنشأنا': [
             'وَأَنْشَأْنَا'], 
   'ليقولن': [
            'لَيَقُولُنَّ',
            'لَيَقُولَنَّ'], 
   'يغلي': [
          'يَغْلِي'], 
   'وكلنا': [
           'وَكَّلْنَا'], 
   'بأربعة': [
            'بِأَرْبَعَةِ'], 
   'ادخلوا': [
            'ادْخُلُوا'], 
   'شاخصة': [
           'شَاخِصَةٌ'], 
   'ونصله': [
           'وَنُصْلِهِ'], 
   'الإنس': [
           'الْإِنْسِ',
           'الْإِنْسُ'], 
   'بالبينات': [
              'بِالْبَيِّنَاتِ'], 
   'وأدخل': [
           'وَأُدْخِلَ',
           'وَأَدْخِلْ'], 
   'هاجروا': [
            'هَاجَرُوا'], 
   'وسبلا': [
           'وَسُبُلًا'], 
   'والأبصار': [
              'وَالْأَبْصَارَ',
              'وَالْأَبْصَارِ',
              'وَالْأَبْصَارُ'], 
   'ولنبينه': [
             'وَلِنُبَيِّنَهُ'], 
   'نسك': [
         'نُسُكٍ'], 
   'نأتي': [
          'نَأْتِي'], 
   'الصبح': [
           'الصُّبْحُ'], 
   'وسفرا': [
           'وَسَفَرًا'], 
   'ورفعنا': [
            'وَرَفَعْنَا'], 
   'نسي': [
         'نَسِيَ'], 
   'فصبر': [
          'فَصَبْرٌ'], 
   'حجابا': [
           'حِجَابًا'], 
   'وفديناه': [
             'وَفَدَيْنَاهُ'], 
   'مسافحات': [
             'مُسَافِحَاتٍ'], 
   'وضعت': [
          'وَضَعَتْ'], 
   'نعيدكم': [
            'نُعِيدُكُمْ'], 
   'سيذكر': [
           'سَيَذَّكَّرُ'], 
   'تعتذروا': [
             'تَعْتَذِرُوا'], 
   'قوسين': [
           'قَوْسَيْنِ'], 
   'ولتجدنهم': [
              'وَلَتَجِدَنَّهُمْ'], 
   'البوار': [
            'الْبَوَارِ'], 
   'سأستغفر': [
             'سَأَسْتَغْفِرُ'], 
   'فاستقم': [
            'فَاسْتَقِمْ'], 
   'فإما': [
          'فَإِمَّا'], 
   'فيوفيهم': [
             'فَيُوَفِّيهِمْ'], 
   'وجاهد': [
           'وَجَاهَدَ'], 
   'الشكور': [
            'الشَّكُورُ'], 
   'الغلام': [
            'الْغُلَامُ'], 
   'الأعجمين': [
              'الْأَعْجَمِينَ'], 
   'وبينات': [
            'وَبَيِّنَاتٍ'], 
   'سيهزم': [
           'سَيُهْزَمُ'], 
   'صيحة': [
          'صَيْحَةً',
          'صَيْحَةٍ'], 
   'وضعف': [
          'وَضِعْفَ'], 
   'فجعلتم': [
            'فَجَعَلْتُمْ'], 
   'وتسبحوه': [
             'وَتُسَبِّحُوهُ'], 
   'يتبع': [
          'يَتَّبِعُ',
          'يُتَّبَعَ',
          'يَتَّبِعْ'], 
   'وفرعها': [
            'وَفَرْعُهَا'], 
   'يحملون': [
            'يَحْمِلُونَ'], 
   'الصديقون': [
              'الصِّدِّيقُونَ'], 
   'لذي': [
         'لِذِي'], 
   'فالفارقات': [
               'فَالْفَارِقَاتِ'], 
   'لقتال': [
           'لِقِتَالٍ'], 
   'خيانة': [
           'خِيَانَةً'], 
   'يتراجعا': [
             'يَتَرَاجَعَا'], 
   'أفنان': [
           'أَفْنَانٍ'], 
   'لكلمات': [
            'لِكَلِمَاتِ'], 
   'خشية': [
          'خَشْيَةِ',
          'خَشْيَةَ',
          'خَشْيَةً'], 
   'خشيت': [
          'خَشِيتُ'], 
   'ترابا': [
           'تُرَابًا'], 
   'تكنزون': [
            'تَكْنِزُونَ'], 
   'يطمعون': [
            'يَطْمَعُونَ'], 
   'يؤمرون': [
            'يُؤْمَرُونَ'], 
   'حسوما': [
           'حُسُومًا'], 
   'يطعمه': [
           'يَطْعَمْهُ',
           'يَطْعَمُهُ'], 
   'أتاك': [
          'أَتَاكَ'], 
   'تفرقوا': [
            'تَفَرَّقُوا'], 
   'ويؤتون': [
            'وَيُؤْتُونَ'], 
   'وحجرا': [
           'وَحِجْرًا'], 
   'فانتقمنا': [
              'فَانْتَقَمْنَا'], 
   'ولأنعامكم': [
               'وَلِأَنْعَامِكُمْ'], 
   'زحزح': [
          'زُحْزِحَ'], 
   'لأنتم': [
           'لَأَنْتُمْ'], 
   'فعظوهن': [
            'فَعِظُوهُنَّ'], 
   'الرازقين': [
              'الرَّازِقِينَ'], 
   'يعمهون': [
            'يَعْمَهُونَ'], 
   'فألف': [
          'فَأَلَّفَ'], 
   'وثاقه': [
           'وَثَاقَهُ'], 
   'دليلا': [
           'دَلِيلًا'], 
   'مسكونة': [
            'مَسْكُونَةٍ'], 
   'وجعل': [
          'وَجَعَلَ'], 
   'وقودها': [
            'وَقُودُهَا'], 
   'رفيع': [
          'رَفِيعُ'], 
   'أمانيهم': [
             'أَمَانِيُّهُمْ'], 
   'فعفونا': [
            'فَعَفَوْنَا'], 
   'أردناه': [
            'أَرَدْنَاهُ'], 
   'أثخنتموهم': [
               'أَثْخَنْتُمُوهُمْ'], 
   'تقدم': [
          'تَقَدَّمَ'], 
   'بنو': [
         'بَنُو'], 
   'أذنيه': [
           'أُذُنَيْهِ'], 
   'اهبط': [
          'اهْبِطْ'], 
   'لبعض': [
          'لِبَعْضٍ',
          'لِبَعْضِ'], 
   'الجنتين': [
             'الْجَنَّتَيْنِ'], 
   'بالساعة': [
             'بِالسَّاعَةِ'], 
   'فذبحوها': [
             'فَذَبَحُوهَا'], 
   'الأخسرين': [
              'الْأَخْسَرِينَ'], 
   'منشرة': [
           'مُنَشَّرَةً'], 
   'طوعا': [
          'طَوْعًا'], 
   'الألواح': [
             'الْأَلْوَاحَ',
             'الْأَلْوَاحِ'], 
   'وبلغنا': [
            'وَبَلَغْنَا'], 
   'أثري': [
          'أَثَرِي'], 
   'الرجع': [
           'الرَّجْعِ'], 
   'يؤفكون': [
            'يُؤْفَكُونَ'], 
   'أعنده': [
           'أَعِنْدَهُ'], 
   'الرجس': [
           'الرِّجْسَ'], 
   'الرجز': [
           'الرِّجْزَ',
           'الرِّجْزُ'], 
   'وجهركم': [
            'وَجَهْرَكُمْ'], 
   'الندامة': [
             'النَّدَامَةَ'], 
   'ويأتوكم': [
             'وَيَأْتُوكُمْ'], 
   'نعجز': [
          'نُعْجِزَ'], 
   'الغرفة': [
            'الْغُرْفَةَ'], 
   'ويؤتوا': [
            'وَيُؤْتُوا'], 
   'الأكمام': [
             'الْأَكْمَامِ'], 
   'يؤتيهم': [
            'يُؤْتِيَهُمُ',
            'يُؤْتِيهِمْ'], 
   'جسدا': [
          'جَسَدًا'], 
   'بصيرا': [
           'بَصِيرًا'], 
   'بقيت': [
          'بَقِيَّتُ'], 
   'ووجدوا': [
            'وَوَجَدُوا'], 
   'شراب': [
          'شَرَابٌ'], 
   'ليربو': [
           'لِيَرْبُوَ'], 
   'والوزن': [
            'وَالْوَزْنُ'], 
   'الطرف': [
           'الطَّرْفِ'], 
   'يأمن': [
          'يَأْمَنُ'], 
   'كنت': [
         'كُنْتَ',
         'كُنْتُ',
         'كُنْتِ'], 
   'قولكم': [
           'قَوْلُكُمْ',
           'قَوْلَكُمْ'], 
   'لبنا': [
          'لَبَنًا'], 
   'تركنا': [
           'تَرَكْنَا'], 
   'أئن': [
         'أَئِنْ',
         'أَئِنَّ'], 
   'وازدادوا': [
              'وَازْدَادُوا'], 
   'معيشة': [
           'مَعِيشَةً'], 
   'الأبرار': [
             'الْأَبْرَارَ',
             'الْأَبْرَارِ'], 
   'زوال': [
          'زَوَالٍ'], 
   'مبثوثة': [
            'مَبْثُوثَةٌ'], 
   'بليل': [
          'بِلَيْلٍ'], 
   'لعذبهم': [
            'لَعَذَّبَهُمْ'], 
   'أنسوكم': [
            'أَنْسَوْكُمْ'], 
   'فاسألوهن': [
              'فَاسْأَلُوهُنَّ'], 
   'فاسألوهم': [
              'فَاسْأَلُوهُمْ'], 
   'المشرقين': [
              'الْمَشْرِقَيْنِ'], 
   'أجورهن': [
            'أُجُورَهُنَّ'], 
   'أجورهم': [
            'أُجُورَهُمْ'], 
   'يأتيكما': [
             'يَأْتِيَكُمَا',
             'يَأْتِيكُمَا'], 
   'عاقر': [
          'عَاقِرٌ'], 
   'إماما': [
           'إِمَامًا'], 
   'بضارهم': [
            'بِضَارِّهِمْ'], 
   'يأتك': [
          'يَأْتِكَ'], 
   'يلفظ': [
          'يَلْفِظُ'], 
   'يأته': [
          'يَأْتِهِ'], 
   'حصرت': [
          'حَصِرَتْ'], 
   'الأحزاب': [
             'الْأَحْزَابِ',
             'الْأَحْزَابُ',
             'الْأَحْزَابَ'], 
   'يأتي': [
          'يَأْتِيَ',
          'يَأْتِي'], 
   'عاقب': [
          'عَاقَبَ'], 
   'ويلههم': [
            'وَيُلْهِهِمُ'], 
   'يأمر': [
          'يَأْمُرُ'], 
   'هدى': [
         'هُدًى',
         'هَدَى',
         'هُدَى'], 
   'لأملأن': [
            'لَأَمْلَأَنَّ'], 
   'الشمس': [
           'الشَّمْسَ',
           'الشَّمْسِ',
           'الشَّمْسُ'], 
   'الدعاء': [
            'الدُّعَاءَ',
            'الدُّعَاءِ'], 
   'ولتعلن': [
            'وَلَتَعْلُنَّ'], 
   'لبني': [
          'لِبَنِي'], 
   'ليهديهم': [
             'لِيَهْدِيَهُمْ'], 
   'متربة': [
           'مَتْرَبَةٍ'], 
   'بجهالة': [
            'بِجَهَالَةٍ'], 
   'أتهتدي': [
            'أَتَهْتَدِي'], 
   'أصولها': [
            'أُصُولِهَا'], 
   'بحرب': [
          'بِحَرْبٍ'], 
   'يلقون': [
           'يُلْقُونَ',
           'يَلْقَوْنَ'], 
   'أطاع': [
          'أَطَاعَ'], 
   'وعهدنا': [
            'وَعَهِدْنَا'], 
   'آلهة': [
          'آلِهَةً',
          'آلِهَةٌ'], 
   'صغار': [
          'صَغَارٌ'], 
   'اركض': [
          'ارْكُضْ'], 
   'سيروا': [
           'سِيرُوا'], 
   'وأهليكم': [
             'وَأَهْلِيكُمْ'], 
   'فزادتهم': [
             'فَزَادَتْهُمْ'], 
   'ذوي': [
         'ذَوِي',
         'ذَوَيْ'], 
   'فليأتكم': [
             'فَلْيَأْتِكُمْ'], 
   'وكلا': [
          'وَكُلًّا',
          'وَكُلَا'], 
   'الأذل': [
           'الْأَذَلَّ'], 
   'ونجني': [
           'وَنَجِّنِي'], 
   'بيوتهن': [
            'بُيُوتِهِنَّ'], 
   'ينطلق': [
           'يَنْطَلِقُ'], 
   'ونصفه': [
           'وَنِصْفَهُ'], 
   'أيمانكم': [
             'أَيْمَانُكُمْ',
             'أَيْمَانِكُمْ',
             'أَيْمَانَكُمْ'], 
   'البحرين': [
             'الْبَحْرَيْنِ'], 
   'ومعارج': [
            'وَمَعَارِجَ'], 
   'الوزن': [
           'الْوَزْنَ'], 
   'سنت': [
         'سُنَّتَ',
         'سُنَّتُ'], 
   'سنة': [
         'سَنَةٍ',
         'سُنَّةَ',
         'سُنَّةُ',
         'سَنَةً',
         'سِنَةٌ'], 
   'هيت': [
         'هَيْتَ'], 
   'يستمع': [
           'يَسْتَمِعُ',
           'يَسْتَمِعِ'], 
   'تنفذون': [
            'تَنْفُذُونَ'], 
   'ونكون': [
           'وَنَكُونَ'], 
   'الأنعام': [
             'الْأَنْعَامِ',
             'الْأَنْعَامُ',
             'الْأَنْعَامَ'], 
   'للناس': [
           'لِلنَّاسِ'], 
   'بالأمس': [
            'بِالْأَمْسِ'], 
   'وبالآخرة': [
              'وَبِالْآخِرَةِ'], 
   'ونبيا': [
           'وَنَبِيًّا'], 
   'نصحي': [
          'نُصْحِي'], 
   'اكشف': [
          'اكْشِفْ'], 
   'نجس': [
         'نَجَسٌ'], 
   'فاقتلوا': [
             'فَاقْتُلُوا'], 
   'ونجنا': [
           'وَنَجِّنَا'], 
   'ظالمين': [
            'ظَالِمِينَ'], 
   'نجب': [
         'نُجِبْ'], 
   'يأتينكم': [
             'يَأْتِيَنَّكُمْ'], 
   'تكتبوها': [
             'تَكْتُبُوهَا'], 
   'مذكورا': [
            'مَذْكُورًا'], 
   'للذين': [
           'لِلَّذِينَ',
           'لَلَّذِينَ'], 
   'نجد': [
         'نَجِدْ'], 
   'وتمت': [
          'وَتَمَّتْ'], 
   'أطيعوا': [
            'أَطِيعُوا'], 
   'وظلما': [
           'وَظُلْمًا'], 
   'تنفذوا': [
            'تَنْفُذُوا'], 
   'برزخا': [
           'بَرْزَخًا'], 
   'نجا': [
         'نَجَا'], 
   'تبوئ': [
          'تُبَوِّئُ'], 
   'والشجر': [
            'وَالشَّجَرُ'], 
   'محصنين': [
            'مُحْصِنِينَ'], 
   'الآلهة': [
            'الْآلِهَةَ'], 
   'نوحيها': [
            'نُوحِيهَا'], 
   'أدراك': [
           'أَدْرَاكَ'], 
   'وشمال': [
           'وَشِمَالٍ'], 
   'سحر': [
         'سِحْرٌ'], 
   'الخبء': [
           'الْخَبْءَ'], 
   'لأماناتهم': [
               'لِأَمَانَاتِهِمْ'], 
   'آتوا': [
          'آتَوْا'], 
   'أولياؤه': [
             'أَوْلِيَاؤُهُ'], 
   'خلفنا': [
           'خَلْفَنَا'], 
   'وتناجوا': [
             'وَتَنَاجَوْا'], 
   'أفواجا': [
            'أَفْوَاجًا'], 
   'وكلم': [
          'وَكَلَّمَ'], 
   'قديرا': [
           'قَدِيرًا'], 
   'وذكرهم': [
            'وَذَكِّرْهُمْ'], 
   'تبتغي': [
           'تَبْتَغِيَ',
           'تَبْتَغِي'], 
   'يفرقون': [
            'يُفَرِّقُونَ',
            'يَفْرَقُونَ'], 
   'وضياء': [
           'وَضِيَاءً'], 
   'الظنونا': [
             'الظُّنُونَا'], 
   'وظاهره': [
            'وَظَاهِرُهُ'], 
   'يحببكم': [
            'يُحْبِبْكُمُ'], 
   'فولوا': [
           'فَوَلُّوا'], 
   'المخاض': [
            'الْمَخَاضُ'], 
   'فحاسبناها': [
               'فَحَاسَبْنَاهَا'], 
   'ومماتهم': [
             'وَمَمَاتُهُمْ'], 
   'يئسوا': [
           'يَئِسُوا'], 
   'وقلوبهن': [
             'وَقُلُوبِهِنَّ'], 
   'علمتموهن': [
              'عَلِمْتُمُوهُنَّ'], 
   'الدمع': [
           'الدَّمْعِ'], 
   'ونسي': [
          'وَنَسِيَ'], 
   'يكلمه': [
           'يُكَلِّمَهُ'], 
   'الأعداء': [
             'الْأَعْدَاءَ'], 
   'تعلمون': [
            'تَعْلَمُونَ',
            'تُعَلِّمُونَ'], 
   'خائفا': [
           'خَائِفًا'], 
   'يؤمنوا': [
            'يُؤْمِنُوا'], 
   'فيصلب': [
           'فَيُصْلَبُ'], 
   'عزة': [
         'عِزَّةٍ'], 
   'ويعفو': [
           'وَيَعْفُو'], 
   'البينة': [
            'الْبَيِّنَةُ'], 
   'تحويلا': [
            'تَحْوِيلًا'], 
   'فمثله': [
           'فَمَثَلُهُ'], 
   'عقيم': [
          'عَقِيمٍ',
          'عَقِيمٌ'], 
   'إلهه': [
          'إِلَهَهُ'], 
   'بأحسن': [
           'بِأَحْسَنِ',
           'بِأَحْسَنَ'], 
   'الأحبار': [
             'الْأَحْبَارِ'], 
   'تلبسونها': [
              'تَلْبَسُونَهَا'], 
   'ينازعنك': [
             'يُنَازِعُنَّكَ'], 
   'تعلموا': [
            'تَعْلَمُوا'], 
   'ولدنهم': [
            'وَلَدْنَهُمْ'], 
   'يقومان': [
            'يَقُومَانِ'], 
   'الفاسقين': [
              'الْفَاسِقِينَ'], 
   'يفرقوا': [
            'يُفَرِّقُوا'], 
   'ونبلو': [
           'وَنَبْلُوَ'], 
   'يزغ': [
         'يَزِغْ'], 
   'تربص': [
          'تَرَبُّصُ'], 
   'سجيل': [
          'سِجِّيلٍ'], 
   'مضيا': [
          'مُضِيًّا'], 
   'تابوا': [
           'تَابُوا'], 
   'الحشر': [
           'الْحَشْرِ'], 
   'فاتخذ': [
           'فَاتَّخَذَ'], 
   'لتبيننه': [
             'لَتُبَيِّنُنَّهُ'], 
   'لأستغفرن': [
              'لَأَسْتَغْفِرَنَّ'], 
   'يعجل': [
          'يُعَجِّلُ'], 
   'ويتخطف': [
            'وَيُتَخَطَّفُ'], 
   'ناضرة': [
           'نَاضِرَةٌ'], 
   'وعلينا': [
            'وَعَلَيْنَا'], 
   'وأبصارهم': [
              'وَأَبْصَارِهِمْ',
              'وَأَبْصَارُهُمْ',
              'وَأَبْصَارَهُمْ'], 
   'أتأمرون': [
             'أَتَأْمُرُونَ'], 
   'وجدتم': [
           'وَجَدْتُمْ'], 
   'مرسل': [
          'مُرْسِلَ',
          'مُرْسَلٌ'], 
   'فاعلموا': [
             'فَاعْلَمُوا'], 
   'فرقناه': [
            'فَرَقْنَاهُ'], 
   'فوهب': [
          'فَوَهَبَ'], 
   'ودع': [
         'وَدَعْ'], 
   'ناظرة': [
           'نَاظِرَةٌ'], 
   'لبيوتهم': [
             'لِبُيُوتِهِمْ'], 
   'وعدتنا': [
            'وَعَدْتَنَا'], 
   'ليكونوا': [
             'لِيَكُونُوا'], 
   'تبعوا': [
           'تَبِعُوا'], 
   'يستثنون': [
             'يَسْتَثْنُونَ'], 
   'وأحلت': [
           'وَأُحِلَّتْ'], 
   'للأذقان': [
             'لِلْأَذْقَانِ'], 
   'وكذلك': [
           'وَكَذَلِكَ'], 
   'مشيك': [
          'مَشْيِكَ'], 
   'فاحترقت': [
             'فَاحْتَرَقَتْ'], 
   'ساهون': [
           'سَاهُونَ'], 
   'فغفرنا': [
            'فَغَفَرْنَا'], 
   'وجهرا': [
           'وَجَهْرًا'], 
   'الفصل': [
           'الْفَصْلِ'], 
   'لتحسبوه': [
             'لِتَحْسَبُوهُ'], 
   'غواش': [
          'غَوَاشٍ'], 
   'تغني': [
          'تُغْنِيَ',
          'تُغْنِي'], 
   'قادر': [
          'قَادِرٌ'], 
   'ليبتليكم': [
              'لِيَبْتَلِيَكُمْ'], 
   'تغفلون': [
            'تَغْفُلُونَ'], 
   'ثواب': [
          'ثَوَابَ',
          'ثَوَابُ',
          'ثَوَابِ'], 
   'والنبيون': [
              'وَالنَّبِيُّونَ'], 
   'المنكر': [
            'الْمُنْكَرِ',
            'الْمُنْكَرَ'], 
   'أتحاجوننا': [
               'أَتُحَاجُّونَنَا'], 
   'البصير': [
            'الْبَصِيرُ'], 
   'ودم': [
         'وَدَمٍ'], 
   'تأس': [
         'تَأْسَ'], 
   'لناكبون': [
             'لَنَاكِبُونَ'], 
   'ينقلبون': [
             'يَنْقَلِبُونَ'], 
   'اكتسب': [
           'اكْتَسَبَ'], 
   'صرعى': [
          'صَرْعَى'], 
   'ملئت': [
          'مُلِئَتْ'], 
   'المتكلفين': [
               'الْمُتَكَلِّفِينَ'], 
   'لندخلنهم': [
              'لَنُدْخِلَنَّهُمْ'], 
   'وألسنتهم': [
              'وَأَلْسِنَتَهُمْ'], 
   'لأعذبنه': [
             'لَأُعَذِّبَنَّهُ'], 
   'صددناكم': [
             'صَدَدْنَاكُمْ'], 
   'نقاتل': [
           'نُقَاتِلْ',
           'نُقَاتِلَ'], 
   'الزقوم': [
            'الزَّقُّومِ'], 
   'المهتدين': [
              'الْمُهْتَدِينَ'], 
   'والمصدقات': [
               'وَالْمُصَّدِّقَاتِ'], 
   'وليي': [
          'وَلِيِّيَ',
          'وَلِيِّي'], 
   'قانتون': [
            'قَانِتُونَ'], 
   'وخذوا': [
           'وَخُذُوا'], 
   'وليه': [
          'وَلِيُّهُ'], 
   'قاتلكم': [
            'قَاتَلَكُمُ'], 
   'يستمعون': [
             'يَسْتَمِعُونَ'], 
   'ليثبت': [
           'لِيُثَبِّتَ'], 
   'وصهرا': [
           'وَصِهْرًا'], 
   'لونها': [
           'لَوْنُهَا'], 
   'فقدرنا': [
            'فَقَدَرْنَا'], 
   'فأخلفتكم': [
              'فَأَخْلَفْتُكُمْ'], 
   'استكبروا': [
              'اسْتَكْبَرُوا'], 
   'فجعلهم': [
            'فَجَعَلَهُمْ'], 
   'واستمع': [
            'وَاسْتَمِعْ'], 
   'أمهاتهم': [
             'أُمَّهَاتُهُمْ',
             'أُمَّهَاتِهِمْ'], 
   'فدكتا': [
           'فَدُكَّتَا'], 
   'الغرفات': [
             'الْغُرُفَاتِ'], 
   'طسم': [
         'طسم'], 
   'يصيبنا': [
            'يُصِيبَنَا'], 
   'واطمأنوا': [
              'وَاطْمَأَنُّوا'], 
   'فتنفخ': [
           'فَتَنْفُخُ'], 
   'استخرجها': [
              'اسْتَخْرَجَهَا'], 
   'وقيل': [
          'وَقِيلَ'], 
   'وإبراهيم': [
              'وَإِبْرَاهِيمَ'], 
   'أفإن': [
          'أَفَإِنْ'], 
   'بوجهه': [
           'بِوَجْهِهِ'], 
   'تمور': [
          'تَمُورُ'], 
   'رآها': [
          'رَآهَا'], 
   'تحسبها': [
            'تَحْسَبُهَا'], 
   'جاهد': [
          'جَاهِدِ',
          'جَاهَدَ'], 
   'تخشوهم': [
            'تَخْشَوْهُمْ'], 
   'فقلت': [
          'فَقُلْتُ'], 
   'الحكمة': [
            'الْحِكْمَةَ',
            'الْحِكْمَةِ'], 
   'يعيدوكم': [
             'يُعِيدُوكُمْ'], 
   'أرسلنا': [
            'أَرْسَلْنَا',
            'أُرْسِلْنَا'], 
   'سبلنا': [
           'سُبُلَنَا'], 
   'إخراجهم': [
             'إِخْرَاجُهُمْ'], 
   'وليس': [
          'وَلَيْسَ'], 
   'قفينا': [
           'قَفَّيْنَا'], 
   'لتفتري': [
            'لِتَفْتَرِيَ'], 
   'عهدنا': [
           'عَهِدْنَا'], 
   'وليا': [
          'وَلِيًّا'], 
   'نجيناهم': [
             'نَجَّيْنَاهُمْ'], 
   'ربيون': [
           'رِبِّيُّونَ'], 
   'وأكيد': [
           'وَأَكِيدُ'], 
   'حملهن': [
           'حَمْلَهُنَّ'], 
   'يديها': [
           'يَدَيْهَا'], 
   'أصلها': [
           'أَصْلُهَا'], 
   'وزلزلوا': [
             'وَزُلْزِلُوا'], 
   'بأمر': [
          'بِأَمْرِ'], 
   'ويستبدل': [
             'وَيَسْتَبْدِلْ'], 
   'سماوات': [
            'سَمَاوَاتٍ'], 
   'محصنة': [
           'مُحَصَّنَةٍ'], 
   'تصف': [
         'تَصِفُ'], 
   'أتعبدون': [
             'أَتَعْبُدُونَ'], 
   'فجعل': [
          'فَجَعَلَ'], 
   'جادلتنا': [
             'جَادَلْتَنَا'], 
   'قطرا': [
          'قِطْرًا'], 
   'ختار': [
          'خَتَّارٍ'], 
   'عباد': [
          'عِبَادَ',
          'عِبَادِ',
          'عِبَادُ',
          'عِبَادٌ'], 
   'فيعلمون': [
             'فَيَعْلَمُونَ'], 
   'أيحسبون': [
             'أَيَحْسَبُونَ'], 
   'ويرحم': [
           'وَيَرْحَمُ'], 
   'يزنون': [
           'يَزْنُونَ'], 
   'جامدة': [
           'جَامِدَةً'], 
   'فقد': [
         'فَقَدْ',
         'فَقَدِ'], 
   'ليفسدوا': [
             'لِيُفْسِدُوا'], 
   'الصم': [
          'الصُّمَّ',
          'الصُّمُّ'], 
   'سيئه': [
          'سَيِّئُهُ'], 
   'لعادوا': [
            'لَعَادُوا'], 
   'ولات': [
          'وَلَاتَ'], 
   'يستسخرون': [
              'يَسْتَسْخِرُونَ'], 
   'الحطب': [
           'الْحَطَبِ'], 
   'وتفقد': [
           'وَتَفَقَّدَ'], 
   'بطنه': [
          'بَطْنِهِ'], 
   'فقل': [
         'فَقُلْ',
         'فَقُلِ'], 
   'وبالأسحار': [
               'وَبِالْأَسْحَارِ'], 
   'يتأخر': [
           'يَتَأَخَّرَ'], 
   'مساس': [
          'مِسَاسَ'], 
   'فتم': [
         'فَتَمَّ'], 
   'نبئنا': [
           'نَبِّئْنَا'], 
   'حجاب': [
          'حِجَابٍ',
          'حِجَابٌ'], 
   'يجير': [
          'يُجِيرُ'], 
   'مستقبل': [
            'مُسْتَقْبِلَ'], 
   'وأوجس': [
           'وَأَوْجَسَ'], 
   'رهطك': [
          'رَهْطُكَ'], 
   'أشركتم': [
            'أَشْرَكْتُمْ'], 
   'ورضي': [
          'وَرَضِيَ'], 
   'بعضها': [
           'بَعْضُهَا',
           'بَعْضَهَا'], 
   'سركم': [
          'سِرَّكُمْ'], 
   'ملائكة': [
            'مَلَائِكَةً',
            'مَلَائِكَةٌ'], 
   'يجيب': [
          'يُجِيبُ'], 
   'مجمع': [
          'مَجْمَعَ'], 
   'يحيق': [
          'يَحِيقُ'], 
   'والفجر': [
            'وَالْفَجْرِ'], 
   'أفسدوها': [
             'أَفْسَدُوهَا'], 
   'وإذ': [
         'وَإِذْ',
         'وَإِذِ'], 
   'المهتد': [
            'الْمُهْتَدِ'], 
   'يفعلوا': [
            'يَفْعَلُوا'], 
   'والشجرة': [
             'وَالشَّجَرَةَ'], 
   'تدعونه': [
            'تَدْعُونَهُ'], 
   'وكذب': [
          'وَكَذَّبَ',
          'وَكُذِّبَ'], 
   'رفرف': [
          'رَفْرَفٍ'], 
   'والزكاة': [
             'وَالزَّكَاةِ'], 
   'متعنا': [
           'مَتَّعْنَا'], 
   'فعززنا': [
            'فَعَزَّزْنَا'], 
   'فسقوا': [
           'فَسَقُوا'], 
   'وأشربوا': [
             'وَأُشْرِبُوا'], 
   'وشاهد': [
           'وَشَاهِدٍ'], 
   'الصرح': [
           'الصَّرْحَ'], 
   'أطاعونا': [
             'أَطَاعُونَا'], 
   'الصافنات': [
              'الصَّافِنَاتُ'], 
   'حجارة': [
           'حِجَارَةً'], 
   'ظمأ': [
         'ظَمَأٌ'], 
   'وأمرت': [
           'وَأُمِرْتُ'], 
   'جارية': [
           'جَارِيَةٌ'], 
   'نورهم': [
           'نُورُهُمْ'], 
   'وكتاب': [
           'وَكِتَابٍ',
           'وَكِتَابٌ'], 
   'قمطريرا': [
             'قَمْطَرِيرًا'], 
   'فليس': [
          'فَلَيْسَ'], 
   'منامكم': [
            'مَنَامُكُمْ'], 
   'يؤذون': [
           'يُؤْذُونَ'], 
   'بعهدكم': [
            'بِعَهْدِكُمْ'], 
   'سواك': [
          'سَوَّاكَ'], 
   'الجمعان': [
             'الْجَمْعَانِ'], 
   'سواه': [
          'سَوَّاهُ'], 
   'ملجأ': [
          'مَلْجَأَ',
          'مَلْجَأً'], 
   'وأمره': [
           'وَأَمْرُهُ'], 
   'ملجإ': [
          'مَلْجَإٍ'], 
   'يغلبوا': [
            'يَغْلِبُوا'], 
   'فالسابقات': [
               'فَالسَّابِقَاتِ'], 
   'وكبراءنا': [
              'وَكُبَرَاءَنَا'], 
   'وتفصيل': [
            'وَتَفْصِيلَ'], 
   'والأغلال': [
              'وَالْأَغْلَالَ'], 
   'وبئس': [
          'وَبِئْسَ'], 
   'وبئر': [
          'وَبِئْرٍ'], 
   'سواء': [
          'سَوَاءٌ',
          'سَوَاءِ',
          'سَوَاءً',
          'سَوَاءَ',
          'سَوَاءٍ'], 
   'بولدها': [
            'بِوَلَدِهَا'], 
   'أتحاجوني': [
              'أَتُحَاجُّونِّي'], 
   'فئتكم': [
           'فِئَتُكُمْ'], 
   'بنيان': [
           'بُنْيَانٌ'], 
   'ويومئذ': [
            'وَيَوْمَئِذٍ'], 
   'اعتراك': [
            'اعْتَرَاكَ'], 
   'تدعونا': [
            'تَدْعُونَا'], 
   'لذكر': [
          'لِذِكْرِ',
          'لَذِكْرٌ'], 
   'قسورة': [
           'قَسْوَرَةٍ'], 
   'ذريته': [
           'ذُرِّيَّتِهِ',
           'ذُرِّيَّتَهُ'], 
   'وإن': [
         'وَإِنْ',
         'وَإِنَّ',
         'وَإِنِ'], 
   'ذريتنا': [
            'ذُرِّيَّتِنَا'], 
   'منقوص': [
           'مَنْقُوصٍ'], 
   'فكثركم': [
            'فَكَثَّرَكُمْ'], 
   'ذريتي': [
           'ذُرِّيَّتِي'], 
   'لبثتم': [
           'لَبِثْتُمْ'], 
   'مولاه': [
           'مَوْلَاهُ'], 
   'بدل': [
         'بَدَّلَ'], 
   'بدم': [
         'بِدَمٍ'], 
   'قدروها': [
            'قَدَّرُوهَا'], 
   'ملكا': [
          'مَلَكًا',
          'مُلْكًا',
          'مَلِكًا'], 
   'لقلنا': [
           'لَقُلْنَا'], 
   'ملكت': [
          'مَلَكَتْ'], 
   'يشترون': [
            'يَشْتَرُونَ'], 
   'يستجيب': [
            'يَسْتَجِيبُ'], 
   'يقاتل': [
           'يُقَاتِلْ'], 
   'تفسيرا': [
            'تَفْسِيرًا'], 
   'تقتلوا': [
            'تَقْتُلُوا'], 
   'واستكبرتم': [
               'وَاسْتَكْبَرْتُمْ'], 
   'الرشاد': [
            'الرَّشَادِ'], 
   'أتأتون': [
            'أَتَأْتُونَ'], 
   'واللائي': [
             'وَاللَّائِي'], 
   'منتهاها': [
             'مُنْتَهَاهَا'], 
   'هدنا': [
          'هُدْنَا'], 
   'فتنقلبوا': [
              'فَتَنْقَلِبُوا'], 
   'لنهتدي': [
            'لِنَهْتَدِيَ'], 
   'تردون': [
           'تُرَدُّونَ'], 
   'تسجدوا': [
            'تَسْجُدُوا'], 
   'إيمانكم': [
             'إِيمَانِكُمْ',
             'إِيمَانُكُمْ',
             'إِيمَانَكُمْ'], 
   'محسورا': [
            'مَحْسُورًا'], 
   'أتقاكم': [
            'أَتْقَاكُمْ'], 
   'فارتقب': [
            'فَارْتَقِبْ'], 
   'صراطا': [
           'صِرَاطًا'], 
   'أنهما': [
           'أَنَّهُمَا'], 
   'خطف': [
         'خَطِفَ'], 
   'الحر': [
          'الْحُرُّ',
          'الْحَرِّ',
          'الْحَرَّ'], 
   'عابدون': [
            'عَابِدُونَ'], 
   'خاسرة': [
           'خَاسِرَةٌ'], 
   'داركم': [
           'دَارِكُمْ'], 
   'وسمعهم': [
            'وَسَمْعِهِمْ'], 
   'غالبون': [
            'غَالِبُونَ'], 
   'ببابل': [
           'بِبَابِلَ'], 
   'مانعتهم': [
             'مَانِعَتُهُمْ'], 
   'وأخرجنا': [
             'وَأَخْرَجْنَا'], 
   'بأكواب': [
            'بِأَكْوَابٍ'], 
   'أضلونا': [
            'أَضَلُّونَا'], 
   'وحملناه': [
             'وَحَمَلْنَاهُ'], 
   'بآلهتنا': [
             'بِآلِهَتِنَا'], 
   'حولين': [
           'حَوْلَيْنِ'], 
   'أخلفنا': [
            'أَخْلَفْنَا'], 
   'عضين': [
          'عِضِينَ'], 
   'صراطك': [
           'صِرَاطَكَ'], 
   'خطأ': [
         'خَطَأً'], 
   'أنصاري': [
            'أَنْصَارِي'], 
   'وقلن': [
          'وَقُلْنَ'], 
   'صراطي': [
           'صِرَاطِي'], 
   'رابيا': [
           'رَابِيًا'], 
   'بدا': [
         'بَدَا'], 
   'ملكه': [
          'مُلْكَهُ',
          'مُلْكِهِ'], 
   'اشترى': [
           'اشْتَرَى'], 
   'السماوات': [
              'السَّمَاوَاتِ',
              'السَّمَاوَاتُ'], 
   'وتأكلون': [
             'وَتَأْكُلُونَ'], 
   'يمدكم': [
           'يُمِدَّكُمْ'], 
   'وصرفنا': [
            'وَصَرَّفْنَا'], 
   'المسومة': [
             'الْمُسَوَّمَةِ'], 
   'وجعلت': [
           'وَجَعَلْتُ'], 
   'يبلغون': [
            'يُبَلِّغُونَ'], 
   'دخان': [
          'دُخَانٌ'], 
   'يدعونني': [
             'يَدْعُونَنِي'], 
   'تقتلون': [
            'تَقْتُلُونَ'], 
   'ليخرجن': [
            'لَيُخْرِجَنَّ',
            'لَيَخْرُجُنَّ'], 
   'رحله': [
          'رَحْلِهِ'], 
   'بطرت': [
          'بَطِرَتْ'], 
   'ولنجزين': [
             'وَلَنَجْزِيَنَّ'], 
   'أرجلهم': [
            'أَرْجُلِهِمْ',
            'أَرْجُلُهُمْ'], 
   'يبعثكم': [
            'يَبْعَثُكُمْ'], 
   'أرجائها': [
             'أَرْجَائِهَا'], 
   'وتحشرون': [
             'وَتُحْشَرُونَ'], 
   'توكيدها': [
             'تَوْكِيدِهَا'], 
   'كاملين': [
            'كَامِلَيْنِ'], 
   'ورسله': [
           'وَرُسُلِهِ',
           'وَرُسُلَهُ'], 
   'وربت': [
          'وَرَبَتْ'], 
   'الولدان': [
             'الْوِلْدَانِ',
             'الْوِلْدَانَ'], 
   'ورسلي': [
           'وَرُسُلِي'], 
   'هدان': [
          'هَدَانِ'], 
   'أتتخذ': [
           'أَتَتَّخِذُ'], 
   'شجر': [
         'شَجَرَ',
         'شَجَرٍ',
         'شَجَرٌ'], 
   'كدت': [
         'كِدْتَ'], 
   'نطفة': [
          'نُطْفَةٍ',
          'نُطْفَةً'], 
   'بعدها': [
           'بَعْدِهَا',
           'بَعْدَهَا'], 
   'وتكلمنا': [
             'وَتُكَلِّمُنَا'], 
   'لساحر': [
           'لَسَاحِرٌ'], 
   'فلا': [
         'فَلَا'], 
   'وعمل': [
          'وَعَمِلَ'], 
   'والخاشعات': [
               'وَالْخَاشِعَاتِ'], 
   'موهن': [
          'مُوهِنُ'], 
   'تبروهم': [
            'تَبَرُّوهُمْ'], 
   'وطائفة': [
            'وَطَائِفَةٌ'], 
   'سابقون': [
            'سَابِقُونَ'], 
   'لتشرك': [
           'لِتُشْرِكَ'], 
   'اصطفاك': [
            'اصْطَفَاكِ'], 
   'فانصرنا': [
             'فَانْصُرْنَا'], 
   'تصبروا': [
            'تَصْبِرُوا'], 
   'الأموال': [
             'الْأَمْوَالِ'], 
   'الأقصى': [
            'الْأَقْصَى'], 
   'والصاحب': [
             'وَالصَّاحِبِ'], 
   'بعدهم': [
           'بَعْدِهِمْ'], 
   'بعدهن': [
           'بَعْدَهُنَّ'], 
   'حرصتم': [
           'حَرَصْتُمْ'], 
   'قنطارا': [
            'قِنْطَارًا'], 
   'وفدا': [
          'وَفْدًا'], 
   'ينصره': [
           'يَنْصُرُهُ',
           'يَنْصُرَهُ'], 
   'فله': [
         'فَلَهُ'], 
   'فلم': [
         'فَلَمْ',
         'فَلِمَ'], 
   'فلك': [
         'فَلَكٍ'], 
   'المكرمين': [
              'الْمُكْرَمِينَ'], 
   'بأموالكم': [
              'بِأَمْوَالِكُمْ'], 
   'صلاته': [
           'صَلَاتَهُ'], 
   'سابقوا': [
            'سَابِقُوا'], 
   'فلو': [
         'فَلَوْ'], 
   'للزكاة': [
            'لِلزَّكَاةِ'], 
   'كالوهم': [
            'كَالُوهُمْ'], 
   'يخشى': [
          'يَخْشَى'], 
   'اسكنوا': [
            'اسْكُنُوا'], 
   'هضما': [
          'هَضْمًا'], 
   'ولحم': [
          'وَلَحْمَ',
          'وَلَحْمِ',
          'وَلَحْمُ',
          'وَلَحْمٍ'], 
   'ونزعنا': [
            'وَنَزَعْنَا'], 
   'بآخذيه': [
            'بِآخِذِيهِ'], 
   'ولينذروا': [
              'وَلِيُنْذِرُوا',
              'وَلِيُنْذَرُوا'], 
   'أذقنا': [
           'أَذَقْنَا'], 
   'ورسلا': [
           'وَرُسُلًا'], 
   'وربي': [
          'وَرَبِّي'], 
   'بأن': [
         'بِأَنَّ',
         'بِأَنْ'], 
   'يأخذ': [
          'يَأْخُذُ'], 
   'وديارهم': [
             'وَدِيَارَهُمْ'], 
   'وربك': [
          'وَرَبُّكَ',
          'وَرَبِّكَ',
          'وَرَبَّكَ'], 
   'لتسحرنا': [
             'لِتَسْحَرَنَا'], 
   'حوبا': [
          'حُوبًا'], 
   'مستمعهم': [
             'مُسْتَمِعُهُمْ'], 
   'ربا': [
         'رِبًا',
         'رَبًّا'], 
   'يقنط': [
          'يَقْنَطُ'], 
   'الخصم': [
           'الْخَصْمِ'], 
   'قاعدون': [
            'قَاعِدُونَ'], 
   'تخلف': [
          'تُخْلِفُ'], 
   'وأشعارها': [
              'وَأَشْعَارِهَا'], 
   'والخوف': [
            'وَالْخَوْفِ'], 
   'دعاء': [
          'دُعَاءِ',
          'دُعَاءُ',
          'دُعَاءَ',
          'دُعَاءٍ',
          'دُعَاءً'], 
   'ونساءكم': [
             'وَنِسَاءَكُمْ'], 
   'لهوا': [
          'لَهْوًا'], 
   'أبناءكم': [
             'أَبْنَاءَكُمْ'], 
   'آمنة': [
          'آمِنَةً'], 
   'يردك': [
          'يُرِدْكَ'], 
   'عنها': [
          'عَنْهَا'], 
   'يردن': [
          'يُرِدْنِ'], 
   'وزيرا': [
           'وَزِيرًا'], 
   'فخراج': [
           'فَخَرَاجُ'], 
   'جما': [
         'جَمًّا'], 
   'مسحا': [
          'مَسْحًا'], 
   'ينادي': [
           'يُنَادِي'], 
   'فادعوه': [
            'فَادْعُوهُ'], 
   'الدرجات': [
             'الدَّرَجَاتِ',
             'الدَّرَجَاتُ'], 
   'تولون': [
           'تُوَلُّونَ'], 
   'آمنا': [
          'آمَنَّا',
          'آمِنًا'], 
   'تعمل': [
          'تَعْمَلُ'], 
   'أجلهن': [
           'أَجَلَهُنَّ',
           'أَجَلُهُنَّ'], 
   'أجلهم': [
           'أَجَلُهُمْ'], 
   'يقسم': [
          'يُقْسِمُ'], 
   'نصف': [
         'نِصْفُ'], 
   'كفره': [
          'كُفْرُهُ'], 
   'جمع': [
         'جَمَعَ'], 
   'ليقيموا': [
             'لِيُقِيمُوا'], 
   'تعمى': [
          'تَعْمَى'], 
   'استطعت': [
            'اسْتَطَعْتَ',
            'اسْتَطَعْتُ'], 
   'عنهم': [
          'عَنْهُمْ',
          'عَنْهُمُ'], 
   'وأصفاكم': [
             'وَأَصْفَاكُمْ'], 
   'والعدوان': [
              'وَالْعُدْوَانِ'], 
   'الأشهر': [
            'الْأَشْهُرُ'], 
   'نصر': [
         'نَصْرُ',
         'نَصْرَ',
         'نَصْرٌ'], 
   'أيتها': [
           'أَيَّتُهَا'], 
   'ذرأكم': [
           'ذَرَأَكُمْ'], 
   'تطمئن': [
           'تَطْمَئِنُّ'], 
   'تولوا': [
           'تَوَلَّوْا',
           'تُوَلُّوا'], 
   'رزقنا': [
           'رُزِقْنَا'], 
   'جو': [
        'جَوِّ'], 
   'أجلها': [
           'أَجَلَهَا',
           'أَجَلُهَا'], 
   'سبعة': [
          'سَبْعَةُ',
          'سَبْعَةٌ'], 
   'جن': [
        'جَنَّ'], 
   'كفرت': [
          'كَفَرْتُ'], 
   'كفرا': [
          'كُفْرًا'], 
   'سبعا': [
          'سَبْعًا'], 
   'نصب': [
         'نَصَبٌ',
         'نُصُبٍ'], 
   'لقولهم': [
            'لِقَوْلِهِمْ'], 
   'شركائكم': [
             'شُرَكَائِكُمْ'], 
   'ووعدتكم': [
             'وَوَعَدْتُكُمْ'], 
   'الصلوات': [
             'الصَّلَوَاتِ'], 
   'فيدهنون': [
             'فَيُدْهِنُونَ'], 
   'للحرب': [
           'لِلْحَرْبِ'], 
   'وتعمل': [
           'وَتَعْمَلْ'], 
   'رأسي': [
          'رَأْسِي'], 
   'تكسبون': [
            'تَكْسِبُونَ'], 
   'يصرفون': [
            'يُصْرَفُونَ'], 
   'دعاه': [
          'دَعَاهُ'], 
   'دعان': [
          'دَعَانِ'], 
   'سيئا': [
          'سَيِّئًا'], 
   'فيشفعوا': [
             'فَيَشْفَعُوا'], 
   'دعوتكم': [
            'دَعَوْتُكُمْ'], 
   'يبغون': [
           'يَبْغُونَ'], 
   'عرضة': [
          'عُرْضَةً'], 
   'تنالوا': [
            'تَنَالُوا'], 
   'الجبال': [
            'الْجِبَالُ',
            'الْجِبَالِ',
            'الْجِبَالَ'], 
   'عرضا': [
          'عَرْضًا',
          'عَرَضًا'], 
   'تنازعوا': [
             'تَنَازَعُوا'], 
   'تقلبهم': [
            'تَقَلُّبِهِمْ',
            'تَقَلُّبُهُمْ'], 
   'ويتعد': [
           'وَيَتَعَدَّ'], 
   'تمتعون': [
            'تُمَتَّعُونَ'], 
   'تعتدوا': [
            'تَعْتَدُوا'], 
   'التراقي': [
             'التَّرَاقِيَ'], 
   'ليس': [
         'لَيْسَ'], 
   'مثقلون': [
            'مُثْقَلُونَ'], 
   'قولهم': [
           'قَوْلُهُمْ',
           'قَوْلِهِمْ',
           'قَوْلِهِمُ',
           'قَوْلَهُمْ'], 
   'مصانع': [
           'مَصَانِعَ'], 
   'ولوالديك': [
              'وَلِوَالِدَيْكَ'], 
   'يتوفونهم': [
              'يَتَوَفَّوْنَهُمْ'], 
   'والزرع': [
            'وَالزَّرْعَ'], 
   'فانكحوهن': [
              'فَانْكِحُوهُنَّ'], 
   'عبوسا': [
           'عَبُوسًا'], 
   'زحفا': [
          'زَحْفًا'], 
   'تصير': [
          'تَصِيرُ'], 
   'ورئيا': [
           'وَرِئْيًا'], 
   'يكتم': [
          'يَكْتُمُ'], 
   'الشتاء': [
            'الشِّتَاءِ'], 
   'سكنا': [
          'سَكَنًا'], 
   'تصبحون': [
            'تُصْبِحُونَ'], 
   'جئناهم': [
            'جِئْنَاهُمْ'], 
   'ممسك': [
          'مُمْسِكَ'], 
   'دعواهم': [
            'دَعْوَاهُمْ'], 
   'ممنوعة': [
            'مَمْنُوعَةٍ'], 
   'قولها': [
           'قَوْلِهَا'], 
   'الغالبين': [
              'الْغَالِبِينَ'], 
   'ننشزها': [
            'نُنْشِزُهَا'], 
   'أجوركم': [
            'أُجُورَكُمْ'], 
   'شقوا': [
          'شَقُوا'], 
   'وفاكهة': [
            'وَفَاكِهَةٍ',
            'وَفَاكِهَةً'], 
   'يكتب': [
          'يَكْتُبُ',
          'يَكْتُبَ'], 
   'الشح': [
          'الشُّحَّ'], 
   'سأرهقه': [
            'سَأُرْهِقُهُ'], 
   'جادلتم': [
            'جَادَلْتُمْ'], 
   'استنصره': [
             'اسْتَنْصَرَهُ'], 
   'يأتيك': [
           'يَأْتِيَكَ'], 
   'ولسليمان': [
              'وَلِسُلَيْمَانَ'], 
   'الخالدون': [
              'الْخَالِدُونَ'], 
   'فيكشف': [
           'فَيَكْشِفُ'], 
   'تمتعوا': [
            'تَمَتَّعُوا'], 
   'نبتهل': [
           'نَبْتَهِلْ'], 
   'نعمره': [
           'نُعَمِّرْهُ'], 
   'لعلكم': [
           'لَعَلَّكُمْ'], 
   'وباطل': [
           'وَبَاطِلٌ'], 
   'زلزالها': [
             'زِلْزَالَهَا'], 
   'وليستعفف': [
              'وَلْيَسْتَعْفِفِ'], 
   'واتبع': [
           'وَاتَّبَعَ',
           'وَاتَّبِعْ'], 
   'يتعارفون': [
              'يَتَعَارَفُونَ'], 
   'اركعوا': [
            'ارْكَعُوا'], 
   'مشربهم': [
            'مَشْرَبَهُمْ'], 
   'تحسبوه': [
            'تَحْسَبُوهُ'], 
   'ليدحضوا': [
             'لِيُدْحِضُوا'], 
   'والسراء': [
             'وَالسَّرَّاءُ'], 
   'ارجعي': [
           'ارْجِعِي'], 
   'بنعمة': [
           'بِنِعْمَةِ',
           'بِنِعْمَةٍ'], 
   'يذهبكم': [
            'يُذْهِبْكُمْ'], 
   'بنعمت': [
           'بِنِعْمَتِ'], 
   'رضيا': [
          'رَضِيًّا'], 
   'لنرجمنكم': [
              'لَنَرْجُمَنَّكُمْ'], 
   'ذكركم': [
           'ذِكْرُكُمْ'], 
   'أفأمنوا': [
             'أَفَأَمِنُوا'], 
   'أتأخذونه': [
              'أَتَأْخُذُونَهُ'], 
   'غضبان': [
           'غَضْبَانَ'], 
   'تظن': [
         'تَظُنُّ'], 
   'يرضعن': [
           'يُرْضِعْنَ'], 
   'لتركبوا': [
             'لِتَرْكَبُوا'], 
   'يتفجر': [
           'يَتَفَجَّرُ'], 
   'أمدا': [
          'أَمَدًا'], 
   'للرجال': [
            'لِلرِّجَالِ'], 
   'مرتان': [
           'مَرَّتَانِ'], 
   'وعدوا': [
           'وَعَدْوًا'], 
   'شيخا': [
          'شَيْخًا'], 
   'يغضضن': [
           'يَغْضُضْنَ'], 
   'صالح': [
          'صَالِحُ',
          'صَالِحٍ',
          'صَالِحٌ'], 
   'الغافرين': [
              'الْغَافِرِينَ'], 
   'عدوا': [
          'عَدُوًّا',
          'عَدْوًا'], 
   'غرابا': [
           'غُرَابًا'], 
   'مختالا': [
            'مُخْتَالًا'], 
   'البروج': [
            'الْبُرُوجِ'], 
   'لحياتي': [
            'لِحَيَاتِي'], 
   'ساكنا': [
           'سَاكِنًا'], 
   'البسط': [
           'الْبَسْطِ'], 
   'زمرا': [
          'زُمَرًا'], 
   'أذاقهم': [
            'أَذَاقَهُمْ'], 
   'وابن': [
          'وَابْنِ',
          'وَابْنَ'], 
   'وحصل': [
          'وَحُصِّلَ'], 
   'وابل': [
          'وَابِلٌ'], 
   'مصفى': [
          'مُصَفًّى'], 
   'عدوي': [
          'عَدُوِّي'], 
   'وزنوهم': [
            'وَزَنُوهُمْ'], 
   'وعدوه': [
           'وَعَدُوهُ'], 
   'قرارا': [
           'قَرَارًا'], 
   'صالو': [
          'صَالُو'], 
   'للمطففين': [
              'لِلْمُطَفِّفِينَ'], 
   'سولت': [
          'سَوَّلَتْ'], 
   'وذكرى': [
           'وَذِكْرَى'], 
   'عدوه': [
          'عَدُوِّهِ'], 
   'فذلكم': [
           'فَذَلِكُمُ'], 
   'رشيد': [
          'رَشِيدٌ'], 
   'كفران': [
           'كُفْرَانَ'], 
   'الأشر': [
           'الْأَشِرُ'], 
   'تسترضعوا': [
              'تَسْتَرْضِعُوا'], 
   'أخرجوهم': [
             'أَخْرِجُوهُمْ'], 
   'وأجرا': [
           'وَأَجْرًا'], 
   'السلام': [
            'السَّلَامِ',
            'السَّلَامُ',
            'السَّلَامَ'], 
   'وظن': [
         'وَظَنَّ'], 
   'وظل': [
         'وَظِلٍّ'], 
   'همزة': [
          'هُمَزَةٍ'], 
   'يدركه': [
           'يُدْرِكْهُ'], 
   'أفي': [
         'أَفِي'], 
   'صليا': [
          'صِلِيًّا'], 
   'صعقا': [
          'صَعِقًا'], 
   'لابنه': [
           'لِابْنِهِ'], 
   'واشدد': [
           'وَاشْدُدْ'], 
   'أفك': [
         'أُفِكَ'], 
   'كثر': [
         'كَثُرَ'], 
   'فاعف': [
          'فَاعْفُ'], 
   'متعتهم': [
            'مَتَّعْتَهُمْ'], 
   'أفل': [
         'أَفَلَ'], 
   'الحامدون': [
              'الْحَامِدُونَ'], 
   'ويذبحون': [
             'وَيُذَبِّحُونَ'], 
   'الفردوس': [
             'الْفِرْدَوْسِ',
             'الْفِرْدَوْسَ'], 
   'آيات': [
          'آيَاتِ',
          'آيَاتُ',
          'آيَاتٍ',
          'آيَاتٌ'], 
   'بالبأساء': [
              'بِالْبَأْسَاءِ'], 
   'يطعمها': [
            'يَطْعَمُهَا'], 
   'فلينظر': [
            'فَلْيَنْظُرْ',
            'فَلْيَنْظُرِ'], 
   'أوثانا': [
            'أَوْثَانًا'], 
   'والأبرص': [
             'وَالْأَبْرَصَ'], 
   'ويتم': [
          'وَيُتِمُّ',
          'وَيُتِمَّ'], 
   'متعت': [
          'مَتَّعْتُ'], 
   'برحمتك': [
            'بِرَحْمَتِكَ'], 
   'السرد': [
           'السَّرْدِ'], 
   'الصادقين': [
              'الصَّادِقِينَ'], 
   'وأورثنا': [
             'وَأَوْرَثْنَا',
             'وَأَوْرَثَنَا'], 
   'برحمته': [
            'بِرَحْمَتِهِ'], 
   'العقد': [
           'الْعُقَدِ'], 
   'ليبلوني': [
             'لِيَبْلُوَنِي'], 
   'لبشرين': [
            'لِبَشَرَيْنِ'], 
   'يصطرخون': [
             'يَصْطَرِخُونَ'], 
   'يطاع': [
          'يُطَاعُ'], 
   'الشيطان': [
             'الشَّيْطَانُ',
             'الشَّيْطَانِ',
             'الشَّيْطَانَ'], 
   'أفلح': [
          'أَفْلَحَ'], 
   'نستحوذ': [
            'نَسْتَحْوِذْ'], 
   'عطلت': [
          'عُطِّلَتْ'], 
   'فكفارته': [
             'فَكَفَّارَتُهُ'], 
   'أقرب': [
          'أَقْرَبُ'], 
   'وقدمنا': [
            'وَقَدِمْنَا'], 
   'واشربوا': [
             'وَاشْرَبُوا'], 
   'أفأمن': [
           'أَفَأَمِنَ'], 
   'والأقدام': [
              'وَالْأَقْدَامِ'], 
   'قليلا': [
           'قَلِيلًا'], 
   'ضاقت': [
          'ضَاقَتْ'], 
   'وبناتك': [
            'وَبَنَاتِكَ'], 
   'لجعل': [
          'لَجَعَلَ'], 
   'قليلة': [
           'قَلِيلَةٍ'], 
   'يشهده': [
           'يَشْهَدُهُ'], 
   'يفرحوا': [
            'يَفْرَحُوا'], 
   'غدوها': [
           'غُدُوُّهَا'], 
   'يطاف': [
          'يُطَافُ'], 
   'جهارا': [
           'جِهَارًا'], 
   'اشتملت': [
            'اشْتَمَلَتْ'], 
   'وكفرهم': [
            'وَكُفْرِهِمْ'], 
   'ظاهروهم': [
             'ظَاهَرُوهُمْ'], 
   'كاهن': [
          'كَاهِنٍ'], 
   'بقي': [
         'بَقِيَ'], 
   'أصبحوا': [
            'أَصْبَحُوا'], 
   'فإمساك': [
            'فَإِمْسَاكٌ'], 
   'والصلح': [
            'وَالصُّلْحُ'], 
   'تأتيهم': [
            'تَأْتِيهِمْ',
            'تَأْتِيَهُمُ',
            'تَأْتِيَهُمْ'], 
   'السعير': [
            'السَّعِيرِ'], 
   'واختلاف': [
             'وَاخْتِلَافِ',
             'وَاخْتِلَافُ'], 
   'بألسنتكم': [
              'بِأَلْسِنَتِكُمْ'], 
   'فنسي': [
          'فَنَسِيَ'], 
   'تقلب': [
          'تُقَلَّبُ',
          'تَقَلُّبُ',
          'تَقَلُّبَ'], 
   'لغافلين': [
             'لَغَافِلِينَ'], 
   'يؤمن': [
          'يُؤْمِنُ',
          'يُؤْمِنْ',
          'يُؤْمِنَّ',
          'يُؤْمِنَ'], 
   'وأملى': [
           'وَأَمْلَى'], 
   'برحمتنا': [
             'بِرَحْمَتِنَا'], 
   'وأملي': [
           'وَأُمْلِي'], 
   'ليدخل': [
           'لِيُدْخِلَ'], 
   'شهادة': [
           'شَهَادَةً',
           'شَهَادَةُ',
           'شَهَادَةَ'], 
   'وأحل': [
          'وَأُحِلَّ',
          'وَأَحَلَّ'], 
   'الآفلين': [
             'الْآفِلِينَ'], 
   'لإثم': [
          'لِإِثْمٍ'], 
   'نغفر': [
          'نَغْفِرْ'], 
   'مريدا': [
           'مَرِيدًا'], 
   'الخلطاء': [
             'الْخُلَطَاءِ'], 
   'ربهم': [
          'رَبِّهِمْ',
          'رَبَّهُمْ',
          'رَبُّهُمْ',
          'رَبِّهِمُ'], 
   'فجمع': [
          'فَجُمِعَ',
          'فَجَمَعَ'], 
   'جمال': [
          'جَمَالٌ'], 
   'مقاما': [
           'مَقَامًا'], 
   'أشتاتا': [
            'أَشْتَاتًا'], 
   'رؤياي': [
           'رُؤْيَايَ'], 
   'عصاني': [
           'عَصَانِي'], 
   'مقامع': [
           'مَقَامِعُ'], 
   'تكره': [
          'تُكْرِهُ'], 
   'رؤياك': [
           'رُؤْيَاكَ'], 
   'يخربون': [
            'يُخْرِبُونَ'], 
   'ويتيما': [
            'وَيَتِيمًا'], 
   'لذائقون': [
             'لَذَائِقُونَ'], 
   'بوأنا': [
           'بَوَّأْنَا'], 
   'مقامي': [
           'مَقَامِي'], 
   'ربها': [
          'رَبِّهَا',
          'رَبُّهَا'], 
   'لميقاتنا': [
              'لِمِيقَاتِنَا'], 
   'عيني': [
          'عَيْنِي'], 
   'مقامك': [
           'مَقَامِكَ'], 
   'وليكم': [
           'وَلِيُّكُمُ'], 
   'أثيما': [
           'أَثِيمًا'], 
   'تسكنون': [
            'تَسْكُنُونَ'], 
   'يحكم': [
          'يَحْكُمُ',
          'يَحْكُمْ',
          'يَحْكُمَ',
          'يُحْكِمُ'], 
   'يكن': [
         'يَكُنْ',
         'يَكُنِ',
         'يَكُنَّ'], 
   'كتابها': [
            'كِتَابِهَا'], 
   'يكف': [
         'يَكْفِ',
         'يَكُفَّ'], 
   'الحمار': [
            'الْحِمَارِ'], 
   'يصلونها': [
             'يَصْلَوْنَهَا'], 
   'فإلينا': [
            'فَإِلَيْنَا'], 
   'حسيسها': [
            'حَسِيسَهَا'], 
   'لسارقون': [
             'لَسَارِقُونَ'], 
   'سالمون': [
            'سَالِمُونَ'], 
   'بأخيك': [
           'بِأَخِيكَ'], 
   'يجز': [
         'يُجْزَ'], 
   'سافلها': [
            'سَافِلَهَا'], 
   'يتذكرون': [
             'يَتَذَكَّرُونَ'], 
   'وأخوه': [
           'وَأَخُوهُ'], 
   'المرفود': [
             'الْمَرْفُودُ'], 
   'نشوزهن': [
            'نُشُوزَهُنَّ'], 
   'يجد': [
         'يَجِدْ',
         'يَجِدِ'], 
   'محيطا': [
           'مُحِيطًا'], 
   'استجيب': [
            'اسْتُجِيبَ'], 
   'يجب': [
         'يُجِبْ'], 
   'أخويكم': [
            'أَخَوَيْكُمْ'], 
   'حبطت': [
          'حَبِطَتْ'], 
   'فرقت': [
          'فَرَّقْتَ'], 
   'نجيناكم': [
             'نَجَّيْنَاكُمْ'], 
   'سقطوا': [
           'سَقَطُوا'], 
   'عقدتم': [
           'عَقَّدْتُمُ'], 
   'لبعثنا': [
            'لَبَعَثْنَا'], 
   'سكارى': [
           'سُكَارَى'], 
   'للإنسان': [
             'لِلْإِنْسَانِ'], 
   'الصيام': [
            'الصِّيَامِ',
            'الصِّيَامُ',
            'الصِّيَامَ'], 
   'اكتسبت': [
            'اكْتَسَبَتْ'], 
   'امكثوا': [
            'امْكُثُوا'], 
   'إكراههن': [
             'إِكْرَاهِهِنَّ'], 
   'تعودون': [
            'تَعُودُونَ'], 
   'ومخرج': [
           'وَمُخْرِجُ'], 
   'إملاق': [
           'إِمْلَاقٍ'], 
   'رشدا': [
          'رَشَدًا',
          'رُشْدًا'], 
   'أخرتنا': [
            'أَخَّرْتَنَا'], 
   'ورفاتا': [
            'وَرُفَاتًا'], 
   'الخيام': [
            'الْخِيَامِ'], 
   'ربطنا': [
           'رَبَطْنَا'], 
   'صعيدا': [
           'صَعِيدًا'], 
   'جاءنا': [
           'جَاءَنَا'], 
   'بلونا': [
           'بَلَوْنَا'], 
   'وقنا': [
          'وَقِنَا'], 
   'ليعبدوا': [
             'لِيَعْبُدُوا'], 
   'أوسطهم': [
            'أَوْسَطُهُمْ'], 
   'تعودوا': [
            'تَعُودُوا'], 
   'صفصفا': [
           'صَفْصَفًا'], 
   'تنهون': [
           'تُنْهَوْنَ'], 
   'رشده': [
          'رُشْدَهُ'], 
   'اختلفوا': [
             'اخْتَلَفُوا'], 
   'سقفا': [
          'سُقُفًا',
          'سَقْفًا'], 
   'وجنات': [
           'وَجَنَّاتٍ',
           'وَجَنَّاتٌ'], 
   'جاءني': [
           'جَاءَنِي',
           'جَاءَنِيَ'], 
   'ريبة': [
          'رِيبَةً'], 
   'ليعبدون': [
             'لِيَعْبُدُونِ'], 
   'تعبدوا': [
            'تَعْبُدُوا'], 
   'تهوى': [
          'تَهْوَى'], 
   'تبخسوا': [
            'تَبْخَسُوا'], 
   'أدري': [
          'أَدْرِي'], 
   'الماهدون': [
              'الْمَاهِدُونَ'], 
   'البنات': [
            'الْبَنَاتِ',
            'الْبَنَاتُ'], 
   'نقموا': [
           'نَقَمُوا'], 
   'أعلنتم': [
            'أَعْلَنْتُمْ'], 
   'ترن': [
         'تَرَنِ'], 
   'ويجزيهم': [
             'وَيَجْزِيَهُمْ'], 
   'إخراجكم': [
             'إِخْرَاجِكُمْ'], 
   'تصفون': [
           'تَصِفُونَ'], 
   'وقتلهم': [
            'وَقَتْلِهِمُ',
            'وَقَتْلَهُمُ'], 
   'سألوا': [
           'سَأَلُوا'], 
   'منتصر': [
           'مُنْتَصِرٌ'], 
   'حاشرين': [
            'حَاشِرِينَ'], 
   'أوجفتم': [
            'أَوْجَفْتُمْ'], 
   'آمره': [
          'آمُرُهُ'], 
   'المرضى': [
            'الْمَرْضَى'], 
   'أجاج': [
          'أُجَاجٌ'], 
   'بعضكم': [
           'بَعْضُكُمْ',
           'بَعْضَكُمْ',
           'بَعْضِكُمْ'], 
   'والجن': [
           'وَالْجِنُّ',
           'وَالْجِنِّ'], 
   'وختم': [
          'وَخَتَمَ'], 
   'ثيبات': [
           'ثَيِّبَاتٍ'], 
   'لموعدهم': [
             'لَمَوْعِدُهُمْ'], 
   'بعدما': [
           'بَعْدَمَا'], 
   'تتناجوا': [
             'تَتَنَاجَوْا'], 
   'عيشة': [
          'عِيشَةٍ'], 
   'ذلولا': [
           'ذَلُولًا'], 
   'ميتون': [
           'مَيِّتُونَ'], 
   'الأحلام': [
             'الْأَحْلَامِ'], 
   'ليجادلوكم': [
               'لِيُجَادِلُوكُمْ'], 
   'والمحروم': [
              'وَالْمَحْرُومِ'], 
   'لخزنة': [
           'لِخَزَنَةِ'], 
   'قرطاس': [
           'قِرْطَاسٍ'], 
   'نصير': [
          'نَصِيرٍ'], 
   'أقدامكم': [
             'أَقْدَامَكُمْ'], 
   'احتملوا': [
             'احْتَمَلُوا'], 
   'نصيب': [
          'نَصِيبٌ',
          'نُصِيبُ',
          'نَصِيبٍ'], 
   'حرد': [
         'حَرْدٍ'], 
   'لمزة': [
          'لُمَزَةٍ'], 
   'حاجزين': [
            'حَاجِزِينَ'], 
   'فتاها': [
           'فَتَاهَا'], 
   'أطرافها': [
             'أَطْرَافِهَا'], 
   'ويوسف': [
           'وَيُوسُفَ'], 
   'الغار': [
           'الْغَارِ'], 
   'نتخطف': [
           'نُتَخَطَّفْ'], 
   'يشاءون': [
            'يَشَاءُونَ'], 
   'خالاتك': [
            'خَالَاتِكَ'], 
   'سديدا': [
           'سَدِيدًا'], 
   'يخزي': [
          'يُخْزِي'], 
   'جئتهم': [
           'جِئْتَهُمْ'], 
   'فسجدوا': [
            'فَسَجَدُوا'], 
   'ابتغى': [
           'ابْتَغَى'], 
   'خضرا': [
          'خُضْرًا',
          'خَضِرًا'], 
   'سيارة': [
           'سَيَّارَةٌ'], 
   'وقرآنا': [
            'وَقُرْآنًا'], 
   'الكبير': [
            'الْكَبِيرُ',
            'الْكَبِيرِ'], 
   'ويبين': [
           'وَيُبَيِّنُ'], 
   'وأطعنا': [
            'وَأَطَعْنَا'], 
   'وتمتعوا': [
             'وَتَمَتَّعُوا'], 
   'دحورا': [
           'دُحُورًا'], 
   'بالقول': [
            'بِالْقَوْلِ'], 
   'سرهم': [
          'سِرَّهُمْ'], 
   'بآياته': [
            'بِآيَاتِهِ'], 
   'تخسروا': [
            'تُخْسِرُوا'], 
   'ينكثون': [
            'يَنْكُثُونَ'], 
   'كسراب': [
           'كَسَرَابٍ'], 
   'فأشهدوا': [
             'فَأَشْهِدُوا'], 
   'نقص': [
         'نَقُصُّ'], 
   'دعوة': [
          'دَعْوَةُ',
          'دَعْوَةَ',
          'دَعْوَةٌ',
          'دَعْوَةً'], 
   'حيوك': [
          'حَيَّوْكَ'], 
   'حرض': [
         'حَرِّضِ'], 
   'فداء': [
          'فِدَاءً'], 
   'بآياتي': [
            'بِآيَاتِي'], 
   'أرأيت': [
           'أَرَأَيْتَ'], 
   'أعناق': [
           'أَعْنَاقِ'], 
   'النور': [
           'النُّورِ',
           'النُّورُ',
           'النُّورَ'], 
   'تأمنه': [
           'تَأْمَنْهُ'], 
   'قدمت': [
          'قَدَّمَتْ',
          'قَدَّمْتُ'], 
   'وأيدي': [
           'وَأَيْدِي'], 
   'وأيده': [
           'وَأَيَّدَهُ'], 
   'صلدا': [
          'صَلْدًا'], 
   'النفاثات': [
              'النَّفَّاثَاتِ'], 
   'يقلب': [
          'يُقَلِّبُ'], 
   'كتبناها': [
             'كَتَبْنَاهَا'], 
   'وبعهد': [
           'وَبِعَهْدِ'], 
   'رجعت': [
          'رُجِعْتُ'], 
   'أبغيكم': [
            'أَبْغِيكُمْ'], 
   'وقربناه': [
             'وَقَرَّبْنَاهُ'], 
   'يظاهروا': [
             'يُظَاهِرُوا'], 
   'أدعياءكم': [
              'أَدْعِيَاءَكُمْ'], 
   'الغيظ': [
           'الْغَيْظِ',
           'الْغَيْظَ'], 
   'يغضوا': [
           'يَغُضُّوا'], 
   'نوم': [
         'نَوْمٌ'], 
   'محلقين': [
            'مُحَلِّقِينَ'], 
   'أصنام': [
           'أَصْنَامٍ'], 
   'أريناه': [
            'أَرَيْنَاهُ'], 
   'رجسا': [
          'رِجْسًا'], 
   'سخرناها': [
             'سَخَّرْنَاهَا'], 
   'الغيث': [
           'الْغَيْثَ'], 
   'الغيب': [
           'الْغَيْبِ',
           'الْغَيْبَ',
           'الْغَيْبُ'], 
   'وأقاموا': [
             'وَأَقَامُوا'], 
   'واجتنبوا': [
              'وَاجْتَنِبُوا'], 
   'نأخذ': [
          'نَأْخُذَ'], 
   'يظاهرون': [
             'يُظَاهِرُونَ'], 
   'فاستكبرتم': [
               'فَاسْتَكْبَرْتُمْ'], 
   'جديد': [
          'جَدِيدٍ'], 
   'هودا': [
          'هُودًا'], 
   'وطئا': [
          'وَطْئًا'], 
   'فأهلكته': [
             'فَأَهْلَكَتْهُ'], 
   'رجعه': [
          'رَجْعِهِ'], 
   'يغضون': [
           'يَغُضُّونَ'], 
   'فوسطن': [
           'فَوَسَطْنَ'], 
   'فالتقى': [
            'فَالْتَقَى'], 
   'ولاهم': [
           'وَلَّاهُمْ'], 
   'يقرض': [
          'يُقْرِضُ'], 
   'يجادلونك': [
              'يُجَادِلُونَكَ'], 
   'جهر': [
         'جَهَرَ'], 
   'النون': [
           'النُّونِ'], 
   'أولياء': [
            'أَوْلِيَاءَ',
            'أَوْلِيَاءُ'], 
   'جبارا': [
           'جَبَّارًا'], 
   'للمؤمنات': [
              'لِلْمُؤْمِنَاتِ'], 
   'عجيب': [
          'عَجِيبٌ'], 
   'تأمنا': [
           'تَأْمَنَّا'], 
   'كفيه': [
          'كَفَّيْهِ'], 
   'أوذي': [
          'أُوذِيَ'], 
   'والخير': [
            'وَالْخَيْرِ'], 
   'مهاجرا': [
            'مُهَاجِرًا'], 
   'فسحقا': [
           'فَسُحْقًا'], 
   'بيحيى': [
           'بِيَحْيَى'], 
   'فذاقوا': [
            'فَذَاقُوا'], 
   'جزاؤكم': [
            'جَزَاؤُكُمْ'], 
   'بكأس': [
          'بِكَأْسٍ'], 
   'المؤمنات': [
              'الْمُؤْمِنَاتِ',
              'الْمُؤْمِنَاتُ'], 
   'سيصلى': [
           'سَيَصْلَى'], 
   'يصيبكم': [
            'يُصِيبَكُمْ',
            'يُصِيبَكُمُ'], 
   'زوجان': [
           'زَوْجَانِ'], 
   'سابقين': [
            'سَابِقِينَ'], 
   'لفسدت': [
           'لَفَسَدَتِ'], 
   'يتزكى': [
           'يَتَزَكَّى'], 
   'استنصروكم': [
               'اسْتَنْصَرُوكُمْ'], 
   'ويؤثرون': [
             'وَيُؤْثِرُونَ'], 
   'تقاتلوا': [
             'تُقَاتِلُوا'], 
   'كالحجارة': [
              'كَالْحِجَارَةِ'], 
   'الظهيرة': [
             'الظَّهِيرَةِ'], 
   'خفيا': [
          'خَفِيًّا'], 
   'ننبئكم': [
            'نُنَبِّئُكُمْ'], 
   'وأورثكم': [
             'وَأَوْرَثَكُمْ'], 
   'يصطفي': [
           'يَصْطَفِي'], 
   'المؤمنين': [
              'الْمُؤْمِنِينَ'], 
   'المصباح': [
             'الْمِصْبَاحُ'], 
   'مفتحة': [
           'مُفَتَّحَةً'], 
   'نصوحا': [
           'نَصُوحًا'], 
   'حول': [
         'حَوْلِ',
         'حَوْلَ'], 
   'لغوي': [
          'لَغَوِيٌّ'], 
   'بيضاء': [
           'بَيْضَاءَ',
           'بَيْضَاءُ'], 
   'خلقوا': [
           'خَلَقُوا',
           'خُلِقُوا'], 
   'اللمم': [
           'اللَّمَمَ'], 
   'سفيها': [
           'سَفِيهًا'], 
   'الأرائك': [
             'الْأَرَائِكِ'], 
   'فاسأل': [
           'فَاسْأَلْ',
           'فَاسْأَلِ'], 
   'فأوف': [
          'فَأَوْفِ'], 
   'سآتيكم': [
            'سَآتِيكُمْ'], 
   'كذب': [
         'كَذَّبَ',
         'كَذَبَ',
         'كُذِّبَ',
         'كَذِبٍ'], 
   'نبأنا': [
           'نَبَّأَنَا'], 
   'يصدنكم': [
            'يَصُدَّنَّكُمُ'], 
   'فبعث': [
          'فَبَعَثَ'], 
   'الربا': [
           'الرِّبَا'], 
   'تذروه': [
           'تَذْرُوهُ'], 
   'أماته': [
           'أَمَاتَهُ'], 
   'لئلا': [
          'لِئَلَّا'], 
   'شروا': [
          'شَرَوْا'], 
   'لغوب': [
          'لُغُوبٍ',
          'لُغُوبٌ'], 
   'ترضاها': [
            'تَرْضَاهَا'], 
   'الربع': [
           'الرُّبُعُ'], 
   'العقاب': [
            'الْعِقَابِ'], 
   'فنبذتها': [
             'فَنَبَذْتُهَا'], 
   'الخائنين': [
              'الْخَائِنِينَ'], 
   'لغوا': [
          'لَغْوًا'], 
   'القريتين': [
              'الْقَرْيَتَيْنِ'], 
   'فامسحوا': [
             'فَامْسَحُوا'], 
   'وحشرنا': [
            'وَحَشَرْنَا'], 
   'جميع': [
          'جَمِيعٌ'], 
   'خلال': [
          'خِلَالَ',
          'خِلَالٌ'], 
   'أشياعكم': [
             'أَشْيَاعَكُمْ'], 
   'وفريقا': [
            'وَفَرِيقًا'], 
   'التقتا': [
            'الْتَقَتَا'], 
   'مناديا': [
            'مُنَادِيًا'], 
   'نخلفه': [
           'نُخْلِفُهُ'], 
   'كبيرة': [
           'كَبِيرَةً'], 
   'غنمي': [
          'غَنَمِي'], 
   'رددت': [
          'رُدِدْتُ'], 
   'كبيرا': [
           'كَبِيرًا'], 
   'وجوه': [
          'وُجُوهٌ',
          'وُجُوهِ',
          'وُجُوهُ'], 
   'سندع': [
          'سَنَدْعُ'], 
   'وندخلهم': [
             'وَنُدْخِلُهُمْ'], 
   'صلوه': [
          'صَلُّوهُ'], 
   'تغن': [
         'تُغْنِ',
         'تَغْنَ'], 
   'فتحرير': [
            'فَتَحْرِيرُ'], 
   'أبكارا': [
            'أَبْكَارًا'], 
   'والعاقبة': [
              'وَالْعَاقِبَةُ'], 
   'شهادتهما': [
              'شَهَادَتِهِمَا'], 
   'سلطانا': [
            'سُلْطَانًا'], 
   'ومنهم': [
           'وَمِنْهُمْ',
           'وَمِنْهُمُ'], 
   'وراءه': [
           'وَرَاءَهُ'], 
   'الملكين': [
             'الْمَلَكَيْنِ'], 
   'فجعلناه': [
             'فَجَعَلْنَاهُ'], 
   'سدى': [
         'سُدًى'], 
   'تارك': [
          'تَارِكٌ'], 
   'لينبذن': [
            'لَيُنْبَذَنَّ'], 
   'بآيات': [
           'بِآيَاتِ'], 
   'ومحرم': [
           'وَمُحَرَّمٌ'], 
   'كثرة': [
          'كَثْرَةُ'], 
   'فاكهة': [
           'فَاكِهَةٌ',
           'فَاكِهَةٍ'], 
   'المحسنين': [
              'الْمُحْسِنِينَ'], 
   'ويعلمهم': [
             'وَيُعَلِّمُهُمُ'], 
   'والروح': [
            'وَالرُّوحُ'], 
   'الماعون': [
             'الْمَاعُونَ'], 
   'يرضى': [
          'يَرْضَى'], 
   'حيتانهم': [
             'حِيتَانُهُمْ'], 
   'كلبهم': [
           'كَلْبُهُمْ'], 
   'لتزول': [
           'لِتَزُولَ'], 
   'والطاغوت': [
              'وَالطَّاغُوتِ'], 
   'تارة': [
          'تَارَةً'], 
   'اللهم': [
           'اللَّهُمَّ'], 
   'نجعل': [
          'نَجْعَلْ',
          'نَجْعَلُ',
          'نَجْعَلِ',
          'نَجْعَلَ'], 
   'اللهو': [
           'اللَّهْوِ'], 
   'لاصطفى': [
            'لَاصْطَفَى'], 
   'سدر': [
         'سِدْرٍ'], 
   'ضعف': [
         'ضَعْفٍ',
         'ضِعْفَ',
         'ضِعْفٌ',
         'ضَعُفَ'], 
   'ظالمون': [
            'ظَالِمُونَ'], 
   'يراك': [
          'يَرَاكَ'], 
   'تتبيرا': [
            'تَتْبِيرًا'], 
   'تنابزوا': [
             'تَنَابَزُوا'], 
   'فمال': [
          'فَمَالِ'], 
   'حاجك': [
          'حَاجَّكَ'], 
   'وكنا': [
          'وَكُنَّا'], 
   'صلوا': [
          'صَلُّوا'], 
   'فيحل': [
          'فَيَحِلَّ'], 
   'وكنت': [
          'وَكُنْتُ',
          'وَكُنْتَ'], 
   'أحلت': [
          'أُحِلَّتْ'], 
   'سلطانه': [
            'سُلْطَانُهُ'], 
   'خلفوا': [
           'خُلِّفُوا'], 
   'أسأتم': [
           'أَسَأْتُمْ'], 
   'خاصة': [
          'خَاصَّةً'], 
   'ومنها': [
           'وَمِنْهَا'], 
   'يبسط': [
          'يَبْسُطُ'], 
   'تخشى': [
          'تَخْشَى'], 
   'وهزي': [
          'وَهُزِّي'], 
   'أتانا': [
           'أَتَانَا'], 
   'بالسوء': [
            'بِالسُّوءِ'], 
   'يجدك': [
          'يَجِدْكَ'], 
   'وأنبتت': [
            'وَأَنْبَتَتْ'], 
   'كافة': [
          'كَافَّةً'], 
   'يبسا': [
          'يَبَسًا'], 
   'كافر': [
          'كَافِرٌ',
          'كَافِرٍ'], 
   'ولأضلنهم': [
              'وَلَأُضِلَّنَّهُمْ'], 
   'وبصدهم': [
            'وَبِصَدِّهِمْ'], 
   'يقاتلوكم': [
              'يُقَاتِلُوكُمْ'], 
   'السدس': [
           'السُّدُسُ'], 
   'لسنة': [
          'لِسُنَّةِ'], 
   'مفاتحه': [
            'مَفَاتِحَهُ'], 
   'يعرفونه': [
             'يَعْرِفُونَهُ'], 
   'ولنجعله': [
             'وَلِنَجْعَلَهُ'], 
   'صحفا': [
          'صُحُفًا'], 
   'ولنجعلك': [
             'وَلِنَجْعَلَكَ'], 
   'لتلقى': [
           'لَتُلَقَّى'], 
   'اللاعبين': [
              'اللَّاعِبِينَ'], 
   'وجعلناكم': [
              'وَجَعَلْنَاكُمْ'], 
   'بغيكم': [
           'بَغْيُكُمْ'], 
   'يابسات': [
            'يَابِسَاتٍ'], 
   'يحافظون': [
             'يُحَافِظُونَ'], 
   'فثم': [
         'فَثَمَّ'], 
   'أخوالكم': [
             'أَخْوَالِكُمْ'], 
   'ضالا': [
          'ضَالًّا'], 
   'فناداها': [
             'فَنَادَاهَا'], 
   'قوامين': [
            'قَوَّامِينَ'], 
   'فتعرفونها': [
               'فَتَعْرِفُونَهَا'], 
   'عسرة': [
          'عُسْرَةٍ'], 
   'فنكون': [
           'فَنَكُونَ'], 
   'عسرا': [
          'عُسْرًا'], 
   'أتمها': [
           'أَتَمَّهَا'], 
   'تخسير': [
           'تَخْسِيرٍ'], 
   'ثقفوا': [
           'ثُقِفُوا'], 
   'بيض': [
         'بِيضٌ',
         'بَيْضٌ'], 
   'اقتتل': [
           'اقْتَتَلَ'], 
   'والجان': [
            'وَالْجَانَّ'], 
   'خلقناه': [
            'خَلَقْنَاهُ'], 
   'والدة': [
           'وَالِدَةٌ'], 
   'كالجبال': [
             'كَالْجِبَالِ'], 
   'خطبة': [
          'خِطْبَةِ'], 
   'الخلود': [
            'الْخُلُودِ'], 
   'يختانون': [
             'يَخْتَانُونَ'], 
   'المنافقون': [
               'الْمُنَافِقُونَ'], 
   'العلي': [
           'الْعَلِيُّ',
           'الْعَلِيِّ'], 
   'العلى': [
           'الْعُلَى'], 
   'نتبعكم': [
            'نَتَّبِعْكُمْ'], 
   'بالسوق': [
            'بِالسُّوقِ'], 
   'القانع': [
            'الْقَانِعَ'], 
   'فنصف': [
          'فَنِصْفُ'], 
   'العلم': [
           'الْعِلْمِ',
           'الْعِلْمَ',
           'الْعِلْمُ'], 
   'للشاربين': [
              'لِلشَّارِبِينَ'], 
   'تخشع': [
          'تَخْشَعَ'], 
   'مسودا': [
           'مُسْوَدًّا'], 
   'آسى': [
         'آسَى'], 
   'آسن': [
         'آسِنٍ'], 
   'مسودة': [
           'مُسْوَدَّةٌ'], 
   'يراد': [
          'يُرَادُ'], 
   'أرسلناك': [
             'أَرْسَلْنَاكَ'], 
   'نمدهم': [
           'نُمِدُّهُمْ'], 
   'أرسلناه': [
             'أَرْسَلْنَاهُ'], 
   'حلفتم': [
           'حَلَفْتُمْ'], 
   'فالحاملات': [
               'فَالْحَامِلَاتِ'], 
   'تجدوه': [
           'تَجِدُوهُ'], 
   'وأثل': [
          'وَأَثْلٍ'], 
   'دخلتموه': [
             'دَخَلْتُمُوهُ'], 
   'وماتوا': [
            'وَمَاتُوا'], 
   'المسجد': [
            'الْمَسْجِدِ',
            'الْمَسْجِدَ'], 
   'سبإ': [
         'سَبَإٍ'], 
   'تمنون': [
           'تُمْنُونَ',
           'تَمَنَّوْنَ'], 
   'يخل': [
         'يَخْلُ'], 
   'المنزلون': [
              'الْمُنْزِلُونَ'], 
   'آخرون': [
           'آخَرُونَ'], 
   'وبدارا': [
            'وَبِدَارًا'], 
   'فإياي': [
           'فَإِيَّايَ'], 
   'مثلا': [
          'مَثَلًا'], 
   'واصبر': [
           'وَاصْبِرْ'], 
   'أمدكم': [
           'أَمَدَّكُمْ'], 
   'الكفور': [
            'الْكَفُورَ'], 
   'لغو': [
         'لَغْوٌ'], 
   'كماء': [
          'كَمَاءٍ'], 
   'بالغمام': [
             'بِالْغَمَامِ'], 
   'وإنكم': [
           'وَإِنَّكُمْ'], 
   'الكلب': [
           'الْكَلْبِ'], 
   'ثمانية': [
            'ثَمَانِيَةَ',
            'ثَمَانِيَةٌ'], 
   'الأرذلون': [
              'الْأَرْذَلُونَ'], 
   'الأيامى': [
             'الْأَيَامَى'], 
   'لسبإ': [
          'لِسَبَإٍ'], 
   'وغواص': [
           'وَغَوَّاصٍ'], 
   'تستهزئون': [
              'تَسْتَهْزِئُونَ'], 
   'وطمعا': [
           'وَطَمَعًا'], 
   'فلمسوه': [
            'فَلَمَسُوهُ'], 
   'ن': [
       'ن'], 
   'أخذا': [
          'أَخْذًا'], 
   'أخذته': [
           'أَخَذَتْهُ'], 
   'لغد': [
         'لِغَدٍ'], 
   'جئت': [
         'جِئْتَ',
         'جِئْتِ'], 
   'والأذن': [
            'وَالْأُذُنَ'], 
   'يمن': [
         'يَمُنُّ'], 
   'يمل': [
         'يُمِلَّ'], 
   'لغفور': [
           'لَغَفُورٌ'], 
   'وحصورا': [
            'وَحَصُورًا'], 
   'أنبائكم': [
             'أَنْبَائِكُمْ'], 
   'لوجدوا': [
            'لَوَجَدُوا'], 
   'نادى': [
          'نَادَى'], 
   'ميقاتا': [
            'مِيقَاتًا'], 
   'ينظر': [
          'يَنْظُرُ'], 
   'والإكرام': [
              'وَالْإِكْرَامِ'], 
   'يخش': [
         'يَخْشَ'], 
   'كسبتم': [
           'كَسَبْتُمْ'], 
   'تأخذوا': [
            'تَأْخُذُوا'], 
   'تجدوا': [
           'تَجِدُوا'], 
   'وأميت': [
           'وَأُمِيتُ'], 
   'التوابين': [
              'التَّوَّابِينَ'], 
   'محيصا': [
           'مَحِيصًا'], 
   'فالله': [
           'فَاللَّهُ'], 
   'أفتوني': [
            'أَفْتُونِي'], 
   'ونقص': [
          'وَنَقْصٍ'], 
   'وبداره': [
            'وَبِدَارِهِ'], 
   'ونقر': [
          'وَنُقِرُّ'], 
   'ربما': [
          'رُبَمَا'], 
   'تأتوننا': [
             'تَأْتُونَنَا'], 
   'آباء': [
          'آبَاءِ'], 
   'دعانا': [
           'دَعَانَا'], 
   'فعاقبتم': [
             'فَعَاقَبْتُمْ'], 
   'مرجعكم': [
            'مَرْجِعُكُمْ'], 
   'هشيما': [
           'هَشِيمًا'], 
   'تضليل': [
           'تَضْلِيلٍ'], 
   'ولعلكم': [
            'وَلَعَلَّكُمْ'], 
   'وتؤمنون': [
             'وَتُؤْمِنُونَ'], 
   'فيقتل': [
           'فَيُقْتَلْ'], 
   'تطيعوا': [
            'تُطِيعُوا'], 
   'وسارب': [
           'وَسَارِبٌ'], 
   'ونمير': [
           'وَنَمِيرُ'], 
   'زخرفها': [
            'زُخْرُفَهَا'], 
   'أتنهانا': [
             'أَتَنْهَانَا'], 
   'تخافا': [
           'تَخَافَا'], 
   'وأمم': [
          'وَأُمَمٌ'], 
   'عفي': [
         'عُفِيَ'], 
   'يؤذين': [
           'يُؤْذَيْنَ'], 
   'يتنزل': [
           'يَتَنَزَّلُ'], 
   'لومة': [
          'لَوْمَةَ'], 
   'فانبذ': [
           'فَانْبِذْ'], 
   'نسلخ': [
          'نَسْلَخُ'], 
   'فرجالا': [
            'فَرِجَالًا'], 
   'يسقى': [
          'يُسْقَى'], 
   'يمينك': [
           'يَمِينُكَ',
           'يَمِينِكَ'], 
   'ابنتي': [
           'ابْنَتَيَّ'], 
   'أبصارهن': [
             'أَبْصَارِهِنَّ'], 
   'فزين': [
          'فَزَيَّنَ'], 
   'يناديهم': [
             'يُنَادِيهِمْ'], 
   'طحاها': [
           'طَحَاهَا'], 
   'نظنكم': [
           'نَظُنُّكُمْ'], 
   'فتماروا': [
             'فَتَمَارَوْا'], 
   'تفرح': [
          'تَفْرَحْ'], 
   'وأترفناهم': [
               'وَأَتْرَفْنَاهُمْ'], 
   'صادق': [
          'صَادِقَ'], 
   'سوءا': [
          'سُوءًا'], 
   'يجاهد': [
           'يُجَاهِدُ'], 
   'مسجدا': [
           'مَسْجِدًا'], 
   'فرجها': [
           'فَرْجَهَا'], 
   'سوءة': [
          'سَوْءَةَ'], 
   'وربطنا': [
            'وَرَبَطْنَا'], 
   'يوسوس': [
           'يُوَسْوِسُ'], 
   'ومغاربها': [
              'وَمَغَارِبَهَا'], 
   'نذقه': [
          'نُذِقْهُ'], 
   'يعبأ': [
          'يَعْبَأُ'], 
   'أغشيت': [
           'أُغْشِيَتْ'], 
   'متفرقون': [
             'مُتَفَرِّقُونَ'], 
   'وأن': [
         'وَأَنَّ',
         'وَأَنْ',
         'وَأَنِ'], 
   'استمتع': [
            'اسْتَمْتَعَ'], 
   'تفرحون': [
            'تَفْرَحُونَ'], 
   'وإليه': [
           'وَإِلَيْهِ'], 
   'يعبد': [
          'يَعْبُدُ'], 
   'وإليك': [
           'وَإِلَيْكَ'], 
   'حم': [
        'حم'], 
   'حل': [
        'حِلٌّ'], 
   'يسجرون': [
            'يُسْجَرُونَ'], 
   'كلها': [
          'كُلَّهَا',
          'كُلِّهَا'], 
   'ويكون': [
           'وَيَكُونَ'], 
   'حق': [
        'حَقَّ',
        'حَقٌّ',
        'حَقٍّ',
        'حَقُّ'], 
   'زجاجة': [
           'زُجَاجَةٍ'], 
   'بإيمانكم': [
              'بِإِيمَانِكُمْ'], 
   'ناصح': [
          'نَاصِحٌ'], 
   'والقمر': [
            'وَالْقَمَرَ',
            'وَالْقَمَرُ',
            'وَالْقَمَرِ'], 
   'يخافا': [
           'يَخَافَا'], 
   'ولباس': [
           'وَلِبَاسُ'], 
   'حسبي': [
          'حَسْبِيَ'], 
   'أبويه': [
           'أَبَوَيْهِ'], 
   'حديثا': [
           'حَدِيثًا'], 
   'فكبت': [
          'فَكُبَّتْ'], 
   'أعينهن': [
            'أَعْيُنُهُنَّ'], 
   'فيبسطه': [
            'فَيَبْسُطُهُ'], 
   'حسبك': [
          'حَسْبُكَ',
          'حَسْبَكَ'], 
   'لسوف': [
          'لَسَوْفَ'], 
   'بنا': [
         'بِنَا'], 
   'حسبه': [
          'حَسْبُهُ'], 
   'تبذر': [
          'تُبَذِّرْ'], 
   'وحرث': [
          'وَحَرْثٌ'], 
   'سينين': [
           'سِينِينَ'], 
   'والمنفقين': [
               'وَالْمُنْفِقِينَ'], 
   'لمفعولا': [
             'لَمَفْعُولًا'], 
   'أبويك': [
           'أَبَوَيْكَ'], 
   'واهدنا': [
            'وَاهْدِنَا'], 
   'هديتنا': [
            'هَدَيْتَنَا'], 
   'وأبصرهم': [
             'وَأَبْصِرْهُمْ'], 
   'تصبكم': [
           'تُصِبْكُمْ'], 
   'الكوافر': [
             'الْكَوَافِرِ'], 
   'يصوركم': [
            'يُصَوِّرُكُمْ'], 
   'حدائق': [
           'حَدَائِقَ'], 
   'تقربون': [
            'تَقْرَبُونِ'], 
   'وحرض': [
          'وَحَرِّضِ'], 
   'الخاطئين': [
              'الْخَاطِئِينَ'], 
   'المصلين': [
             'الْمُصَلِّينَ'], 
   'أصغر': [
          'أَصْغَرُ',
          'أَصْغَرَ'], 
   'ليذيقهم': [
             'لِيُذِيقَهُمْ'], 
   'أشياءهم': [
             'أَشْيَاءَهُمْ'], 
   'خرجوا': [
           'خَرَجُوا'], 
   'يحسبه': [
           'يَحْسَبُهُ'], 
   'يحسبن': [
           'يَحْسَبَنَّ'], 
   'فأزلهما': [
             'فَأَزَلَّهُمَا'], 
   'وتكونوا': [
             'وَتَكُونُوا'], 
   'وحرم': [
          'وَحُرِّمَ',
          'وَحَرَّمَ'], 
   'بهيج': [
          'بَهِيجٍ'], 
   'ضللنا': [
           'ضَلَلْنَا'], 
   'وشهدوا': [
            'وَشَهِدُوا'], 
   'والأقربين': [
               'وَالْأَقْرَبِينَ'], 
   'ويلتى': [
           'وَيْلَتَى'], 
   'لؤلؤا': [
           'لُؤْلُؤًا'], 
   'باشروهن': [
             'بَاشِرُوهُنَّ'], 
   'تقربوا': [
            'تَقْرَبُوا'], 
   'ليجزي': [
           'لِيَجْزِيَ'], 
   'خالصة': [
           'خَالِصَةً',
           'خَالِصَةٌ'], 
   'تحرم': [
          'تُحَرِّمُ'], 
   'رأوك': [
          'رَأَوْكَ'], 
   'وأصروا': [
            'وَأَصَرُّوا'], 
   'وصدها': [
           'وَصَدَّهَا'], 
   'اصطفاه': [
            'اصْطَفَاهُ'], 
   'كلهم': [
          'كُلُّهُمْ'], 
   'كلهن': [
          'كُلُّهُنَّ'], 
   'رحيق': [
          'رَحِيقٍ'], 
   'ندعو': [
          'نَدْعُو',
          'نَدْعُوَ'], 
   'حج': [
        'حِجُّ',
        'حَجَّ'], 
   'يغنهم': [
           'يُغْنِهِمُ'], 
   'كتبت': [
          'كَتَبْتَ',
          'كَتَبَتْ'], 
   'وأدبارهم': [
              'وَأَدْبَارَهُمْ'], 
   'يبصر': [
          'يُبْصِرُ'], 
   'ويكور': [
           'وَيُكَوِّرُ'], 
   'حسبت': [
          'حَسِبْتَ'], 
   'بني': [
         'بَنِي',
         'بُنَيَّ',
         'بَنِيَّ'], 
   'ورهبا': [
           'وَرَهَبًا'], 
   'والقمل': [
            'وَالْقُمَّلَ'], 
   'وقذف': [
          'وَقَذَفَ'], 
   'حظ': [
        'حَظِّ',
        'حَظٍّ'], 
   'لتدعوهم': [
             'لَتَدْعُوهُمْ'], 
   'الطفل': [
           'الطِّفْلِ'], 
   'وإلهكم': [
            'وَإِلَهُكُمْ'], 
   'يؤفك': [
          'يُؤْفَكُ'], 
   'أنبئهم': [
            'أَنْبِئْهُمْ'], 
   'تشتروا': [
            'تَشْتَرُوا'], 
   'ورفع': [
          'وَرَفَعَ'], 
   'وامرأت': [
            'وَامْرَأَتَ'], 
   'وامرأة': [
            'وَامْرَأَةً'], 
   'هين': [
         'هَيِّنٌ'], 
   'هيه': [
         'هِيَهْ'], 
   'مقسوم': [
           'مَقْسُومٌ'], 
   'أنهم': [
          'أَنَّهُمْ'], 
   'يلبسون': [
            'يَلْبِسُونَ',
            'يَلْبَسُونَ'], 
   'ويجعله': [
            'وَيَجْعَلُهُ'], 
   'تفرضوا': [
            'تَفْرِضُوا'], 
   'عفونا': [
           'عَفَوْنَا'], 
   'خالدين': [
            'خَالِدِينَ',
            'خَالِدَيْنِ'], 
   'وحيا': [
          'وَحْيًا'], 
   'تذكرة': [
           'تَذْكِرَةٌ',
           'تَذْكِرَةً'], 
   'فيوحي': [
           'فَيُوحِيَ'], 
   'اتخذي': [
           'اتَّخِذِي'], 
   'مؤصدة': [
           'مُؤْصَدَةٌ'], 
   'يورث': [
          'يُورَثُ'], 
   'الحلم': [
           'الْحُلُمَ'], 
   'القاضية': [
             'الْقَاضِيَةَ'], 
   'هاهنا': [
           'هَاهُنَا'], 
   'لذو': [
         'لَذُو'], 
   'يلبسوا': [
            'يَلْبِسُوا'], 
   'القاعدون': [
              'الْقَاعِدُونَ'], 
   'مكبا': [
          'مُكِبًّا'], 
   'فيظللن': [
            'فَيَظْلَلْنَ'], 
   'يبث': [
         'يَبُثُّ'], 
   'فحق': [
         'فَحَقَّ'], 
   'اتخذت': [
           'اتَّخَذْتُ',
           'اتَّخَذْتَ',
           'اتَّخَذَتْ'], 
   'وليهم': [
           'وَلِيُّهُمْ',
           'وَلِيُّهُمُ'], 
   'فواحدة': [
            'فَوَاحِدَةً'], 
   'يحيين': [
           'يُحْيِينِ'], 
   'طفلا': [
          'طِفْلًا'], 
   'اعبدوني': [
             'اعْبُدُونِي'], 
   'لذة': [
         'لَذَّةٍ'], 
   'ولتعلم': [
            'وَلِتَعْلَمَ'], 
   'عشرا': [
          'عَشْرًا'], 
   'عشرة': [
          'عَشْرَةَ',
          'عَشَرَةِ',
          'عَشَرَةٌ'], 
   'الآية': [
           'الْآيَةَ'], 
   'الكيل': [
           'الْكَيْلَ',
           'الْكَيْلُ'], 
   'الماكرين': [
              'الْمَاكِرِينَ'], 
   'فآمنت': [
           'فَآمَنَتْ'], 
   'مشفقين': [
            'مُشْفِقِينَ'], 
   'غول': [
         'غَوْلٌ'], 
   'استجابوا': [
              'اسْتَجَابُوا'], 
   'غوى': [
         'غَوَى'], 
   'نرزقهم': [
            'نَرْزُقُهُمْ'], 
   'تعلمونهم': [
              'تَعْلَمُونَهُمُ'], 
   'أنها': [
          'أَنَّهَا'], 
   'فآمنا': [
           'فَآمَنَّا'], 
   'وجحدوا': [
            'وَجَحَدُوا'], 
   'بدله': [
          'بَدِّلْهُ',
          'بَدَّلَهُ'], 
   'عادا': [
          'عَادًا'], 
   'والعصيان': [
              'وَالْعِصْيَانَ'], 
   'زرعا': [
          'زَرْعًا'], 
   'التناوش': [
             'التَّنَاوُشُ'], 
   'يتركم': [
           'يَتِرَكُمْ'], 
   'عمين': [
          'عَمِينَ'], 
   'المستضعفين': [
                'الْمُسْتَضْعَفِينَ'], 
   'فألقه': [
           'فَأَلْقِهْ'], 
   'مدحورا': [
            'مَدْحُورًا'], 
   'بحجارة': [
            'بِحِجَارَةٍ'], 
   'شهيدا': [
           'شَهِيدًا'], 
   'لآيات': [
           'لَآيَاتٍ'], 
   'اتبعوه': [
            'اتَّبَعُوهُ'], 
   'النصف': [
           'النِّصْفُ'], 
   'يحسبون': [
            'يَحْسَبُونَ'], 
   'وإنما': [
           'وَإِنَّمَا'], 
   'مهزوم': [
           'مَهْزُومٌ'], 
   'بمواقع': [
            'بِمَوَاقِعِ'], 
   'ولملئت': [
            'وَلَمُلِئْتَ'], 
   'أنعام': [
           'أَنْعَامٌ'], 
   'معذرتهم': [
             'مَعْذِرَتُهُمْ'], 
   'محدث': [
          'مُحْدَثٍ'], 
   'ناصرين': [
            'نَاصِرِينَ'], 
   'عاملون': [
            'عَامِلُونَ'], 
   'اعتمر': [
           'اعْتَمَرَ'], 
   'نوركم': [
           'نُورِكُمْ'], 
   'والوالدات': [
               'وَالْوَالِدَاتُ'], 
   'سرابيل': [
            'سَرَابِيلَ'], 
   'دارهم': [
           'دَارِهِمْ'], 
   'المنذرين': [
              'الْمُنْذَرِينَ',
              'الْمُنْذِرِينَ'], 
   'والآصال': [
             'وَالْآصَالِ'], 
   'ويخافون': [
             'وَيَخَافُونَ'], 
   'يغوصون': [
            'يَغُوصُونَ'], 
   'كظيم': [
          'كَظِيمٌ'], 
   'أقواتها': [
             'أَقْوَاتَهَا'], 
   'يضاهئون': [
             'يُضَاهِئُونَ'], 
   'وألق': [
          'وَأَلْقِ'], 
   'وألف': [
          'وَأَلَّفَ'], 
   'الحافرة': [
             'الْحَافِرَةِ'], 
   'المستكبرين': [
                'الْمُسْتَكْبِرِينَ'], 
   'منامها': [
            'مَنَامِهَا'], 
   'أجزعنا': [
            'أَجَزِعْنَا'], 
   'نذهبن': [
           'نَذْهَبَنَّ'], 
   'متكأ': [
          'مُتَّكَأً'], 
   'مفعولا': [
            'مَفْعُولًا'], 
   'ليجزيهم': [
             'لِيَجْزِيَهُمُ'], 
   'لديه': [
          'لَدَيْهِ'], 
   'فنجي': [
          'فَنُجِّيَ'], 
   'ليبين': [
           'لِيُبَيِّنَ'], 
   'لرجمناك': [
             'لَرَجَمْنَاكَ'], 
   'المتقون': [
             'الْمُتَّقُونَ'], 
   'رآك': [
         'رَآكَ'], 
   'انبعاثهم': [
              'انْبِعَاثَهُمْ'], 
   'وشاقوا': [
            'وَشَاقُّوا'], 
   'وسبحوا': [
            'وَسَبَّحُوا'], 
   'والعصر': [
            'وَالْعَصْرِ'], 
   'ولتنصرنه': [
              'وَلَتَنْصُرُنَّهُ'], 
   'فعلته': [
           'فَعَلْتُهُ'], 
   'ويخرج': [
           'وَيُخْرِجُ',
           'وَيُخْرِجْ'], 
   'فاعمل': [
           'فَاعْمَلْ'], 
   'متكئين': [
            'مُتَّكِئِينَ'], 
   'أحصاها': [
            'أَحْصَاهَا'], 
   'ظن': [
        'ظَنَّ',
        'ظَنُّ'], 
   'الداعي': [
            'الدَّاعِيَ'], 
   'أسرفوا': [
            'أَسْرَفُوا'], 
   'مستخف': [
           'مُسْتَخْفٍ'], 
   'اعلموا': [
            'اعْلَمُوا'], 
   'يأتمرون': [
             'يَأْتَمِرُونَ'], 
   'القديم': [
            'الْقَدِيمِ'], 
   'بأي': [
         'بِأَيِّ'], 
   'بذنوب': [
           'بِذُنُوبِ'], 
   'تأجرني': [
            'تَأْجُرَنِي'], 
   'ينفعهم': [
            'يَنْفَعُهُمْ'], 
   'بطريقتكم': [
              'بِطَرِيقَتِكُمُ'], 
   'باخع': [
          'بَاخِعٌ'], 
   'لتخرج': [
           'لِتُخْرِجَ'], 
   'يبخسون': [
            'يُبْخَسُونَ'], 
   'وأشركه': [
            'وَأَشْرِكْهُ'], 
   'سامري': [
           'سَامِرِيُّ'], 
   'تحكم': [
          'تَحْكُمُ'], 
   'وإنا': [
          'وَإِنَّا'], 
   'شكورا': [
           'شُكُورًا',
           'شَكُورًا'], 
   'والمهاجرين': [
                'وَالْمُهَاجِرِينَ'], 
   'أفلم': [
          'أَفَلَمْ'], 
   'مجذوذ': [
           'مَجْذُوذٍ'], 
   'فيحفكم': [
            'فَيُحْفِكُمْ'], 
   'فذلكن': [
           'فَذَلِكُنَّ'], 
   'وجلون': [
           'وَجِلُونَ'], 
   'بالآخرة': [
             'بِالْآخِرَةِ'], 
   'سامرا': [
           'سَامِرًا'], 
   'ومماتي': [
            'وَمَمَاتِي'], 
   'اكتالوا': [
             'اكْتَالُوا'], 
   'باللغو': [
            'بِاللَّغْوِ'], 
   'سراعا': [
           'سِرَاعًا'], 
   'وإنه': [
          'وَإِنَّهُ'], 
   'تؤدوا': [
           'تُؤَدُّوا'], 
   'وإنك': [
          'وَإِنَّكَ'], 
   'لعفو': [
          'لَعَفُوٌّ'], 
   'أفلا': [
          'أَفَلَا'], 
   'فخور': [
          'فَخُورٍ',
          'فَخُورٌ'], 
   'ولأحل': [
           'وَلِأُحِلَّ'], 
   'أفلت': [
          'أَفَلَتْ'], 
   'فوقع': [
          'فَوَقَعَ'], 
   'وإني': [
          'وَإِنِّي'], 
   'الموعود': [
             'الْمَوْعُودِ'], 
   'بأس': [
         'بَأْسٍ',
         'بَأْسَ',
         'بَأْسِ',
         'بَأْسٌ'], 
   'أحصاهم': [
            'أَحْصَاهُمْ'], 
   'فاتلوها': [
             'فَاتْلُوهَا'], 
   'آمن': [
         'آمَنَ',
         'آمِنْ'], 
   'نجوى': [
          'نَجْوَى'], 
   'وزلفا': [
           'وَزُلَفًا'], 
   'بأبصارهم': [
              'بِأَبْصَارِهِمْ'], 
   'دما': [
         'دَمًا'], 
   'بأخ': [
         'بِأَخٍ'], 
   'سفرنا': [
           'سَفَرِنَا'], 
   'وتالله': [
            'وَتَاللَّهِ'], 
   'مكروا': [
           'مَكَرُوا'], 
   'أفئدتهم': [
             'أَفْئِدَتُهُمْ',
             'أَفْئِدَتَهُمْ'], 
   'وبالكتاب': [
              'وَبِالْكِتَابِ'], 
   'تتركوا': [
            'تُتْرَكُوا'], 
   'ذهبوا': [
           'ذَهَبُوا'], 
   'ونحفظ': [
           'وَنَحْفَظُ'], 
   'ننج': [
         'نُنْجِ'], 
   'تتنزل': [
           'تَتَنَزَّلُ'], 
   'لمبتلين': [
             'لَمُبْتَلِينَ'], 
   'صرفنا': [
           'صَرَّفْنَا',
           'صَرَفْنَا'], 
   'وضرب': [
          'وَضَرَبَ'], 
   'احكم': [
          'احْكُمْ'], 
   'جهد': [
         'جَهْدَ'], 
   'مضل': [
         'مُضِلٍّ',
         'مُضِلٌّ'], 
   'قتلت': [
          'قُتِلَتْ',
          'قَتَلْتُ',
          'قَتَلْتَ'], 
   'امتحن': [
           'امْتَحَنَ'], 
   'تضربوا': [
            'تَضْرِبُوا'], 
   'الحجارة': [
             'الْحِجَارَةِ'], 
   'بالجنة': [
            'بِالْجَنَّةِ'], 
   'فأصابهم': [
             'فَأَصَابَهُمْ'], 
   'وينعه': [
           'وَيَنْعِهِ'], 
   'وسبحوه': [
            'وَسَبِّحُوهُ'], 
   'والطارق': [
             'وَالطَّارِقِ'], 
   'وآية': [
          'وَآيَةٌ',
          'وَآيَةً'], 
   'مضت': [
         'مَضَتْ'], 
   'قتله': [
          'قَتَلَهُ'], 
   'جمعكم': [
           'جَمْعُكُمْ'], 
   'وأقرضوا': [
             'وَأَقْرِضُوا',
             'وَأَقْرَضُوا'], 
   'ضعفاء': [
           'ضُعَفَاءُ'], 
   'استيسر': [
            'اسْتَيْسَرَ'], 
   'تابا': [
          'تَابَا'], 
   'تزاور': [
           'تَزَاوَرُ'], 
   'رحمناهم': [
             'رَحِمْنَاهُمْ'], 
   'علمتك': [
           'عَلَّمْتُكَ'], 
   'نمتعهم': [
            'نُمَتِّعُهُمْ'], 
   'علمته': [
           'عَلِمْتَهُ'], 
   'فأصابها': [
             'فَأَصَابَهَا'], 
   'علمتم': [
           'عَلِمْتُمْ',
           'عَلِمْتُمُ',
           'عَلَّمْتُمْ'], 
   'وذرني': [
           'وَذَرْنِي'], 
   'مختلف': [
           'مُخْتَلِفٌ',
           'مُخْتَلِفٍ'], 
   'ويريدون': [
             'وَيُرِيدُونَ'], 
   'بعبادتهم': [
              'بِعِبَادَتِهِمْ'], 
   'ولبثوا': [
            'وَلَبِثُوا'], 
   'مثلهن': [
           'مِثْلَهُنَّ'], 
   'مريضا': [
           'مَرِيضًا'], 
   'تفتأ': [
          'تَفْتَأُ'], 
   'يجده': [
          'يَجِدْهُ'], 
   'لتأتينكم': [
              'لَتَأْتِيَنَّكُمْ'], 
   'لتسألن': [
            'لَتُسْأَلُنَّ'], 
   'فماذا': [
           'فَمَاذَا'], 
   'قتلنا': [
           'قُتِلْنَا',
           'قَتَلْنَا'], 
   'والعبد': [
            'وَالْعَبْدُ'], 
   'حدود': [
          'حُدُودُ',
          'حُدُودَ'], 
   'صبروا': [
           'صَبَرُوا'], 
   'تهدي': [
          'تَهْدِي'], 
   'يغل': [
         'يَغُلَّ'], 
   'واتقوه': [
            'وَاتَّقُوهُ'], 
   'ثم': [
        'ثُمَّ',
        'ثَمَّ'], 
   'للمجرمين': [
              'لِلْمُجْرِمِينَ'], 
   'نفشت': [
          'نَفَشَتْ'], 
   'واتقون': [
            'وَاتَّقُونِ'], 
   'جزاؤهم': [
            'جَزَاؤُهُمْ'], 
   'تائبات': [
            'تَائِبَاتٍ'], 
   'مبارك': [
           'مُبَارَكٌ'], 
   'لبلاغا': [
            'لَبَلَاغًا'], 
   'يصيبهم': [
            'يُصِيبَهُمْ',
            'يُصِيبُهُمْ'], 
   'أردت': [
          'أَرَدْتُ'], 
   'سنسمه': [
           'سَنَسِمُهُ'], 
   'سلاما': [
           'سَلَامًا'], 
   'وصيلة': [
           'وَصِيلَةٍ'], 
   'عقيما': [
           'عَقِيمًا'], 
   'استهزئوا': [
              'اسْتَهْزِئُوا'], 
   'مسفرة': [
           'مُسْفِرَةٌ'], 
   'ولتكن': [
           'وَلْتَكُنْ'], 
   'الحواريون': [
               'الْحَوَارِيُّونَ'], 
   'تخشوا': [
           'تَخْشَوُا'], 
   'أعجزت': [
           'أَعَجَزْتُ'], 
   'معتد': [
          'مُعْتَدٍ'], 
   'تألمون': [
            'تَأْلَمُونَ'], 
   'كشف': [
         'كَشْفَ',
         'كَشَفَ'], 
   'أتهلكنا': [
             'أَتُهْلِكُنَا'], 
   'لأنزل': [
           'لَأَنْزَلَ'], 
   'لأسقيناهم': [
               'لَأَسْقَيْنَاهُمْ'], 
   'حثيثا': [
           'حَثِيثًا'], 
   'أعجمي': [
           'أَعْجَمِيٌّ'], 
   'الغافلين': [
              'الْغَافِلِينَ'], 
   'أشدكم': [
           'أَشُدَّكُمْ'], 
   'يحذرون': [
            'يَحْذَرُونَ'], 
   'تزيلوا': [
            'تَزَيَّلُوا'], 
   'تقضي': [
          'تَقْضِي'], 
   'فانتبذت': [
             'فَانْتَبَذَتْ'], 
   'وسرورا': [
            'وَسُرُورًا'], 
   'تخشوه': [
           'تَخْشَوْهُ'], 
   'تخشون': [
           'تَخْشَوْنَ'], 
   'برآء': [
          'بُرَآءُ'], 
   'ويلتا': [
           'وَيْلَتَا'], 
   'للتي': [
          'لِلَّتِي'], 
   'والعمل': [
            'وَالْعَمَلُ'], 
   'الرشد': [
           'الرُّشْدِ',
           'الرُّشْدُ'], 
   'مفترى': [
           'مُفْتَرًى'], 
   'وعلانية': [
             'وَعَلَانِيَةً'], 
   'منعهم': [
           'مَنَعَهُمْ'], 
   'ملكتم': [
           'مَلَكْتُمْ'], 
   'وجلة': [
          'وَجِلَةٌ'], 
   'وجلت': [
          'وَجِلَتْ'], 
   'وتصدية': [
            'وَتَصْدِيَةً'], 
   'صامتون': [
            'صَامِتُونَ'], 
   'وأقوم': [
           'وَأَقْوَمُ',
           'وَأَقْوَمَ'], 
   'لليسرى': [
            'لِلْيُسْرَى'], 
   'اتبعوهم': [
             'اتَّبَعُوهُمْ'], 
   'المجالس': [
             'الْمَجَالِسِ'], 
   'وملك': [
          'وَمُلْكٍ'], 
   'يضعن': [
          'يَضَعْنَ'], 
   'لعلهم': [
           'لَعَلَّهُمْ'], 
   'فيكون': [
           'فَيَكُونُ',
           'فَيَكُونَ'], 
   'بصدقهم': [
            'بِصِدْقِهِمْ'], 
   'حليما': [
           'حَلِيمًا'], 
   'الصدع': [
           'الصَّدْعِ'], 
   'لنخرج': [
           'لِنُخْرِجَ'], 
   'آتانا': [
           'آتَانَا'], 
   'تأتهم': [
           'تَأْتِهِمْ'], 
   'فأقامه': [
            'فَأَقَامَهُ'], 
   'أمامه': [
           'أَمَامَهُ'], 
   'والسقف': [
            'وَالسَّقْفِ'], 
   'أنجاهم': [
            'أَنْجَاهُمْ'], 
   'صوركم': [
           'صُوَرَكُمْ'], 
   'لبنيه': [
           'لِبَنِيهِ'], 
   'لبرز': [
          'لَبَرَزَ'], 
   'مهتدين': [
            'مُهْتَدِينَ'], 
   'يقولون': [
            'يَقُولُونَ'], 
   'الساعة': [
            'السَّاعَةُ',
            'السَّاعَةَ',
            'السَّاعَةِ'], 
   'واخشوا': [
            'وَاخْشَوْا'], 
   'عشيرتهم': [
             'عَشِيرَتَهُمْ'], 
   'إصرهم': [
           'إِصْرَهُمْ'], 
   'إنهما': [
           'إِنَّهُمَا'], 
   'لنت': [
         'لِنْتَ'], 
   'برسل': [
          'بِرُسُلٍ'], 
   'لنا': [
         'لَنَا'], 
   'تنكصون': [
            'تَنْكِصُونَ'], 
   'فشربوا': [
            'فَشَرِبُوا'], 
   'تبرءوا': [
            'تَبَرَّءُوا'], 
   'لقالوا': [
            'لَقَالُوا'], 
   'تعجبون': [
            'تَعْجَبُونَ'], 
   'بأيدي': [
           'بِأَيْدِي'], 
   'أنكالا': [
            'أَنْكَالًا'], 
   'يقولوا': [
            'يَقُولُوا'], 
   'النصير': [
            'النَّصِيرُ'], 
   'واخشون': [
            'وَاخْشَوْنِ'], 
   'سننظر': [
           'سَنَنْظُرُ'], 
   'بمؤمنين': [
             'بِمُؤْمِنِينَ'], 
   'تمدن': [
          'تَمُدَّنَّ'], 
   'بدلا': [
          'بَدَلًا'], 
   'تستفت': [
           'تَسْتَفْتِ'], 
   'يتقدم': [
           'يَتَقَدَّمَ'], 
   'يحسنون': [
            'يُحْسِنُونَ'], 
   'آتاني': [
           'آتَانِيَ'], 
   'ورسالاته': [
              'وَرِسَالَاتِهِ'], 
   'خامدين': [
            'خَامِدِينَ'], 
   'رجلان': [
           'رَجُلَانِ'], 
   'بهادي': [
           'بِهَادِي'], 
   'وبينهما': [
             'وَبَيْنَهُمَا'], 
   'أسلما': [
           'أَسْلَمَا'], 
   'سيعلمون': [
             'سَيَعْلَمُونَ'], 
   'أشدهما': [
            'أَشُدَّهُمَا'], 
   'الزكاة': [
            'الزَّكَاةَ',
            'الزَّكَاةِ'], 
   'أسلمت': [
           'أَسْلَمْتُ'], 
   'مددناها': [
             'مَدَدْنَاهَا'], 
   'أمه': [
         'أُمُّهُ',
         'أُمِّهِ'], 
   'أمن': [
         'أَمَّنْ',
         'أَمِنَ'], 
   'أمم': [
         'أُمَمٍ',
         'أُمَمٌ'], 
   'أمك': [
         'أُمِّكَ',
         'أُمُّكِ'], 
   'ونخزى': [
           'وَنَخْزَى'], 
   'وحرام': [
           'وَحَرَامٌ'], 
   'أصلاتك': [
            'أَصَلَاتُكَ'], 
   'وبرسولي': [
             'وَبِرَسُولِي'], 
   'فوفاه': [
           'فَوَفَّاهُ'], 
   'سحروا': [
           'سَحَرُوا'], 
   'واسع': [
          'وَاسِعٌ',
          'وَاسِعُ'], 
   'صابرون': [
            'صَابِرُونَ'], 
   'تتجافى': [
            'تَتَجَافَى'], 
   'دكت': [
         'دُكَّتِ'], 
   'تتبعونا': [
             'تَتَّبِعُونَا'], 
   'اتبعت': [
           'اتَّبَعْتَ'], 
   'يزوجهم': [
            'يُزَوِّجُهُمْ'], 
   'ليال': [
          'لَيَالٍ'], 
   'قروء': [
          'قُرُوءٍ'], 
   'يستفتحون': [
              'يَسْتَفْتِحُونَ'], 
   'فنجعل': [
           'فَنَجْعَلْ'], 
   'يجدون': [
           'يَجِدُونَ'], 
   'وزاده': [
           'وَزَادَهُ'], 
   'المجرمون': [
              'الْمُجْرِمُونَ'], 
   'ونوحا': [
           'وَنُوحًا'], 
   'فأصبحتم': [
             'فَأَصْبَحْتُمْ'], 
   'محيص': [
          'مَحِيصٍ'], 
   'محيط': [
          'مُحِيطٌ',
          'مُحِيطٍ'], 
   'وقفينا': [
            'وَقَفَّيْنَا'], 
   'اركبوا': [
            'ارْكَبُوا'], 
   'العنكبوت': [
              'الْعَنْكَبُوتِ'], 
   'الغابرين': [
              'الْغَابِرِينَ'], 
   'فأغرقناهم': [
               'فَأَغْرَقْنَاهُمْ'], 
   'قلوب': [
          'قُلُوبِ',
          'قُلُوبٌ',
          'قُلُوبُ',
          'قُلُوبٍ'], 
   'تشرك': [
          'تُشْرِكْ',
          'تُشْرِكَ'], 
   'يجدوا': [
           'يَجِدُوا'], 
   'جدالنا': [
            'جِدَالَنَا'], 
   'وفوق': [
          'وَفَوْقَ'], 
   'وعندهم': [
            'وَعِنْدَهُمْ',
            'وَعِنْدَهُمُ'], 
   'وارزقهم': [
             'وَارْزُقْهُمْ'], 
   'جفاء': [
          'جُفَاءً'], 
   'أما': [
         'أَمَّا'], 
   'ورابطوا': [
             'وَرَابِطُوا'], 
   'نتخذه': [
           'نَتَّخِذَهُ'], 
   'فللذكر': [
            'فَلِلذَّكَرِ'], 
   'ليخرج': [
           'لِيُخْرِجَ'], 
   'يدخلونها': [
              'يَدْخُلُونَهَا'], 
   'حصاده': [
           'حَصَادِهِ'], 
   'ننزل': [
          'نُنَزِّلْ',
          'نُنَزِّلُ'], 
   'مفسدون': [
            'مُفْسِدُونَ'], 
   'النسيء': [
            'النَّسِيءُ'], 
   'أمة': [
         'أُمَّةٍ',
         'أُمَّةً',
         'أُمَّةٌ'], 
   'اتبعن': [
           'اتَّبَعَنِ'], 
   'اتبعك': [
           'اتَّبَعَكَ'], 
   'يغرنك': [
           'يَغُرَّنَّكَ'], 
   'أمر': [
         'أَمْرُ',
         'أَمْرِ',
         'أَمْرٍ',
         'أَمَرَ',
         'أَمْرَ',
         'أَمْرٌ'], 
   'لعملكم': [
            'لِعَمَلِكُمْ'], 
   'فأنزلنا': [
             'فَأَنْزَلْنَا'], 
   'ولدان': [
           'وِلْدَانٌ'], 
   'فأخذتهم': [
             'فَأَخَذَتْهُمُ',
             'فَأَخَذْتُهُمْ',
             'فَأَخَذَتْهُمْ'], 
   'غيث': [
         'غَيْثٍ'], 
   'نائمون': [
            'نَائِمُونَ'], 
   'غيب': [
         'غَيْبُ',
         'غَيْبَ',
         'غَيْبِ'], 
   'غيا': [
         'غَيًّا'], 
   'بالجنب': [
            'بِالْجَنْبِ'], 
   'وأنعمت': [
            'وَأَنْعَمْتَ'], 
   'زرع': [
         'زَرْعٍ'], 
   'وليتم': [
           'وَلَّيْتُمْ',
           'وَلِيُتِمَّ'], 
   'هون': [
         'هُونٍ'], 
   'تعلوا': [
           'تَعْلُوا'], 
   'يخرجاكم': [
             'يُخْرِجَاكُمْ'], 
   'يبينها': [
            'يُبَيِّنُهَا'], 
   'وليتق': [
           'وَلْيَتَّقِ'], 
   'يتم': [
         'يُتِمَّ',
         'يُتِمُّ'], 
   'يتق': [
         'يَتَّقِ'], 
   'غير': [
         'غَيْرَ',
         'غَيْرُ',
         'غَيْرِ'], 
   'ندخلها': [
            'نَدْخُلَهَا'], 
   'فألقاها': [
             'فَأَلْقَاهَا'], 
   'ويرضى': [
           'وَيَرْضَى'], 
   'ويمددكم': [
             'وَيُمْدِدْكُمْ'], 
   'يفر': [
         'يَفِرُّ'], 
   'ويمح': [
          'وَيَمْحُ'], 
   'المص': [
          'المص'], 
   'والمقيمين': [
               'وَالْمُقِيمِينَ'], 
   'فننبئكم': [
             'فَنُنَبِّئُكُمْ'], 
   'وإنهم': [
           'وَإِنَّهُمْ'], 
   'استويتم': [
             'اسْتَوَيْتُمْ'], 
   'موئلا': [
           'مَوْئِلًا'], 
   'وعمله': [
           'وَعَمَلِهِ'], 
   'صرفا': [
          'صَرْفًا'], 
   'سكن': [
         'سَكَنَ',
         'سَكَنٌ'], 
   'بضع': [
         'بِضْعِ',
         'بِضْعَ'], 
   'يستطيعون': [
              'يَسْتَطِيعُونَ'], 
   'ويتعلمون': [
              'وَيَتَعَلَّمُونَ'], 
   'فيئوس': [
           'فَيَئُوسٌ'], 
   'صرفت': [
          'صُرِفَتْ'], 
   'والولدان': [
              'وَالْوِلْدَانِ'], 
   'يحمل': [
          'يَحْمِلُ',
          'يُحْمَلْ'], 
   'فتمنوا': [
            'فَتَمَنَّوُا'], 
   'يوسف': [
          'يُوسُفَ',
          'يُوسُفُ'], 
   'عبس': [
         'عَبَسَ'], 
   'فاليوم': [
            'فَالْيَوْمَ'], 
   'الحنث': [
           'الْحِنْثِ'], 
   'انفخوا': [
            'انْفُخُوا'], 
   'ألقاها': [
            'أَلْقَاهَا'], 
   'تحته': [
          'تَحْتَهُ'], 
   'وإنها': [
           'وَإِنَّهَا'], 
   'وأخبتوا': [
             'وَأَخْبَتُوا'], 
   'مذموم': [
           'مَذْمُومٌ'], 
   'ألهاكم': [
            'أَلْهَاكُمُ'], 
   'أسلفتم': [
            'أَسْلَفْتُمْ'], 
   'إليكم': [
           'إِلَيْكُمْ',
           'إِلَيْكُمُ'], 
   'لتبعثن': [
            'لَتُبْعَثُنَّ'], 
   'الكفار': [
            'الْكُفَّارِ',
            'الْكُفَّارَ',
            'الْكُفَّارُ'], 
   'الضعفاء': [
             'الضُّعَفَاءُ',
             'الضُّعَفَاءِ'], 
   'أحسنتم': [
            'أَحْسَنْتُمْ'], 
   'تنصرون': [
            'تُنْصَرُونَ'], 
   'وإلياس': [
            'وَإِلْيَاسَ'], 
   'ينصركم': [
            'يَنْصُرُكُمْ',
            'يَنْصُرْكُمْ',
            'يَنْصُرْكُمُ'], 
   'المقامة': [
             'الْمُقَامَةِ'], 
   'أشياء': [
           'أَشْيَاءَ'], 
   'تحتك': [
          'تَحْتَكِ'], 
   'ولدار': [
           'وَلَدَارُ'], 
   'يجيرني': [
            'يُجِيرَنِي'], 
   'رسولها': [
            'رَسُولُهَا'], 
   'هود': [
         'هُودٍ',
         'هُودُ',
         'هُودٌ'], 
   'تولى': [
          'تَوَلَّى'], 
   'منير': [
          'مُنِيرٍ'], 
   'فليؤمن': [
            'فَلْيُؤْمِنْ'], 
   'يبدلهما': [
             'يُبْدِلَهُمَا'], 
   'آلآن': [
          'آلْآنَ'], 
   'تتبيب': [
           'تَتْبِيبٍ'], 
   'واد': [
         'وَادِ',
         'وَادٍ'], 
   'المعصرات': [
              'الْمُعْصِرَاتِ'], 
   'مأكول': [
           'مَأْكُولٍ'], 
   'والفتح': [
            'وَالْفَتْحُ'], 
   'منيب': [
          'مُنِيبٍ',
          'مُنِيبٌ'], 
   'لجعلنا': [
            'لَجَعَلْنَا'], 
   'مرجعهم': [
            'مَرْجِعُهُمْ',
            'مَرْجِعَهُمْ'], 
   'واجنبني': [
             'وَاجْنُبْنِي'], 
   'المغرب': [
            'الْمَغْرِبِ'], 
   'فسينغضون': [
              'فَسَيُنْغِضُونَ'], 
   'معيشتها': [
             'مَعِيشَتَهَا'], 
   'ولعلهم': [
            'وَلَعَلَّهُمْ'], 
   'فقنا': [
          'فَقِنَا'], 
   'ولهو': [
          'وَلَهْوٌ'], 
   'فافتح': [
           'فَافْتَحْ'], 
   'بالعهد': [
            'بِالْعَهْدِ'], 
   'يفرطون': [
            'يُفَرِّطُونَ'], 
   'شرعوا': [
           'شَرَعُوا'], 
   'ليخرجكم': [
             'لِيُخْرِجَكُمْ'], 
   'الأعين': [
            'الْأَعْيُنِ',
            'الْأَعْيُنُ'], 
   'ظهر': [
         'ظَهَرَ'], 
   'ليقض': [
          'لِيَقْضِ'], 
   'لاقيه': [
           'لَاقِيهِ'], 
   'معيشتهم': [
             'مَعِيشَتَهُمْ'], 
   'واعبد': [
           'وَاعْبُدْ'], 
   'يسجدان': [
            'يَسْجُدَانِ'], 
   'مسكنهم': [
            'مَسْكَنِهِمْ'], 
   'وأجمعوا': [
             'وَأَجْمَعُوا'], 
   'إياكم': [
           'إِيَّاكُمْ'], 
   'فلانا': [
           'فُلَانًا'], 
   'بشيرا': [
           'بَشِيرًا'], 
   'لنؤمنن': [
            'لَنُؤْمِنَنَّ'], 
   'وأقم': [
          'وَأَقِمِ'], 
   'وأقل': [
          'وَأَقُلْ',
          'وَأَقَلُّ'], 
   'وفواكه': [
            'وَفَوَاكِهَ'], 
   'يقصرون': [
            'يُقْصِرُونَ'], 
   'والضحى': [
            'وَالضُّحَى'], 
   'فسيؤتيه': [
             'فَسَيُؤْتِيهِ'], 
   'وعدده': [
           'وَعَدَّدَهُ'], 
   'يبايعنك': [
             'يُبَايِعْنَكَ'], 
   'لتدخلن': [
            'لَتَدْخُلُنَّ'], 
   'المتقين': [
             'الْمُتَّقِينَ'], 
   'دفعتم': [
           'دَفَعْتُمْ'], 
   'تدعونني': [
             'تَدْعُونَنِي'], 
   'وال': [
         'وَالٍ'], 
   'حدوده': [
           'حُدُودَهُ'], 
   'واق': [
         'وَاقٍ'], 
   'كزرع': [
          'كَزَرْعٍ'], 
   'منامك': [
           'مَنَامِكَ'], 
   'وفيكم': [
           'وَفِيكُمْ'], 
   'تضعون': [
           'تَضَعُونَ'], 
   'أمهاتكم': [
             'أُمَّهَاتِكُمْ',
             'أُمَّهَاتُكُمْ'], 
   'لتكونوا': [
             'لِتَكُونُوا'], 
   'ومقام': [
           'وَمَقَامٍ'], 
   'وخرقوا': [
            'وَخَرَقُوا'], 
   'والمشركين': [
               'وَالْمُشْرِكِينَ'], 
   'ونكتب': [
           'وَنَكْتُبُ'], 
   'وفرادى': [
            'وَفُرَادَى'], 
   'قسم': [
         'قَسَمٌ'], 
   'وبرسوله': [
             'وَبِرَسُولِهِ'], 
   'أولياؤكم': [
              'أَوْلِيَاؤُكُمْ'], 
   'شدادا': [
           'شِدَادًا'], 
   'الأمانة': [
             'الْأَمَانَةَ'], 
   'وأخواتكم': [
              'وَأَخَوَاتُكُمْ'], 
   'ويرزقه': [
            'وَيَرْزُقْهُ'], 
   'آخره': [
          'آخِرَهُ'], 
   'أنزله': [
           'أَنْزَلَهُ'], 
   'بالمغفرة': [
              'بِالْمَغْفِرَةِ'], 
   'تشهدون': [
            'تَشْهَدُونَ',
            'تَشْهَدُونِ'], 
   'ونفصل': [
           'وَنُفَصِّلُ'], 
   'يعجبك': [
           'يُعْجِبُكَ'], 
   'وليعفوا': [
             'وَلْيَعْفُوا'], 
   'نبغي': [
          'نَبْغِي'], 
   'المرافق': [
             'الْمَرَافِقِ'], 
   'فذرني': [
           'فَذَرْنِي'], 
   'يخفف': [
          'يُخَفَّفُ',
          'يُخَفِّفْ',
          'يُخَفِّفَ'], 
   'ذواتي': [
           'ذَوَاتَيْ'], 
   'يخفى': [
          'يَخْفَى'], 
   'نؤتها': [
           'نُؤْتِهَا'], 
   'فساء': [
          'فَسَاءَ'], 
   'أيحب': [
          'أَيُحِبُّ'], 
   'يتماسا': [
            'يَتَمَاسَّا'], 
   'زعمت': [
          'زَعَمْتَ'], 
   'السفهاء': [
             'السُّفَهَاءُ',
             'السُّفَهَاءَ'], 
   'لنصرف': [
           'لِنَصْرِفَ'], 
   'وقدت': [
          'وَقَدَّتْ'], 
   'مذبذبين': [
             'مُذَبْذَبِينَ'], 
   'يسمعها': [
            'يَسْمَعْهَا'], 
   'حصيرا': [
           'حَصِيرًا'], 
   'وقدر': [
          'وَقَدَّرَ',
          'وَقَدِّرْ'], 
   'ذواتا': [
           'ذَوَاتَا'], 
   'أسلحتهم': [
             'أَسْلِحَتَهُمْ'], 
   'وظللنا': [
            'وَظَلَّلْنَا'], 
   'هاوية': [
           'هَاوِيَةٌ'], 
   'حرضا': [
          'حَرَضًا'], 
   'وعميانا': [
             'وَعُمْيَانًا'], 
   'لكنا': [
          'لَكُنَّا',
          'لَكِنَّا'], 
   'تضعوا': [
           'تَضَعُوا'], 
   'فبشرهم': [
            'فَبَشِّرْهُمْ'], 
   'فأنجيناكم': [
               'فَأَنْجَيْنَاكُمْ'], 
   'الخناس': [
            'الْخَنَّاسِ'], 
   'لكنت': [
          'لَكُنْتُ'], 
   'لكنود': [
           'لَكَنُودٌ'], 
   'كاتبين': [
            'كَاتِبِينَ'], 
   'إفكهم': [
           'إِفْكِهِمْ',
           'إِفْكُهُمْ'], 
   'فأنزل': [
           'فَأَنْزَلَ'], 
   'غداءنا': [
            'غَدَاءَنَا'], 
   'مصدق': [
          'مُصَدِّقٌ',
          'مُصَدِّقُ'], 
   'قياما': [
           'قِيَامًا'], 
   'استطاعوا': [
              'اسْتَطَاعُوا'], 
   'داموا': [
           'دَامُوا'], 
   'دون': [
         'دُونِ',
         'دُونَ'], 
   'هذا': [
         'هَذَا'], 
   'يريدا': [
           'يُرِيدَا'], 
   'تسطع': [
          'تَسْطِعْ'], 
   'تشكروا': [
            'تَشْكُرُوا'], 
   'يهديكم': [
            'يَهْدِيكُمْ'], 
   'ولدا': [
          'وَلَدًا'], 
   'سخرها': [
           'سَخَّرَهَا'], 
   'فأغنى': [
           'فَأَغْنَى'], 
   'سنمتعهم': [
             'سَنُمَتِّعُهُمْ'], 
   'فلنسألن': [
             'فَلَنَسْأَلَنَّ'], 
   'اعبدوا': [
            'اعْبُدُوا'], 
   'واضربوهن': [
              'وَاضْرِبُوهُنَّ'], 
   'ولدت': [
          'وُلِدْتُ'], 
   'وضاقت': [
           'وَضَاقَتْ'], 
   'تسقي': [
          'تَسْقِي'], 
   'بذنوبهم': [
             'بِذُنُوبِهِمْ'], 
   'ورهبانية': [
              'وَرَهْبَانِيَّةً'], 
   'بأمره': [
           'بِأَمْرِهِ'], 
   'فاتبعوه': [
             'فَاتَّبِعُوهُ',
             'فَاتَّبَعُوهُ'], 
   'يتربصن': [
            'يَتَرَبَّصْنَ'], 
   'ادخل': [
          'ادْخُلِ'], 
   'ذكرهم': [
           'ذِكْرِهِمْ'], 
   'وانتصروا': [
              'وَانْتَصَرُوا'], 
   'ومنهاجا': [
             'وَمِنْهَاجًا'], 
   'بالغيه': [
            'بَالِغِيهِ'], 
   'الأدنى': [
            'الْأَدْنَى'], 
   'يكسب': [
          'يَكْسِبْ'], 
   'عابدين': [
            'عَابِدِينَ'], 
   'يسارعون': [
             'يُسَارِعُونَ'], 
   'ليواطئوا': [
              'لِيُوَاطِئُوا'], 
   'آتينا': [
           'آتَيْنَا'], 
   'فاتبعوا': [
             'فَاتَّبِعُوا',
             'فَاتَّبَعُوا'], 
   'أزواجك': [
            'أَزْوَاجِكَ',
            'أَزْوَاجَكَ'], 
   'نهارا': [
           'نَهَارًا'], 
   'يثبت': [
          'يُثَبِّتُ'], 
   'اتسق': [
          'اتَّسَقَ'], 
   'شئتم': [
          'شِئْتُمْ'], 
   'والبلد': [
            'وَالْبَلَدُ'], 
   'آذنتكم': [
            'آذَنْتُكُمْ'], 
   'نجانا': [
           'نَجَّانَا'], 
   'غربية': [
           'غَرْبِيَّةٍ'], 
   'لأولنا': [
            'لِأَوَّلِنَا'], 
   'فيغرقكم': [
             'فَيُغْرِقَكُمْ'], 
   'كاملة': [
           'كَامِلَةٌ',
           'كَامِلَةً'], 
   'متفرقة': [
            'مُتَفَرِّقَةٍ'], 
   'فجرت': [
          'فُجِّرَتْ'], 
   'أجلت': [
          'أُجِّلَتْ',
          'أَجَّلْتَ'], 
   'تسقط': [
          'تُسْقِطَ',
          'تَسْقُطُ'], 
   'فيم': [
         'فِيمَ'], 
   'يغادر': [
           'يُغَادِرُ'], 
   'فيه': [
         'فِيهِ'], 
   'تكسب': [
          'تَكْسِبُ'], 
   'وقضبا': [
           'وَقَضْبًا'], 
   'لمجنون': [
            'لَمَجْنُونٌ'], 
   'وأكدى': [
           'وَأَكْدَى'], 
   'لجاعلون': [
             'لَجَاعِلُونَ'], 
   'ويحبون': [
            'وَيُحِبُّونَ'], 
   'ونجعلهم': [
             'وَنَجْعَلَهُمْ',
             'وَنَجْعَلَهُمُ'], 
   'هذه': [
         'هَذِهِ'], 
   'وزينا': [
           'وَزَيَّنَّا'], 
   'تشكرون': [
            'تَشْكُرُونَ'], 
   'لجعله': [
           'لَجَعَلَهُ'], 
   'ولده': [
          'وَلَدِهِ'], 
   'جئتكم': [
           'جِئْتُكُمْ'], 
   'يجحدون': [
            'يَجْحَدُونَ'], 
   'وأمددناكم': [
               'وَأَمْدَدْنَاكُمْ'], 
   'جاوزه': [
           'جَاوَزَهُ'], 
   'والسائلين': [
               'وَالسَّائِلِينَ'], 
   'وضلوا': [
           'وَضَلُّوا'], 
   'رجع': [
         'رَجْعٌ',
         'رَجَعَ'], 
   'قصاص': [
          'قِصَاصٌ'], 
   'رجز': [
         'رِجْزٍ',
         'رِجْزَ'], 
   'رجس': [
         'رِجْسٌ'], 
   'فسأكتبها': [
              'فَسَأَكْتُبُهَا'], 
   'ومنا': [
          'وَمِنَّا'], 
   'رجت': [
         'رُجَّتِ'], 
   'بالغداة': [
             'بِالْغَدَاةِ'], 
   'مسفوحا': [
            'مَسْفُوحًا'], 
   'خطبك': [
          'خَطْبُكَ'], 
   'ولهديناهم': [
               'وَلَهَدَيْنَاهُمْ'], 
   'يغفروا': [
            'يَغْفِرُوا'], 
   'وتقولوا': [
             'وَتَقُولُوا'], 
   'لفيفا': [
           'لَفِيفًا'], 
   'الغافلون': [
              'الْغَافِلُونَ'], 
   'ويحسبون': [
             'وَيَحْسَبُونَ'], 
   'بجانب': [
           'بِجَانِبِ'], 
   'ونحشره': [
            'وَنَحْشُرُهُ'], 
   'وأفئدتهم': [
              'وَأَفْئِدَتُهُمْ'], 
   'وزرابي': [
            'وَزَرَابِيُّ'], 
   'ألست': [
          'أَلَسْتُ'], 
   'وخروا': [
           'وَخَرُّوا'], 
   'فسقى': [
          'فَسَقَى'], 
   'فأين': [
          'فَأَيْنَ'], 
   'وللرجال': [
             'وَلِلرِّجَالِ'], 
   'والأحبار': [
              'وَالْأَحْبَارُ'], 
   'وتقولون': [
             'وَتَقُولُونَ'], 
   'الملوك': [
            'الْمُلُوكَ'], 
   'جنوبكم': [
            'جُنُوبِكُمْ'], 
   'أفبهذا': [
            'أَفَبِهَذَا'], 
   'صيام': [
          'صِيَامٍ'], 
   'ليزلقونك': [
              'لَيُزْلِقُونَكَ'], 
   'والربانيون': [
                'وَالرَّبَّانِيُّونَ'], 
   'يطغى': [
          'يَطْغَى'], 
   'إدا': [
         'إِدًّا'], 
   'ونفخت': [
           'وَنَفَخْتُ'], 
   'فسقا': [
          'فِسْقًا'], 
   'ليحاجوكم': [
              'لِيُحَاجُّوكُمْ'], 
   'يتبدل': [
           'يَتَبَدَّلِ'], 
   'وعاشروهن': [
              'وَعَاشِرُوهُنَّ'], 
   'فليلقه': [
            'فَلْيُلْقِهِ'], 
   'خيانتك': [
            'خِيَانَتَكَ'], 
   'هاجرن': [
           'هَاجَرْنَ'], 
   'لسنتنا': [
            'لِسُنَّتِنَا'], 
   'بمخرجين': [
             'بِمُخْرَجِينَ'], 
   'وجيء': [
          'وَجِيءَ'], 
   'فردوه': [
           'فَرُدُّوهُ'], 
   'طيبين': [
           'طَيِّبِينَ'], 
   'ذرهم': [
          'ذَرْهُمْ'], 
   'الضرر': [
           'الضَّرَرِ'], 
   'المستقدمين': [
                'الْمُسْتَقْدِمِينَ'], 
   'ومنه': [
          'وَمِنْهُ'], 
   'وقطعنا': [
            'وَقَطَعْنَا'], 
   'أعجبكم': [
            'أَعْجَبَكُمْ'], 
   'ومنك': [
          'وَمِنْكَ'], 
   'تيسر': [
          'تَيَسَّرَ'], 
   'رجل': [
         'رَجُلٌ',
         'رَجُلٍ'], 
   'ثيابهن': [
            'ثِيَابَهُنَّ'], 
   'وقارا': [
           'وَقَارًا'], 
   'تصعر': [
          'تُصَعِّرْ'], 
   'فخلقنا': [
            'فَخَلَقْنَا'], 
   'الوعيد': [
            'الْوَعِيدِ'], 
   'سمعهم': [
           'سَمْعُهُمْ',
           'سَمْعِهِمْ'], 
   'وأذن': [
          'وَأَذِّنْ'], 
   'ونهارا': [
            'وَنَهَارًا'], 
   'ليبطئن': [
            'لَيُبَطِّئَنَّ'], 
   'أنكاثا': [
            'أَنْكَاثًا'], 
   'وليرضوه': [
             'وَلِيَرْضَوْهُ'], 
   'فاستمسك': [
             'فَاسْتَمْسِكْ'], 
   'لنثبت': [
           'لِنُثَبِّتَ'], 
   'اتبعتم': [
            'اتَّبَعْتُمْ'], 
   'فاعتزلوا': [
              'فَاعْتَزِلُوا'], 
   'رفعت': [
          'رُفِعَتْ'], 
   'فلأنفسكم': [
              'فَلِأَنْفُسِكُمْ'], 
   'خذوا': [
          'خُذُوا'], 
   'بقلب': [
          'بِقَلْبٍ'], 
   'وكبير': [
           'وَكَبِيرٍ'], 
   'ببعيد': [
           'بِبَعِيدٍ'], 
   'فغشاها': [
            'فَغَشَّاهَا'], 
   'ثقالا': [
           'ثِقَالًا'], 
   'فاقطعوا': [
             'فَاقْطَعُوا'], 
   'ممرد': [
          'مُمَرَّدٌ'], 
   'ينيب': [
          'يُنِيبُ'], 
   'لنذهبن': [
            'لَنَذْهَبَنَّ'], 
   'يتخذون': [
            'يَتَّخِذُونَ'], 
   'يتخذوه': [
            'يَتَّخِذُوهُ'], 
   'فاجرا': [
           'فَاجِرًا'], 
   'بالدين': [
            'بِالدِّينِ'], 
   'يحكمونك': [
             'يُحَكِّمُونَكَ'], 
   'والإشراق': [
              'وَالْإِشْرَاقِ'], 
   'ورحمة': [
           'وَرَحْمَةً',
           'وَرَحْمَةٌ'], 
   'ورحمت': [
           'وَرَحْمَتُ'], 
   'يحمدوا': [
            'يُحْمَدُوا'], 
   'وليتمتعوا': [
               'وَلِيَتَمَتَّعُوا'], 
   'أعقابنا': [
             'أَعْقَابِنَا'], 
   'الظالم': [
            'الظَّالِمِ',
            'الظَّالِمُ'], 
   'يكبر': [
          'يَكْبُرُ'], 
   'وأحلوا': [
            'وَأَحَلُّوا'], 
   'وأوحينا': [
             'وَأَوْحَيْنَا'], 
   'يتخذوا': [
            'يَتَّخِذُوا'], 
   'عريض': [
          'عَرِيضٍ'], 
   'لله': [
         'لِلَّهِ'], 
   'لاغية': [
           'لَاغِيَةً'], 
   'تشتهي': [
           'تَشْتَهِي'], 
   'مسحورون': [
             'مَسْحُورُونَ'], 
   'دان': [
         'دَانٍ'], 
   'لكثير': [
           'لِكَثِيرٍ'], 
   'صما': [
         'صُمًّا'], 
   'قضيتم': [
           'قَضَيْتُمْ',
           'قَضَيْتُمُ'], 
   'فاعتزلون': [
              'فَاعْتَزِلُونِ'], 
   'بالله': [
           'بِاللَّهِ'], 
   'خذوه': [
          'خُذُوهُ'], 
   'نساؤكم': [
            'نِسَاؤُكُمْ'], 
   'غشاوة': [
           'غِشَاوَةٌ',
           'غِشَاوَةً'], 
   'واستغفري': [
              'وَاسْتَغْفِرِي'], 
   'فقربه': [
           'فَقَرَّبَهُ'], 
   'وبارك': [
           'وَبَارَكَ'], 
   'صدوركم': [
            'صُدُورِكُمْ'], 
   'لعلمه': [
           'لَعَلِمَهُ'], 
   'فليستأذنوا': [
                'فَلْيَسْتَأْذِنُوا'], 
   'يعرف': [
          'يُعْرَفُ'], 
   'أوعظت': [
           'أَوَعَظْتَ'], 
   'وندخلكم': [
             'وَنُدْخِلْكُمْ'], 
   'وكيل': [
          'وَكِيلٌ'], 
   'بردهن': [
           'بِرَدِّهِنَّ'], 
   'يقتلوك': [
            'يَقْتُلُوكَ'], 
   'وكيف': [
          'وَكَيْفَ'], 
   'رضوا': [
          'رَضُوا'], 
   'أستخلصه': [
             'أَسْتَخْلِصْهُ'], 
   'يهجعون': [
            'يَهْجَعُونَ'], 
   'يقاتلون': [
             'يُقَاتِلُونَ',
             'يُقَاتَلُونَ'], 
   'فبايعهن': [
             'فَبَايِعْهُنَّ'], 
   'تضل': [
         'تُضِلُّ',
         'تَضِلَّ'], 
   'قليل': [
          'قَلِيلٌ',
          'قَلِيلٍ'], 
   'وتبتل': [
           'وَتَبَتَّلْ'], 
   'سأل': [
         'سَأَلَ'], 
   'فقذفناها': [
              'فَقَذَفْنَاهَا'], 
   'رجوما': [
           'رُجُومًا'], 
   'وحريرا': [
            'وَحَرِيرًا'], 
   'يشاء': [
          'يَشَاءُ',
          'يَشَاءَ'], 
   'البرية': [
            'الْبَرِيَّةِ'], 
   'أعينكم': [
            'أَعْيُنِكُمْ',
            'أَعْيُنُكُمْ'], 
   'وترهقهم': [
             'وَتَرْهَقُهُمْ'], 
   'صعدا': [
          'صَعَدًا'], 
   'خذ': [
        'خُذِ',
        'خُذْ'], 
   'خر': [
        'خَرَّ'], 
   'يرزق': [
          'يَرْزُقُ'], 
   'وتنحتون': [
             'وَتَنْحِتُونَ'], 
   'وبلغت': [
           'وَبَلَغَتِ'], 
   'وفيه': [
          'وَفِيهِ'], 
   'موعدكم': [
            'مَوْعِدُكُمْ'], 
   'سويا': [
          'سَوِيًّا'], 
   'كرماد': [
           'كَرَمَادٍ'], 
   'رجما': [
          'رَجْمًا'], 
   'ضللت': [
          'ضَلَلْتُ'], 
   'يشاق': [
          'يُشَاقِّ'], 
   'تجزون': [
           'تُجْزَوْنَ'], 
   'وأخرجت': [
            'وَأَخْرَجَتِ'], 
   'فأخذهم': [
            'فَأَخَذَهُمُ',
            'فَأَخَذَهُمْ'], 
   'لقلوبكم': [
             'لِقُلُوبِكُمْ'], 
   'سنعذبهم': [
             'سَنُعَذِّبُهُمْ'], 
   'وانصروا': [
             'وَانْصُرُوا'], 
   'رزقناهم': [
             'رَزَقْنَاهُمْ'], 
   'تضع': [
         'تَضَعُ',
         'تَضَعَ'], 
   'يعرج': [
          'يَعْرُجُ'], 
   'تحيطوا': [
            'تُحِيطُوا'], 
   'مغارات': [
            'مَغَارَاتٍ'], 
   'فضلنا': [
           'فَضَّلْنَا',
           'فَضَّلَنَا'], 
   'أغير': [
          'أَغَيْرَ'], 
   'ويذهب': [
           'وَيُذْهِبْ',
           'وَيُذْهِبَ'], 
   'فآتت': [
          'فَآتَتْ'], 
   'يقتلوا': [
            'يُقَتَّلُوا'], 
   'ويزيد': [
           'وَيَزِيدُ'], 
   'لهاد': [
          'لَهَادِ'], 
   'أكن': [
         'أَكُنْ'], 
   'يقاتلوا': [
             'يُقَاتِلُوا'], 
   'يعرض': [
          'يُعْرَضُ',
          'يُعْرِضْ'], 
   'البغضاء': [
             'الْبَغْضَاءُ'], 
   'كفارا': [
           'كُفَّارًا',
           'كَفَّارًا'], 
   'كفارة': [
           'كَفَّارَةٌ',
           'كَفَّارَةُ'], 
   'عرفها': [
           'عَرَّفَهَا'], 
   'تراهم': [
           'تَرَاهُمْ'], 
   'كشفت': [
          'كَشَفْتَ'], 
   'بلغ': [
         'بَلَغَ',
         'بَلِّغْ'], 
   'يبطش': [
          'يَبْطِشَ'], 
   'انبعث': [
           'انْبَعَثَ'], 
   'يستضعفون': [
              'يُسْتَضْعَفُونَ'], 
   'ناظرين': [
            'نَاظِرِينَ'], 
   'الصادقون': [
              'الصَّادِقُونَ'], 
   'بلد': [
         'بَلَدٍ'], 
   'أحملكم': [
            'أَحْمِلُكُمْ'], 
   'هنالك': [
           'هُنَالِكَ'], 
   'أيديكم': [
            'أَيْدِيكُمْ',
            'أَيْدِيَكُمْ'], 
   'أقسط': [
          'أَقْسَطُ'], 
   'وإخراج': [
            'وَإِخْرَاجُ'], 
   'مبسوطتان': [
              'مَبْسُوطَتَانِ'], 
   'وأتاهم': [
            'وَأَتَاهُمُ'], 
   'نصركم': [
           'نَصَرَكُمُ',
           'نَصْرَكُمْ'], 
   'ارتبتم': [
            'ارْتَبْتُمْ'], 
   'وأنصتوا': [
             'وَأَنْصِتُوا'], 
   'نسيتم': [
           'نَسِيتُمْ'], 
   'مهما': [
          'مَهْمَا'], 
   'تتبعان': [
            'تَتَّبِعَانِّ'], 
   'تلوته': [
           'تَلَوْتُهُ'], 
   'ذاهب': [
          'ذَاهِبٌ'], 
   'لتبتغوا': [
             'لِتَبْتَغُوا'], 
   'فلنعم': [
           'فَلَنِعْمَ'], 
   'واتق': [
          'وَاتَّقِ'], 
   'تدرسون': [
            'تَدْرُسُونَ'], 
   'وحسن': [
          'وَحُسْنَ',
          'وَحُسْنُ',
          'وَحَسُنَ'], 
   'يهدى': [
          'يُهْدَى'], 
   'فطركم': [
           'فَطَرَكُمْ'], 
   'خبث': [
         'خَبُثَ'], 
   'وفرضناها': [
              'وَفَرَضْنَاهَا'], 
   'أقسم': [
          'أُقْسِمُ'], 
   'يسألكموها': [
               'يَسْأَلْكُمُوهَا'], 
   'فخلوا': [
           'فَخَلُّوا'], 
   'أميون': [
           'أُمِّيُّونَ'], 
   'رحيم': [
          'رَحِيمٌ',
          'رَحِيمٍ'], 
   'وأتوا': [
           'وَأْتُوا',
           'وَأُتُوا'], 
   'قوتلتم': [
            'قُوتِلْتُمْ'], 
   'أفعصيت': [
            'أَفَعَصَيْتَ'], 
   'مهتد': [
          'مُهْتَدٍ'], 
   'بلى': [
         'بَلَى'], 
   'تجسسوا': [
            'تَجَسَّسُوا'], 
   'وأبناؤكم': [
              'وَأَبْنَاؤُكُمْ'], 
   'تجزى': [
          'تُجْزَى'], 
   'تجزي': [
          'تَجْزِي'], 
   'ذلة': [
         'ذِلَّةٌ'], 
   'لقد': [
         'لَقَدْ',
         'لَقَدِ'], 
   'حنفاء': [
           'حُنَفَاءَ'], 
   'وتصف': [
          'وَتَصِفُ'], 
   'ويسقون': [
            'وَيُسْقَوْنَ'], 
   'فوربك': [
           'فَوَرَبِّكَ'], 
   'أطمع': [
          'أَطْمَعُ'], 
   'الحسرة': [
            'الْحَسْرَةِ'], 
   'تولوهم': [
            'تُوَلُّوهُمُ',
            'تَوَلَّوْهُمْ'], 
   'أسارى': [
           'أُسَارَى'], 
   'وأضل': [
          'وَأَضَلُّ',
          'وَأَضَلَّ'], 
   'وتغشى': [
           'وَتَغْشَى'], 
   'لنظنك': [
           'لَنَظُنُّكَ'], 
   'لدي': [
         'لَدَيَّ'], 
   'لدى': [
         'لَدَى'], 
   'سفرة': [
          'سَفَرَةٍ'], 
   'أتوكأ': [
           'أَتَوَكَّأُ'], 
   'امرأتين': [
             'امْرَأَتَيْنِ'], 
   'أهليكم': [
            'أَهْلِيكُمْ'], 
   'ولكنا': [
           'وَلَكِنَّا'], 
   'لدن': [
         'لَدُنْ'], 
   'فانفذوا': [
             'فَانْفُذُوا'], 
   'والمؤمنين': [
               'وَالْمُؤْمِنِينَ'], 
   'صابرا': [
           'صَابِرًا'], 
   'البحران': [
             'الْبَحْرَانِ'], 
   'أئفكا': [
           'أَئِفْكًا'], 
   'صابرة': [
           'صَابِرَةٌ'], 
   'البأس': [
           'الْبَأْسِ',
           'الْبَأْسَ'], 
   'فأتمهن': [
            'فَأَتَمَّهُنَّ'], 
   'ظلموا': [
           'ظَلَمُوا',
           'ظُلِمُوا'], 
   'فسوى': [
          'فَسَوَّى'], 
   'ولكني': [
           'وَلَكِنِّي'], 
   'فيخرج': [
           'فَيَخْرُجُ'], 
   'بخبر': [
          'بِخَبَرٍ'], 
   'علا': [
         'عَلَا'], 
   'فسوف': [
          'فَسَوْفَ'], 
   'فسوق': [
          'فُسُوقَ',
          'فُسُوقٌ'], 
   'يخافوا': [
            'يَخَافُوا'], 
   'آنستم': [
           'آنَسْتُمْ'], 
   'والباد': [
            'وَالْبَادِ'], 
   'اعدلوا': [
            'اعْدِلُوا'], 
   'فينظر': [
           'فَيَنْظُرَ'], 
   'يوادون': [
            'يُوَادُّونَ'], 
   'التابعين': [
              'التَّابِعِينَ'], 
   'تنصروا': [
            'تَنْصُرُوا'], 
   'سؤلك': [
          'سُؤْلَكَ'], 
   'العصف': [
           'الْعَصْفِ'], 
   'غلبا': [
          'غُلْبًا'], 
   'نلعنهم': [
            'نَلْعَنَهُمْ'], 
   'قسوة': [
          'قَسْوَةً'], 
   'فذانك': [
           'فَذَانِكَ'], 
   'أنبتكم': [
            'أَنْبَتَكُمْ'], 
   'غلبت': [
          'غَلَبَتْ',
          'غُلِبَتِ'], 
   'وكهلا': [
           'وَكَهْلًا'], 
   'حذرهم': [
           'حِذْرَهُمْ'], 
   'أسلفت': [
           'أَسْلَفَتْ'], 
   'فتصيبكم': [
             'فَتُصِيبَكُمْ'], 
   'الخبائث': [
             'الْخَبَائِثَ'], 
   'وناداهما': [
              'وَنَادَاهُمَا'], 
   'ليهلك': [
           'لِيُهْلِكَ',
           'لِيَهْلِكَ'], 
   'اللذين': [
            'اللَّذَيْنِ'], 
   'يعودون': [
            'يَعُودُونَ'], 
   'ركبا': [
          'رَكِبَا'], 
   'تنيا': [
          'تَنِيَا'], 
   'عجبوا': [
           'عَجِبُوا'], 
   'وأولادهم': [
              'وَأَوْلَادُهُمْ'], 
   'وذر': [
         'وَذَرِ'], 
   'غيظ': [
         'غَيْظَ'], 
   'قبل': [
         'قَبْلُ',
         'قَبْلِ',
         'قَبْلَ',
         'قِبَلَ',
         'قُبُلٍ'], 
   'قرأناه': [
            'قَرَأْنَاهُ'], 
   'ببيعكم': [
            'بِبَيْعِكُمُ'], 
   'طعامك': [
           'طَعَامِكَ'], 
   'بذلك': [
          'بِذَلِكَ'], 
   'طعامه': [
           'طَعَامِهِ'], 
   'مسئولون': [
             'مَسْئُولُونَ'], 
   'وأهلونا': [
             'وَأَهْلُونَا'], 
   'خفافا': [
           'خِفَافًا'], 
   'وذا': [
         'وَذَا'], 
   'رسولهم': [
            'رَسُولُهُمْ',
            'رَسُولَهُمْ'], 
   'فرضتم': [
           'فَرَضْتُمْ'], 
   'بالأسحار': [
              'بِالْأَسْحَارِ'], 
   'سلسبيلا': [
             'سَلْسَبِيلًا'], 
   'وبرق': [
          'وَبَرْقٌ'], 
   'الفقر': [
           'الْفَقْرَ'], 
   'أقفالها': [
             'أَقْفَالُهَا'], 
   'يصروا': [
           'يُصِرُّوا'], 
   'لمؤمن': [
           'لِمُؤْمِنٍ'], 
   'واعدنا': [
            'وَاعَدْنَا'], 
   'والدواب': [
             'وَالدَّوَابِّ',
             'وَالدَّوَابُّ'], 
   'هوى': [
         'هَوَى'], 
   'أراغب': [
           'أَرَاغِبٌ'], 
   'أزا': [
         'أَزًّا'], 
   'توعظون': [
            'تُوعَظُونَ'], 
   'أذكره': [
           'أَذْكُرَهُ'], 
   'نكال': [
          'نَكَالَ'], 
   'خطيئته': [
            'خَطِيئَتُهُ'], 
   'وأمددناهم': [
               'وَأَمْدَدْنَاهُمْ'], 
   'وبرا': [
          'وَبَرًّا'], 
   'حملناكم': [
             'حَمَلْنَاكُمْ'], 
   'رأيتهم': [
            'رَأَيْتَهُمْ',
            'رَأَيْتُهُمْ'], 
   'تعلمونهن': [
              'تُعَلِّمُونَهُنَّ'], 
   'فأرسله': [
            'فَأَرْسِلْهُ'], 
   'تسأل': [
          'تُسْأَلُ'], 
   'لترون': [
           'لَتَرَوُنَّ'], 
   'سميعا': [
           'سَمِيعًا'], 
   'أباكم': [
           'أَبَاكُمْ'], 
   'وطفقا': [
           'وَطَفِقَا'], 
   'ضعفا': [
          'ضِعْفًا',
          'ضَعْفًا'], 
   'القادر': [
            'الْقَادِرُ'], 
   'تذر': [
         'تَذَرُ',
         'تَذَرْ'], 
   'وأدبار': [
            'وَأَدْبَارَ'], 
   'واستعمركم': [
               'وَاسْتَعْمَرَكُمْ'], 
   'فاستشهدوا': [
               'فَاسْتَشْهِدُوا'], 
   'يعودوا': [
            'يَعُودُوا'], 
   'للرؤيا': [
            'لِلرُّؤْيَا'], 
   'فارض': [
          'فَارِضٌ'], 
   'فدعوهم': [
            'فَدَعَوْهُمْ'], 
   'الزاهدين': [
              'الزَّاهِدِينَ'], 
   'هربا': [
          'هَرَبًا'], 
   'وذي': [
         'وَذِي'], 
   'وذو': [
         'وَذُو'], 
   'والرهبان': [
              'وَالرُّهْبَانِ'], 
   'طعاما': [
           'طَعَامًا'], 
   'نؤمن': [
          'نُؤْمِنَ',
          'نُؤْمِنُ'], 
   'لنراك': [
           'لَنَرَاكَ'], 
   'يمسسك': [
           'يَمْسَسْكَ'], 
   'ناجيتم': [
            'نَاجَيْتُمُ'], 
   'نسختها': [
            'نُسْخَتِهَا'], 
   'مرسلون': [
            'مُرْسَلُونَ'], 
   'يوفون': [
           'يُوفُونَ'], 
   'أضعافا': [
            'أَضْعَافًا'], 
   'يسخطون': [
            'يَسْخَطُونَ'], 
   'يعطوا': [
           'يُعْطُوا',
           'يُعْطَوْا'], 
   'بغى': [
         'بَغَى'], 
   'البنين': [
            'الْبَنِينَ'], 
   'عوقب': [
          'عُوقِبَ'], 
   'ويكلم': [
           'وَيُكَلِّمُ'], 
   'وغلقت': [
           'وَغَلَّقَتِ'], 
   'لاتبعناكم': [
               'لَاتَّبَعْنَاكُمْ'], 
   'الرشيد': [
            'الرَّشِيدُ'], 
   'وحكمة': [
           'وَحِكْمَةٍ'], 
   'تستعجلون': [
              'تَسْتَعْجِلُونَ',
              'تَسْتَعْجِلُونِ'], 
   'تستعجلوه': [
              'تَسْتَعْجِلُوهُ'], 
   'منك': [
         'مِنْكَ'], 
   'وتجاهدون': [
              'وَتُجَاهِدُونَ'], 
   'أودية': [
           'أَوْدِيَةٌ'], 
   'ويذكر': [
           'وَيُذْكَرَ'], 
   'يروا': [
          'يَرَوْا',
          'يَرَوُا'], 
   'فأجاءها': [
             'فَأَجَاءَهَا'], 
   'الضلال': [
            'الضَّلَالُ'], 
   'أتصبرون': [
             'أَتَصْبِرُونَ'], 
   'وآثر': [
          'وَآثَرَ'], 
   'وذرية': [
           'وَذُرِّيَّةً'], 
   'طلوع': [
          'طُلُوعِ'], 
   'كي': [
        'كَيْ'], 
   'اسجدوا': [
            'اسْجُدُوا'], 
   'العاملون': [
              'الْعَامِلُونَ'], 
   'حياتنا': [
            'حَيَاتُنَا'], 
   'وإخوان': [
            'وَإِخْوَانُ'], 
   'والسيئات': [
              'وَالسَّيِّئَاتِ'], 
   'يرون': [
          'يَرَوْنَ'], 
   'كم': [
        'كَمْ'], 
   'كل': [
        'كُلِّ',
        'كُلَّ',
        'كُلُّ',
        'كُلٌّ',
        'كُلٍّ',
        'كَلٌّ'], 
   'وأغرقنا': [
             'وَأَغْرَقْنَا'], 
   'حاججتم': [
            'حَاجَجْتُمْ'], 
   'أيد': [
         'أَيْدٍ'], 
   'زبورا': [
           'زَبُورًا'], 
   'فلأنفسهم': [
              'فَلِأَنْفُسِهِمْ'], 
   'ثلثا': [
          'ثُلُثَا'], 
   'أشركنا': [
            'أَشْرَكْنَا'], 
   'أغرقناهم': [
              'أَغْرَقْنَاهُمْ'], 
   'أفضى': [
          'أَفْضَى'], 
   'جنبا': [
          'جُنُبًا'], 
   'بنعمته': [
            'بِنِعْمَتِهِ'], 
   'مدهنون': [
            'مُدْهِنُونَ'], 
   'وسيجزي': [
            'وَسَيَجْزِي'], 
   'فاستغلظ': [
             'فَاسْتَغْلَظَ'], 
   'مكلبين': [
            'مُكَلِّبِينَ'], 
   'طيبات': [
           'طَيِّبَاتِ',
           'طَيِّبَاتٍ'], 
   'انظرونا': [
             'انْظُرُونَا'], 
   'بغائبين': [
             'بِغَائِبِينَ'], 
   'يخرجهم': [
            'يُخْرِجُهُمْ'], 
   'يبعث': [
          'يَبْعَثَ',
          'يَبْعَثُ',
          'يُبْعَثُ'], 
   'أنسانيه': [
             'أَنْسَانِيهُ'], 
   'والمطلقات': [
               'وَالْمُطَلَّقَاتُ'], 
   'مغرم': [
          'مَغْرَمٍ'], 
   'لساحران': [
             'لَسَاحِرَانِ'], 
   'وكلمته': [
            'وَكَلِمَتُهُ'], 
   'تتخذون': [
            'تَتَّخِذُونَ'], 
   'يودوا': [
           'يَوَدُّوا'], 
   'يستحيي': [
            'يَسْتَحْيِي'], 
   'لأعدوا': [
            'لَأَعَدُّوا'], 
   'انتهوا': [
            'انْتَهَوْا',
            'انْتَهُوا'], 
   'الموازين': [
              'الْمَوَازِينَ'], 
   'غلا': [
         'غِلًّا'], 
   'أبشرا': [
           'أَبَشَرًا'], 
   'تبسطها': [
            'تَبْسُطْهَا'], 
   'تنظرون': [
            'تَنْظُرُونَ',
            'تُنْظِرُونِ'], 
   'فرض': [
         'فَرَضَ'], 
   'ولهوا': [
           'وَلَهْوًا'], 
   'أضلني': [
           'أَضَلَّنِي'], 
   'كافرة': [
           'كَافِرَةٌ'], 
   'أنكم': [
          'أَنَّكُمْ'], 
   'تهجرون': [
            'تَهْجُرُونَ'], 
   'يزالون': [
            'يَزَالُونَ'], 
   'ينزل': [
          'يُنَزِّلُ',
          'يُنَزِّلْ',
          'يُنَزِّلَ',
          'يُنَزَّلَ',
          'يَنْزِلُ',
          'يُنَزَّلُ'], 
   'أكملت': [
           'أَكْمَلْتُ'], 
   'وانظرنا': [
             'وَانْظُرْنَا'], 
   'لنزلنا': [
            'لَنَزَّلْنَا'], 
   'وفصل': [
          'وَفَصْلَ'], 
   'رميت': [
          'رَمَيْتَ'], 
   'عداوة': [
           'عَدَاوَةٌ',
           'عَدَاوَةً'], 
   'فرح': [
         'فَرِحَ'], 
   'الربانيون': [
               'الرَّبَّانِيُّونَ'], 
   'فرث': [
         'فَرْثٍ'], 
   'فرت': [
         'فَرَّتْ'], 
   'صادقا': [
           'صَادِقًا'], 
   'الميل': [
           'الْمَيْلِ'], 
   'أضلنا': [
           'أَضَلَّنَا'], 
   'يؤت': [
         'يُؤْتِ',
         'يُؤْتَ'], 
   'وأيدكم': [
            'وَأَيَّدَكُمْ'], 
   'وأقسموا': [
             'وَأَقْسَمُوا'], 
   'وخالاتكم': [
              'وَخَالَاتُكُمْ'], 
   'وليشهد': [
            'وَلْيَشْهَدْ'], 
   'اشمأزت': [
            'اشْمَأَزَّتْ'], 
   'ينزغ': [
          'يَنْزَغُ'], 
   'وأولات': [
            'وَأُولَاتُ'], 
   'ينزع': [
          'يَنْزِعُ'], 
   'فرق': [
         'فِرْقٍ'], 
   'النجدين': [
             'النَّجْدَيْنِ'], 
   'النذر': [
           'النُّذُرُ',
           'النُّذُرِ'], 
   'كالمهل': [
            'كَالْمُهْلِ'], 
   'الصاعقة': [
             'الصَّاعِقَةُ'], 
   'أنكر': [
          'أَنْكَرَ'], 
   'سلالة': [
           'سُلَالَةٍ'], 
   'ولذي': [
          'وَلِذِي'], 
   'يوصل': [
          'يُوصَلَ'], 
   'مغرب': [
          'مَغْرِبَ'], 
   'يوصى': [
          'يُوصَى'], 
   'يوصي': [
          'يُوصِي'], 
   'وأطعموا': [
             'وَأَطْعِمُوا'], 
   'المشحون': [
             'الْمَشْحُونِ'], 
   'تتخذوا': [
            'تَتَّخِذُوا'], 
   'لطيفا': [
           'لَطِيفًا'], 
   'ويكتمون': [
             'وَيَكْتُمُونَ'], 
   'الأيام': [
            'الْأَيَّامِ',
            'الْأَيَّامُ'], 
   'غلف': [
         'غُلْفٌ'], 
   'ومما': [
          'وَمِمَّا'], 
   'بهتانا': [
            'بُهْتَانًا'], 
   'حصدتم': [
           'حَصَدْتُمْ'], 
   'تطوع': [
          'تَطَوَّعَ'], 
   'الأحياء': [
             'الْأَحْيَاءُ'], 
   'متكئون': [
            'مُتَّكِئُونَ'], 
   'ليأخذوه': [
             'لِيَأْخُذُوهُ'], 
   'تغمضوا': [
            'تُغْمِضُوا'], 
   'أدعو': [
          'أَدْعُو'], 
   'وعدناهم': [
             'وَعَدْنَاهُمْ'], 
   'أسفل': [
          'أَسْفَلَ'], 
   'فأعقبهم': [
             'فَأَعْقَبَهُمْ'], 
   'الآمنين': [
             'الْآمِنِينَ'], 
   'الغمام': [
            'الْغَمَامَ',
            'الْغَمَامِ'], 
   'لتكفرون': [
             'لَتَكْفُرُونَ'], 
   'يحمى': [
          'يُحْمَى'], 
   'صالحا': [
           'صَالِحًا'], 
   'ورسوله': [
            'وَرَسُولَهُ',
            'وَرَسُولِهِ',
            'وَرَسُولُهُ'], 
   'صبرا': [
          'صَبْرًا'], 
   'جلدة': [
          'جَلْدَةٍ',
          'جَلْدَةً'], 
   'كرمنا': [
           'كَرَّمْنَا'], 
   'يتولى': [
           'يَتَوَلَّى'], 
   'الوحوش': [
            'الْوُحُوشُ'], 
   'يتوكلون': [
             'يَتَوَكَّلُونَ'], 
   'أربى': [
          'أَرْبَى'], 
   'وجئتكم': [
            'وَجِئْتُكُمْ'], 
   'عضدك': [
          'عَضُدَكَ'], 
   'تخفوا': [
           'تُخْفُوا'], 
   'تحمل': [
          'تَحْمِلُ',
          'تَحْمِلْ'], 
   'أشهدوا': [
            'أَشَهِدُوا'], 
   'تأذن': [
          'تَأَذَّنَ'], 
   'وإلا': [
          'وَإِلَّا'], 
   'بابا': [
          'بَابًا'], 
   'والشمس': [
            'وَالشَّمْسَ',
            'وَالشَّمْسُ',
            'وَالشَّمْسِ'], 
   'اضرب': [
          'اضْرِبْ'], 
   'ومقاما': [
            'وَمُقَامًا'], 
   'كحب': [
         'كَحُبِّ'], 
   'يشركن': [
           'يُشْرِكْنَ'], 
   'عضدا': [
          'عَضُدًا'], 
   'نزيدكم': [
            'نَزِيدَكُمْ'], 
   'وإلى': [
          'وَإِلَى'], 
   'وإلي': [
          'وَإِلَيَّ'], 
   'الخالفين': [
              'الْخَالِفِينَ'], 
   'وإله': [
          'وَإِلَهُ',
          'وَإِلَهَ'], 
   'سميتها': [
            'سَمَّيْتُهَا'], 
   'ليقوم': [
           'لِيَقُومَ'], 
   'لمستقر': [
            'لِمُسْتَقَرٍّ'], 
   'لتكون': [
           'لِتَكُونَ'], 
   'حسنت': [
          'حَسُنَتْ'], 
   'الرأس': [
           'الرَّأْسُ'], 
   'صبرك': [
          'صَبْرُكَ'], 
   'الوجوه': [
            'الْوُجُوهُ',
            'الْوُجُوهَ'], 
   'ورسولا': [
            'وَرَسُولًا'], 
   'أتخشونهم': [
              'أَتَخْشَوْنَهُمْ'], 
   'بقيعة': [
           'بِقِيعَةٍ'], 
   'وأكثر': [
           'وَأَكْثَرُ',
           'وَأَكْثَرَ'], 
   'كأسا': [
          'كَأْسًا'], 
   'توكلوا': [
            'تَوَكَّلُوا'], 
   'وأمنا': [
           'وَأَمْنًا'], 
   'قانتات': [
            'قَانِتَاتٍ',
            'قَانِتَاتٌ'], 
   'فليبتكن': [
             'فَلَيُبَتِّكُنَّ'], 
   'بالوعيد': [
             'بِالْوَعِيدِ'], 
   'وأنصح': [
           'وَأَنْصَحُ'], 
   'فأصلح': [
           'فَأَصْلَحَ'], 
   'تنصروه': [
            'تَنْصُرُوهُ'], 
   'يهديهم': [
            'يَهْدِيهِمْ',
            'يَهْدِيهِمُ'], 
   'والنور': [
            'وَالنُّورِ',
            'وَالنُّورُ',
            'وَالنُّورَ'], 
   'ووقانا': [
            'وَوَقَانَا'], 
   'فلله': [
          'فَلِلَّهِ'], 
   'ماؤها': [
           'مَاؤُهَا'], 
   'آذاننا': [
            'آذَانِنَا'], 
   'وخافون': [
            'وَخَافُونِ'], 
   'ونودوا': [
            'وَنُودُوا'], 
   'مسكوب': [
           'مَسْكُوبٍ'], 
   'تقصص': [
          'تَقْصُصْ'], 
   'عاهدوا': [
            'عَاهَدُوا'], 
   'شقاق': [
          'شِقَاقٍ',
          'شِقَاقَ'], 
   'والغاوون': [
              'وَالْغَاوُونَ'], 
   'فنعمل': [
           'فَنَعْمَلَ'], 
   'خيفته': [
           'خِيفَتِهِ'], 
   'تمشي': [
          'تَمْشِي'], 
   'وتأسرون': [
             'وَتَأْسِرُونَ'], 
   'تحملون': [
            'تُحْمَلُونَ'], 
   'مكنون': [
           'مَكْنُونٌ',
           'مَكْنُونٍ'], 
   'يتب': [
         'يَتُبْ'], 
   'عصيته': [
           'عَصَيْتُهُ'], 
   'فؤادك': [
           'فُؤَادَكَ'], 
   'تطغوا': [
           'تَطْغَوْا'], 
   'وغيض': [
          'وَغِيضَ'], 
   'جمالت': [
           'جِمَالَتٌ'], 
   'وأشهدهم': [
             'وَأَشْهَدَهُمْ'], 
   'يتغير': [
           'يَتَغَيَّرْ'], 
   'ومستودع': [
             'وَمُسْتَوْدَعٌ'], 
   'أمما': [
          'أُمَمًا'], 
   'يحبسه': [
           'يَحْبِسُهُ'], 
   'أنما': [
          'أَنَّمَا'], 
   'المؤمن': [
            'الْمُؤْمِنُ'], 
   'والسماء': [
             'وَالسَّمَاءِ',
             'وَالسَّمَاءَ'], 
   'شتى': [
         'شَتَّى'], 
   'أوليائكم': [
              'أَوْلِيَائِكُمْ'], 
   'بالسن': [
           'بِالسِّنِّ'], 
   'حنيفا': [
           'حَنِيفًا'], 
   'يخرجن': [
           'يَخْرُجْنَ'], 
   'أمليت': [
           'أَمْلَيْتُ'], 
   'البلد': [
           'الْبَلَدِ',
           'الْبَلَدَ'], 
   'تصوموا': [
            'تَصُومُوا'], 
   'فصلى': [
          'فَصَلَّى'], 
   'يفتنكم': [
            'يَفْتِنَكُمُ'], 
   'ويعظم': [
           'وَيُعْظِمْ'], 
   'وليعلم': [
            'وَلِيَعْلَمَ'], 
   'ويعلمون': [
             'وَيَعْلَمُونَ'], 
   'رئاء': [
          'رِئَاءَ'], 
   'أسفر': [
          'أَسْفَرَ'], 
   'مقرنين': [
            'مُقَرَّنِينَ',
            'مُقْرِنِينَ'], 
   'والرمان': [
             'وَالرُّمَّانَ'], 
   'القردة': [
            'الْقِرَدَةَ'], 
   'يعذبهم': [
            'يُعَذِّبْهُمُ',
            'يُعَذِّبَهُمْ',
            'يُعَذِّبُهُمْ',
            'يُعَذِّبَهُمُ'], 
   'تكرمون': [
            'تُكْرِمُونَ'], 
   'تنبئهم': [
            'تُنَبِّئُهُمْ'], 
   'فأسكناه': [
             'فَأَسْكَنَّاهُ'], 
   'نكلف': [
          'نُكَلِّفُ'], 
   'نكلم': [
          'نُكَلِّمُ'], 
   'لمحجوبون': [
              'لَمَحْجُوبُونَ'], 
   'أتواصوا': [
             'أَتَوَاصَوْا'], 
   'تجارة': [
           'تِجَارَةً',
           'تِجَارَةٍ',
           'تِجَارَةٌ'], 
   'يتفكروا': [
             'يَتَفَكَّرُوا'], 
   'أبلغوا': [
            'أَبْلَغُوا'], 
   'يضلونهم': [
             'يُضِلُّونَهُمْ'], 
   'نجيا': [
          'نَجِيًّا'], 
   'ثمره': [
          'ثَمَرِهِ'], 
   'حداد': [
          'حِدَادٍ'], 
   'صبحا': [
          'صُبْحًا'], 
   'أوزعني': [
            'أَوْزِعْنِي'], 
   'عاهدت': [
           'عَاهَدْتَ'], 
   'وأزواجه': [
             'وَأَزْوَاجُهُ'], 
   'خانوا': [
           'خَانُوا'], 
   'لقطعنا': [
            'لَقَطَعْنَا'], 
   'ويبطل': [
           'وَيُبْطِلَ'], 
   'والجراد': [
             'وَالْجَرَادَ'], 
   'وقولهم': [
            'وَقَوْلِهِمْ'], 
   'ثلثي': [
          'ثُلُثَيِ'], 
   'وغساق': [
           'وَغَسَّاقٌ'], 
   'عصيا': [
          'عَصِيًّا'], 
   'أبقى': [
          'أَبْقَى'], 
   'آمنين': [
           'آمِنِينَ'], 
   'فتدلى': [
           'فَتَدَلَّى'], 
   'تأمرنا': [
            'تَأْمُرُنَا'], 
   'ثمرة': [
          'ثَمَرَةٍ'], 
   'لننجينه': [
             'لَنُنَجِّيَنَّهُ'], 
   'عصيت': [
          'عَصَيْتُ',
          'عَصَيْتَ'], 
   'إناثا': [
           'إِنَاثًا'], 
   'يدعوه': [
           'يَدْعُوهُ'], 
   'يدعون': [
           'يَدْعُونَ',
           'يُدْعَوْنَ',
           'يُدَعُّونَ',
           'يَدَّعُونَ'], 
   'يتفضل': [
           'يَتَفَضَّلَ'], 
   'يدعوك': [
           'يَدْعُوكَ'], 
   'دبره': [
          'دُبُرَهُ'], 
   'يكونوا': [
            'يَكُونُوا'], 
   'يمدونهم': [
             'يَمُدُّونَهُمْ'], 
   'مضاعفة': [
            'مُضَاعَفَةً'], 
   'بكفرهم': [
            'بِكُفْرِهِمْ'], 
   'عابري': [
           'عَابِرِي'], 
   'والبدن': [
            'وَالْبُدْنَ'], 
   'ادع': [
         'ادْعُ'], 
   'بطونه': [
           'بُطُونِهِ'], 
   'بنخل': [
          'بِنَخْلٍ'], 
   'ملتحدا': [
            'مُلْتَحَدًا'], 
   'وسررا': [
           'وَسُرُرًا'], 
   'جالوت': [
           'جَالُوتَ'], 
   'بلغوا': [
           'بَلَغُوا'], 
   'يضاعفه': [
            'يُضَاعِفْهُ'], 
   'لظلم': [
          'لَظُلْمٌ'], 
   'شكرتم': [
           'شَكَرْتُمْ'], 
   'آلهتكم': [
            'آلِهَتَكُمْ',
            'آلِهَتِكُمْ'], 
   'ذائقة': [
           'ذَائِقَةُ'], 
   'فحشر': [
          'فَحَشَرَ'], 
   'كيدكن': [
           'كَيْدِكُنَّ',
           'كَيْدَكُنَّ'], 
   'مذءوما': [
            'مَذْءُومًا'], 
   'كيدكم': [
           'كَيْدَكُمْ'], 
   'لتسكنوا': [
             'لِتَسْكُنُوا'], 
   'تركبون': [
            'تَرْكَبُونَ'], 
   'ويرى': [
          'وَيَرَى'], 
   'انتظروا': [
             'انْتَظِرُوا'], 
   'تخفي': [
          'تُخْفِي'], 
   'تخفى': [
          'تَخْفَى'], 
   'أكنانا': [
            'أَكْنَانًا'], 
   'معكم': [
          'مَعَكُمْ'], 
   'رزقوا': [
           'رُزِقُوا'], 
   'القالين': [
             'الْقَالِينَ'], 
   'بإمامهم': [
             'بِإِمَامِهِمْ'], 
   'ورتل': [
          'وَرَتِّلِ'], 
   'للظالمين': [
              'لِلظَّالِمِينَ'], 
   'المدحضين': [
              'الْمُدْحَضِينَ'], 
   'نطعمكم': [
            'نُطْعِمُكُمْ'], 
   'ثجاجا': [
           'ثَجَّاجًا'], 
   'بكاف': [
          'بِكَافٍ'], 
   'كريما': [
           'كَرِيمًا'], 
   'مطاع': [
          'مُطَاعٍ'], 
   'بهديتكم': [
             'بِهَدِيَّتِكُمْ'], 
   'يشعركم': [
            'يُشْعِرُكُمْ'], 
   'ترهقني': [
            'تُرْهِقْنِي'], 
   'آتي': [
         'آتِي'], 
   'وملئه': [
           'وَمَلَئِهِ'], 
   'تقتلوهم': [
             'تَقْتُلُوهُمْ'], 
   'أعمال': [
           'أَعْمَالٌ'], 
   'جوفه': [
          'جَوْفِهِ'], 
   'استأذنك': [
             'اسْتَأْذَنَكَ'], 
   'ومصيرا': [
            'وَمَصِيرًا'], 
   'وأنهارا': [
             'وَأَنْهَارًا'], 
   'طغيانهم': [
             'طُغْيَانِهِمْ'], 
   'ويرث': [
          'وَيَرِثُ'], 
   'وابعث': [
           'وَابْعَثْ'], 
   'يظنون': [
           'يَظُنُّونَ'], 
   'سوآتهما': [
             'سَوْآتِهِمَا',
             'سَوْآتُهُمَا'], 
   'أمتنا': [
           'أَمَتَّنَا'], 
   'لفريقا': [
            'لَفَرِيقًا'], 
   'الزرع': [
           'الزَّرْعَ'], 
   'أهم': [
         'أَهُمْ'], 
   'أهل': [
         'أَهْلِ',
         'أَهْلَ',
         'أَهْلُ',
         'أُهِلَّ'], 
   'النجوم': [
            'النُّجُومِ',
            'النُّجُومُ',
            'النُّجُومَ'], 
   'فانفجرت': [
             'فَانْفَجَرَتْ'], 
   'تكلمون': [
            'تُكَلِّمُونِ'], 
   'وزورا': [
           'وَزُورًا'], 
   'النجوى': [
            'النَّجْوَى'], 
   'زللتم': [
           'زَلَلْتُمْ'], 
   'فالمدبرات': [
               'فَالْمُدَبِّرَاتِ'], 
   'صدره': [
          'صَدْرَهُ'], 
   'قريب': [
          'قَرِيبٌ',
          'قَرِيبٍ'], 
   'صدرك': [
          'صَدْرُكَ',
          'صَدْرِكَ',
          'صَدْرَكَ'], 
   'كلتم': [
          'كِلْتُمْ'], 
   'ضحاها': [
           'ضُحَاهَا'], 
   'وعزروه': [
            'وَعَزَّرُوهُ'], 
   'صدري': [
          'صَدْرِي'], 
   'تؤتوه': [
           'تُؤْتَوْهُ'], 
   'تؤتون': [
           'تُؤْتُونِ'], 
   'فقدر': [
          'فَقَدَرَ'], 
   'شديدا': [
           'شَدِيدًا'], 
   'نبتليه': [
            'نَبْتَلِيهِ'], 
   'تعاونوا': [
             'تَعَاوَنُوا'], 
   'دلوه': [
          'دَلْوَهُ'], 
   'قبلكم': [
           'قَبْلِكُمْ'], 
   'عدنا': [
          'عُدْنَا'], 
   'أعينهم': [
            'أَعْيُنِهِمْ',
            'أَعْيُنُهُمْ',
            'أَعْيُنَهُمْ'], 
   'صدرا': [
          'صَدْرًا'], 
   'أذى': [
         'أَذًى'], 
   'تشاءون': [
            'تَشَاءُونَ'], 
   'كلتا': [
          'كِلْتَا'], 
   'فرأوه': [
           'فَرَأَوْهُ'], 
   'تزد': [
         'تَزِدِ'], 
   'وليكون': [
            'وَلِيَكُونَ'], 
   'ضلوا': [
          'ضَلُّوا'], 
   'أذن': [
         'أَذِنَ',
         'أُذُنٌ',
         'أُذِنَ',
         'أُذُنُ',
         'أَذَّنَ'], 
   'قرين': [
          'قَرِينٌ'], 
   'الفلك': [
           'الْفُلْكِ',
           'الْفُلْكَ',
           'الْفُلْكُ'], 
   'لرجل': [
          'لِرَجُلٍ'], 
   'وأحسنوا': [
             'وَأَحْسِنُوا',
             'وَأَحْسَنُوا'], 
   'والآخرين': [
              'وَالْآخِرِينَ'], 
   'تزر': [
         'تَزِرُ'], 
   'ينالهم': [
            'يَنَالُهُمْ',
            'يَنَالُهُمُ'], 
   'ساء': [
         'سَاءَ'], 
   'يحضن': [
          'يَحِضْنَ'], 
   'خاضعين': [
            'خَاضِعِينَ'], 
   'تزغ': [
         'تُزِغْ'], 
   'فاطر': [
          'فَاطِرِ',
          'فَاطِرَ',
          'فَاطِرُ'], 
   'يقترف': [
           'يَقْتَرِفْ'], 
   'فمتاع': [
           'فَمَتَاعُ'], 
   'فكنتم': [
           'فَكُنْتُمْ'], 
   'فضلوا': [
           'فَضَلُّوا',
           'فُضِّلُوا'], 
   'خاسرين': [
            'خَاسِرِينَ'], 
   'يذهبن': [
           'يُذْهِبْنَ',
           'يُذْهِبَنَّ'], 
   'مفسدين': [
            'مُفْسِدِينَ'], 
   'يتلونه': [
            'يَتْلُونَهُ'], 
   'تمسكوا': [
            'تُمْسِكُوا'], 
   'قتر': [
         'قَتَرٌ'], 
   'أنهاكم': [
            'أَنْهَاكُمْ'], 
   'ننجي': [
          'نُنَجِّي',
          'نُنْجِي'], 
   'جنتك': [
          'جَنَّتِكَ',
          'جَنَّتَكَ'], 
   'كلما': [
          'كُلَّمَا'], 
   'البنون': [
            'الْبَنُونَ'], 
   'كلمت': [
          'كَلِمَتُ'], 
   'سيغفر': [
           'سَيُغْفَرُ'], 
   'جنتي': [
          'جَنَّتِي'], 
   'كلمة': [
          'كَلِمَةٌ',
          'كَلِمَةُ',
          'كَلِمَةَ',
          'كَلِمَةً',
          'كَلِمَةٍ'], 
   'يدينون': [
            'يَدِينُونَ'], 
   'بالمؤمنين': [
               'بِالْمُؤْمِنِينَ'], 
   'وقدموا': [
            'وَقَدِّمُوا'], 
   'ليظلمهم': [
             'لِيَظْلِمَهُمْ'], 
   'تبعثون': [
            'تُبْعَثُونَ'], 
   'فتكفرون': [
             'فَتَكْفُرُونَ'], 
   'وعظاما': [
            'وَعِظَامًا'], 
   'نداء': [
          'نِدَاءً'], 
   'خلفاء': [
           'خُلَفَاءَ'], 
   'فاستمتعوا': [
               'فَاسْتَمْتَعُوا'], 
   'فعال': [
          'فَعَّالٌ'], 
   'تمسنا': [
           'تَمَسَّنَا'], 
   'فرقانا': [
            'فُرْقَانًا'], 
   'الكواكب': [
             'الْكَوَاكِبِ',
             'الْكَوَاكِبُ'], 
   'يحفظونه': [
             'يَحْفَظُونَهُ'], 
   'أيديهن': [
            'أَيْدِيَهُنَّ',
            'أَيْدِيهِنَّ'], 
   'أيديهم': [
            'أَيْدِيهِمْ',
            'أَيْدِيَهُمْ'], 
   'يحملوها': [
             'يَحْمِلُوهَا'], 
   'منيبا': [
           'مُنِيبًا'], 
   'جاءت': [
          'جَاءَتْ',
          'جَاءَتِ'], 
   'بذنوبكم': [
             'بِذُنُوبِكُمْ'], 
   'لنسألنهم': [
              'لَنَسْأَلَنَّهُمْ'], 
   'حور': [
         'حُورٌ'], 
   'يكرهون': [
            'يَكْرَهُونَ'], 
   'ليوم': [
          'لِيَوْمِ',
          'لِيَوْمٍ'], 
   'فقطع': [
          'فَقُطِعَ',
          'فَقَطَّعَ'], 
   'المفلحون': [
              'الْمُفْلِحُونَ'], 
   'أتيناهم': [
             'أَتَيْنَاهُمْ'], 
   'كخشية': [
           'كَخَشْيَةِ'], 
   'المجرمين': [
              'الْمُجْرِمِينَ'], 
   'العاملين': [
              'الْعَامِلِينَ'], 
   'أبوابا': [
            'أَبْوَابًا'], 
   'وارزقوهم': [
              'وَارْزُقُوهُمْ'], 
   'وحده': [
          'وَحْدَهُ'], 
   'يمده': [
          'يَمُدُّهُ'], 
   'رتقا': [
          'رَتْقًا'], 
   'القرين': [
            'الْقَرِينُ'], 
   'شية': [
         'شِيَةَ'], 
   'فتوكل': [
           'فَتَوَكَّلْ'], 
   'مزيد': [
          'مَزِيدٍ',
          'مَزِيدٌ'], 
   'للجوا': [
           'لَلَجُّوا'], 
   'جاءك': [
          'جَاءَكَ'], 
   'وتعالى': [
            'وَتَعَالَى'], 
   'تسرفوا': [
            'تُسْرِفُوا'], 
   'واحفظوا': [
             'وَاحْفَظُوا'], 
   'كلمه': [
          'كَلَّمَهُ'], 
   'والأقربون': [
               'وَالْأَقْرَبُونَ'], 
   'العادون': [
             'الْعَادُونَ'], 
   'والمعتر': [
             'وَالْمُعْتَرَّ'], 
   'فتناه': [
           'فَتَنَّاهُ'], 
   'لأكفر': [
           'لِأَكْفُرَ'], 
   'تعرف': [
          'تَعْرِفُ'], 
   'لأوتين': [
            'لَأُوتَيَنَّ'], 
   'الرجيم': [
            'الرَّجِيمِ'], 
   'قاصفا': [
           'قَاصِفًا'], 
   'الفضل': [
           'الْفَضْلِ',
           'الْفَضْلُ',
           'الْفَضْلَ'], 
   'الطعام': [
            'الطَّعَامَ',
            'الطَّعَامِ'], 
   'تخرجون': [
            'تُخْرَجُونَ',
            'تُخْرِجُونَ',
            'تَخْرُجُونَ'], 
   'إليها': [
           'إِلَيْهَا'], 
   'حكيم': [
          'حَكِيمٌ',
          'حَكِيمٍ'], 
   'زادتهم': [
            'زَادَتْهُمْ'], 
   'آية': [
         'آيَةً',
         'آيَةٍ',
         'آيَةٌ',
         'آيَةَ'], 
   'ويحفظن': [
            'وَيَحْفَظْنَ'], 
   'خاوية': [
           'خَاوِيَةٌ',
           'خَاوِيَةٍ',
           'خَاوِيَةً'], 
   'واسألوا': [
             'وَاسْأَلُوا'], 
   'أنفق': [
          'أَنْفَقَ'], 
   'عملي': [
          'عَمَلِي'], 
   'صديقا': [
           'صِدِّيقًا'], 
   'ملتكم': [
           'مِلَّتِكُمْ'], 
   'عمله': [
          'عَمَلِهِ',
          'عَمَلُهُ'], 
   'فزده': [
          'فَزِدْهُ'], 
   'وتثبيتا': [
             'وَتَثْبِيتًا'], 
   'خالدون': [
            'خَالِدُونَ'], 
   'ولرسوله': [
             'وَلِرَسُولِهِ'], 
   'صديقة': [
           'صِدِّيقَةٌ'], 
   'لنتخذن': [
            'لَنَتَّخِذَنَّ'], 
   'أغني': [
          'أُغْنِي'], 
   'الوكيل': [
            'الْوَكِيلُ'], 
   'فاخلع': [
           'فَاخْلَعْ'], 
   'وأشرك': [
           'وَأُشْرِكَ'], 
   'فلتقم': [
           'فَلْتَقُمْ'], 
   'قلوبكما': [
             'قُلُوبُكُمَا'], 
   'وصفهم': [
           'وَصْفَهُمْ'], 
   'القصوى': [
            'الْقُصْوَى'], 
   'عملت': [
          'عَمِلَتْ'], 
   'جلودا': [
           'جُلُودًا'], 
   'عملا': [
          'عَمَلًا'], 
   'أفئدة': [
           'أَفْئِدَةُ',
           'أَفْئِدَةً'], 
   'كلاهما': [
            'كِلَاهُمَا'], 
   'سيرتها': [
            'سِيرَتَهَا'], 
   'وتزودوا': [
             'وَتَزَوَّدُوا'], 
   'يألونكم': [
             'يَأْلُونَكُمْ'], 
   'يئس': [
         'يَئِسَ'], 
   'وتعلم': [
           'وَتَعْلَمَ'], 
   'وليبتلي': [
             'وَلِيَبْتَلِيَ'], 
   'استطعنا': [
             'اسْتَطَعْنَا'], 
   'وهموا': [
           'وَهَمُّوا'], 
   'اشتروا': [
            'اشْتَرَوُا',
            'اشْتَرَوْا'], 
   'ساقيها': [
            'سَاقَيْهَا'], 
   'فراغ': [
          'فَرَاغَ'], 
   'تخرجوا': [
            'تَخْرُجُوا'], 
   'غني': [
         'غَنِيٌّ'], 
   'إليهم': [
           'إِلَيْهِمْ',
           'إِلَيْهِمُ'], 
   'مشفقون': [
            'مُشْفِقُونَ'], 
   'فرات': [
          'فُرَاتٌ'], 
   'غنم': [
         'غَنَمُ'], 
   'وأنا': [
          'وَأَنَا',
          'وَأَنَّا'], 
   'فاغسلوا': [
             'فَاغْسِلُوا'], 
   'قيام': [
          'قِيَامٍ',
          'قِيَامٌ'], 
   'وأنت': [
          'وَأَنْتَ'], 
   'ماكثين': [
            'مَاكِثِينَ'], 
   'لقينا': [
           'لَقِينَا'], 
   'بسحر': [
          'بِسِحْرٍ',
          'بِسَحَرٍ'], 
   'يسير': [
          'يَسِيرٌ',
          'يَسِيرٍ'], 
   'فأحيينا': [
             'فَأَحْيَيْنَا'], 
   'قالوا': [
           'قَالُوا'], 
   'فأذاقها': [
             'فَأَذَاقَهَا'], 
   'يوفضون': [
            'يُوفِضُونَ'], 
   'توكلت': [
           'تَوَكَّلْتُ'], 
   'تحشرون': [
            'تُحْشَرُونَ'], 
   'وجاءت': [
           'وَجَاءَتْ'], 
   'فطبع': [
          'فَطُبِعَ'], 
   'بيوتنا': [
            'بُيُوتَنَا'], 
   'وأدعو': [
           'وَأَدْعُو'], 
   'نذرا': [
          'نُذْرًا'], 
   'تخونوا': [
            'تَخُونُوا'], 
   'فيعذبهم': [
             'فَيُعَذِّبُهُمْ'], 
   'سيقول': [
           'سَيَقُولُ'], 
   'تعجل': [
          'تَعْجَلْ',
          'تَعَجَّلَ'], 
   'فتذروها': [
             'فَتَذَرُوهَا'], 
   'فقير': [
          'فَقِيرٌ'], 
   'وأعانه': [
            'وَأَعَانَهُ'], 
   'فسيرى': [
           'فَسَيَرَى'], 
   'القارعة': [
             'الْقَارِعَةُ'], 
   'والمؤتفكات': [
                'وَالْمُؤْتَفِكَاتِ',
                'وَالْمُؤْتَفِكَاتُ'], 
   'لقومهم': [
            'لِقَوْمِهِمْ'], 
   'وسلام': [
           'وَسَلَامٌ'], 
   'موزون': [
           'مَوْزُونٍ'], 
   'تجعلني': [
            'تَجْعَلْنِي'], 
   'تبغوا': [
           'تَبْغُوا'], 
   'كالمعلقة': [
              'كَالْمُعَلَّقَةِ'], 
   'فارهبون': [
             'فَارْهَبُونِ'], 
   'لننصر': [
           'لَنَنْصُرُ'], 
   'مدا': [
         'مَدًّا'], 
   'تعجب': [
          'تَعْجَبْ'], 
   'إليكما': [
            'إِلَيْكُمَا'], 
   'مدت': [
         'مُدَّتْ'], 
   'وتواصوا': [
             'وَتَوَاصَوْا'], 
   'ظاهر': [
          'ظَاهِرَ'], 
   'ويحبونه': [
             'وَيُحِبُّونَهُ'], 
   'بطشتنا': [
            'بَطْشَتَنَا'], 
   'فأوعى': [
           'فَأَوْعَى'], 
   'لينة': [
          'لِينَةٍ'], 
   'قاطعة': [
           'قَاطِعَةً'], 
   'وزدناهم': [
             'وَزِدْنَاهُمْ'], 
   'واسعة': [
           'وَاسِعَةٌ',
           'وَاسِعَةٍ',
           'وَاسِعَةً'], 
   'تجعلنا': [
            'تَجْعَلْنَا'], 
   'واسعا': [
           'وَاسِعًا'], 
   'مردا': [
          'مَرَدًّا'], 
   'لينا': [
          'لَيِّنًا'], 
   'حاجزا': [
           'حَاجِزًا'], 
   'وأنك': [
          'وَأَنَّكَ'], 
   'وأنه': [
          'وَأَنَّهُ'], 
   'وأنى': [
          'وَأَنَّى'], 
   'وأني': [
          'وَأَنِّي'], 
   'التوبة': [
            'التَّوْبَةُ',
            'التَّوْبَةَ'], 
   'مثليهم': [
            'مِثْلَيْهِمْ'], 
   'نذير': [
          'نَذِيرٌ',
          'نَذِيرٍ',
          'نَذِيرِ'], 
   'وجاءه': [
           'وَجَاءَهُ'], 
   'لائم': [
          'لَائِمٍ'], 
   'الأعناق': [
             'الْأَعْنَاقِ'], 
   'وجاءك': [
           'وَجَاءَكَ'], 
   'ببنيه': [
           'بِبَنِيهِ'], 
   'صريخ': [
          'صَرِيخَ'], 
   'فليؤد': [
           'فَلْيُؤَدِّ'], 
   'ألسنتهم': [
             'أَلْسِنَتُهُمْ',
             'أَلْسِنَتُهُمُ',
             'أَلْسِنَتَهُمْ'], 
   'فتبارك': [
            'فَتَبَارَكَ'], 
   'عبرة': [
          'عِبْرَةٌ'], 
   'عبادكم': [
            'عِبَادِكُمْ'], 
   'فوت': [
         'فَوْتَ'], 
   'نتقنا': [
           'نَتَقْنَا'], 
   'أعجلتم': [
            'أَعَجِلْتُمْ'], 
   'الأجداث': [
             'الْأَجْدَاثِ'], 
   'دين': [
         'دِينِ',
         'دَيْنٍ',
         'دِينُ',
         'دِينَ'], 
   'أذقناه': [
            'أَذَقْنَاهُ'], 
   'قلبين': [
           'قَلْبَيْنِ'], 
   'أكلها': [
           'أُكُلَهَا',
           'أُكُلُهَا'], 
   'فانفلق': [
            'فَانْفَلَقَ'], 
   'ليمسن': [
           'لَيَمَسَّنَّ'], 
   'تحملنا': [
            'تُحَمِّلْنَا'], 
   'فآت': [
         'فَآتِ'], 
   'رطب': [
         'رَطْبٍ'], 
   'ننزله': [
           'نُنَزِّلُهُ'], 
   'المفلحين': [
              'الْمُفْلِحِينَ'], 
   'وبصلها': [
            'وَبَصَلِهَا'], 
   'تتبعوا': [
            'تَتَّبِعُوا'], 
   'الشقة': [
           'الشُّقَّةُ'], 
   'سويته': [
           'سَوَّيْتُهُ'], 
   'تنقمون': [
            'تَنْقِمُونَ'], 
   'وهب': [
         'وَهَبْ',
         'وَهَبَ'], 
   'الظلمات': [
             'الظُّلُمَاتِ',
             'الظُّلُمَاتُ'], 
   'ونحشر': [
           'وَنَحْشُرُ'], 
   'وتحبون': [
            'وَتُحِبُّونَ'], 
   'مائتين': [
            'مِائَتَيْنِ'], 
   'تفثهم': [
           'تَفَثَهُمْ'], 
   'وقمرا': [
           'وَقَمَرًا'], 
   'يزكون': [
           'يُزَكُّونَ'], 
   'تتبعون': [
            'تَتَّبِعُونَ'], 
   'واديا': [
           'وَادِيًا'], 
   'شبه': [
         'شُبِّهَ'], 
   'تبوءوا': [
            'تَبَوَّءُوا'], 
   'فوق': [
         'فَوْقَ',
         'فَوْقِ'], 
   'وحمر': [
          'وَحُمْرٌ'], 
   'فول': [
         'فَوَلِّ'], 
   'ومريم': [
           'وَمَرْيَمَ'], 
   'البقر': [
           'الْبَقَرِ',
           'الْبَقَرَ'], 
   'بيانه': [
           'بَيَانَهُ'], 
   'نعمته': [
           'نِعْمَتَهُ'], 
   'موتتنا': [
            'مَوْتَتُنَا',
            'مَوْتَتَنَا'], 
   'فأنذر': [
           'فَأَنْذِرْ'], 
   'نعمتك': [
           'نِعْمَتَكَ'], 
   'يحشرون': [
            'يُحْشَرُونَ'], 
   'صدودا': [
           'صُدُودًا'], 
   'المخرجين': [
              'الْمُخْرَجِينَ'], 
   'عزا': [
         'عِزًّا'], 
   'والقانتات': [
               'وَالْقَانِتَاتِ'], 
   'لرأيته': [
            'لَرَأَيْتَهُ'], 
   'نعمتي': [
           'نِعْمَتِيَ',
           'نِعْمَتِي'], 
   'فاعلون': [
            'فَاعِلُونَ'], 
   'دعائهم': [
            'دُعَائِهِمْ'], 
   'صرصر': [
          'صَرْصَرٍ'], 
   'ينقصوكم': [
             'يَنْقُصُوكُمْ'], 
   'والسلام': [
             'وَالسَّلَامُ'], 
   'تسبوا': [
           'تَسُبُّوا'], 
   'سيقولون': [
             'سَيَقُولُونَ'], 
   'الحاقة': [
            'الْحَاقَّةُ'], 
   'وبشرناه': [
             'وَبَشَّرْنَاهُ'], 
   'ضعيفا': [
           'ضَعِيفًا'], 
   'تزكوا': [
           'تُزَكُّوا'], 
   'فأراد': [
           'فَأَرَادَ'], 
   'بنبإ': [
          'بِنَبَإٍ'], 
   'مسني': [
          'مَسَّنِيَ'], 
   'لأي': [
         'لِأَيِّ'], 
   'قتلوه': [
           'قَتَلُوهُ'], 
   'والبحر': [
            'وَالْبَحْرِ',
            'وَالْبَحْرُ'], 
   'تهدوا': [
           'تَهْدُوا'], 
   'فأغويناكم': [
               'فَأَغْوَيْنَاكُمْ'], 
   'مثوى': [
          'مَثْوًى',
          'مَثْوَى'], 
   'وليقولوا': [
              'وَلْيَقُولُوا',
              'وَلِيَقُولُوا'], 
   'وألوانكم': [
              'وَأَلْوَانِكُمْ'], 
   'أبناءهم': [
             'أَبْنَاءَهُمْ',
             'أَبْنَاءَهُمُ'], 
   'والجسم': [
            'وَالْجِسْمِ'], 
   'تحرموا': [
            'تُحَرِّمُوا'], 
   'آتوه': [
          'آتَوْهُ'], 
   'عنهما': [
           'عَنْهُمَا'], 
   'قريتك': [
           'قَرْيَتِكَ'], 
   'فينبئكم': [
             'فَيُنَبِّئُكُمْ'], 
   'وجنوبهم': [
             'وَجُنُوبُهُمْ'], 
   'نكسوا': [
           'نُكِسُوا'], 
   'فأعينوني': [
              'فَأَعِينُونِي'], 
   'أهلكناها': [
              'أَهْلَكْنَاهَا'], 
   'الذئب': [
           'الذِّئْبُ'], 
   'زبرا': [
          'زُبُرًا'], 
   'تردى': [
          'تَرَدَّى'], 
   'أهون': [
          'أَهْوَنُ'], 
   'نسفا': [
          'نَسْفًا'], 
   'وليذيقكم': [
              'وَلِيُذِيقَكُمْ'], 
   'نسفت': [
          'نُسِفَتْ'], 
   'أهوى': [
          'أَهْوَى'], 
   'لمحضرون': [
             'لَمُحْضَرُونَ'], 
   'عنكم': [
          'عَنْكُمْ',
          'عَنْكُمُ'], 
   'أورثنا': [
            'أَوْرَثْنَا'], 
   'زاغت': [
          'زَاغَتْ',
          'زَاغَتِ'], 
   'مفازا': [
           'مَفَازًا'], 
   'وليتذكر': [
             'وَلِيَتَذَكَّرَ'], 
   'فتحا': [
          'فَتْحًا'], 
   'ننكسه': [
           'نُنَكِّسْهُ'], 
   'أبصاركم': [
             'أَبْصَارُكُمْ'], 
   'فتحت': [
          'فُتِحَتْ'], 
   'المرعى': [
            'الْمَرْعَى'], 
   'ساحر': [
          'سَاحِرٌ',
          'سَاحِرٍ'], 
   'مهينا': [
           'مُهِينًا'], 
   'ليؤمنوا': [
             'لِيُؤْمِنُوا'], 
   'مسنا': [
          'مَسَّنَا'], 
   'حديث': [
          'حَدِيثُ',
          'حَدِيثٍ'], 
   'قتلوا': [
           'قُتِلُوا',
           'قَتَلُوا'], 
   'نقيرا': [
           'نَقِيرًا'], 
   'حشرتني': [
            'حَشَرْتَنِي'], 
   'فأخذناه': [
             'فَأَخَذْنَاهُ'], 
   'فأراه': [
           'فَأَرَاهُ'], 
   'ترحمون': [
            'تُرْحَمُونَ'], 
   'وجنى': [
          'وَجَنَى'], 
   'يوفى': [
          'يُوَفَّى'], 
   'يخوضون': [
            'يَخُوضُونَ'], 
   'وأيوب': [
           'وَأَيُّوبَ'], 
   'يضركم': [
           'يَضُرُّكُمْ'], 
   'أعجبتكم': [
             'أَعْجَبَتْكُمْ'], 
   'نترك': [
          'نَتْرُكَ'], 
   'وتصدون': [
            'وَتَصُدُّونَ'], 
   'يوفق': [
          'يُوَفِّقِ'], 
   'تستطيع': [
            'تَسْتَطِيعَ'], 
   'والموقوذة': [
               'وَالْمَوْقُوذَةُ'], 
   'اتخذها': [
            'اتَّخَذَهَا'], 
   'صدقتنا': [
            'صَدَقْتَنَا'], 
   'فتولى': [
           'فَتَوَلَّى'], 
   'لكان': [
          'لَكَانَ'], 
   'بعذابكم': [
             'بِعَذَابِكُمْ'], 
   'المستقيم': [
              'الْمُسْتَقِيمَ',
              'الْمُسْتَقِيمِ'], 
   'تحذرون': [
            'تَحْذَرُونَ'], 
   'ينقلب': [
           'يَنْقَلِبْ',
           'يَنْقَلِبُ',
           'يَنْقَلِبَ'], 
   'واحذروا': [
             'وَاحْذَرُوا'], 
   'الحواريين': [
               'الْحَوَارِيِّينَ'], 
   'حللتم': [
           'حَلَلْتُمْ'], 
   'الأولى': [
            'الْأُولَى'], 
   'الأتقى': [
            'الْأَتْقَى'], 
   'أريد': [
          'أُرِيدُ',
          'أُرِيدَ'], 
   'عرضها': [
           'عَرْضُهَا'], 
   'وإثمك': [
           'وَإِثْمِكَ'], 
   'وأثابهم': [
             'وَأَثَابَهُمْ'], 
   'الرزق': [
           'الرِّزْقَ',
           'الرِّزْقِ'], 
   'مذعنين': [
            'مُذْعِنِينَ'], 
   'فيومئذ': [
            'فَيَوْمَئِذٍ'], 
   'يعقلون': [
            'يَعْقِلُونَ'], 
   'نعف': [
         'نَعْفُ'], 
   'طالوت': [
           'طَالُوتُ',
           'طَالُوتَ'], 
   'نعم': [
         'نِعْمَ',
         'نَعَمْ'], 
   'نعليك': [
           'نَعْلَيْكَ'], 
   'فأدلى': [
           'فَأَدْلَى'], 
   'عرضهم': [
           'عَرَضَهُمْ'], 
   'وجدكم': [
           'وُجْدِكُمْ'], 
   'الخالقون': [
              'الْخَالِقُونَ'], 
   'فتذكر': [
           'فَتُذَكِّرَ'], 
   'ودرسوا': [
            'وَدَرَسُوا'], 
   'ويكفوا': [
            'وَيَكُفُّوا'], 
   'أتتركون': [
             'أَتُتْرَكُونَ'], 
   'بجبار': [
           'بِجَبَّارٍ'], 
   'وجنت': [
          'وَجَنَّتُ'], 
   'لهدمت': [
           'لَهُدِّمَتْ'], 
   'وجنة': [
          'وَجَنَّةٍ'], 
   'صفراء': [
           'صَفْرَاءُ'], 
   'وصما': [
          'وَصُمًّا'], 
   'فيرسل': [
           'فَيُرْسِلَ'], 
   'يتكلمون': [
             'يَتَكَلَّمُونَ'], 
   'فيأتيهم': [
             'فَيَأْتِيَهُمْ'], 
   'اسكن': [
          'اسْكُنْ'], 
   'ومهدت': [
           'وَمَهَّدْتُ'], 
   'يأتيهم': [
            'يَأْتِيهِمْ',
            'يَأْتِيَهُمْ',
            'يَأْتِيَهُمُ',
            'يَأْتِيهِمُ'], 
   'عضوا': [
          'عَضُّوا'], 
   'ويكأن': [
           'وَيْكَأَنَّ'], 
   'ويسر': [
          'وَيَسِّرْ'], 
   'موضونة': [
            'مَوْضُونَةٍ'], 
   'ووضعته': [
            'وَوَضَعَتْهُ'], 
   'كذبوكم': [
            'كَذَّبُوكُمْ'], 
   'لي': [
        'لِي',
        'لِيَ'], 
   'لو': [
        'لَوْ',
        'لَوِ'], 
   'صدورهم': [
            'صُدُورِهِمْ',
            'صُدُورُهُمْ',
            'صُدُورَهُمْ'], 
   'لن': [
        'لَنْ'], 
   'له': [
        'لَهُ'], 
   'لم': [
        'لَمْ',
        'لِمَ'], 
   'سمعكم': [
           'سَمْعُكُمْ',
           'سَمْعَكُمْ'], 
   'وكانوا': [
            'وَكَانُوا'], 
   'يلحدون': [
            'يُلْحِدُونَ'], 
   'لشركائهم': [
              'لِشُرَكَائِهِمْ'], 
   'تشقق': [
          'تَشَقَّقُ'], 
   'طعموا': [
           'طَعِمُوا'], 
   'والمؤمنون': [
               'وَالْمُؤْمِنُونَ'], 
   'ولنجزينهم': [
               'وَلَنَجْزِيَنَّهُمْ'], 
   'حسنهن': [
           'حُسْنُهُنَّ'], 
   'أنزلت': [
           'أُنْزِلَتْ',
           'أَنْزَلْتَ',
           'أُنْزِلَتِ',
           'أَنْزَلْتُ'], 
   'إما': [
         'إِمَّا'], 
   'والمغارب': [
              'وَالْمَغَارِبِ'], 
   'والمسلمات': [
               'وَالْمُسْلِمَاتِ'], 
   'لحق': [
         'لَحَقٌّ',
         'لَحَقُّ'], 
   'ولنرسلن': [
             'وَلَنُرْسِلَنَّ'], 
   'لحم': [
         'لَحْمَ'], 
   'لحن': [
         'لَحْنِ'], 
   'وزخرفا': [
            'وَزُخْرُفًا'], 
   'مهتدون': [
            'مُهْتَدُونَ'], 
   'دخلتم': [
           'دَخَلْتُمْ'], 
   'فأخلفتم': [
             'فَأَخْلَفْتُمْ'], 
   'وأنزلنا': [
             'وَأَنْزَلْنَا'], 
   'صورة': [
          'صُورَةٍ'], 
   'الموتة': [
            'الْمَوْتَةَ'], 
   'تنهرهما': [
             'تَنْهَرْهُمَا'], 
   'بقطع': [
          'بِقِطْعٍ'], 
   'مبلغهم': [
            'مَبْلَغُهُمْ'], 
   'الحسنة': [
            'الْحَسَنَةِ',
            'الْحَسَنَةُ',
            'الْحَسَنَةَ'], 
   'حصونهم': [
            'حُصُونُهُمْ'], 
   'لعدتهن': [
            'لِعِدَّتِهِنَّ'], 
   'تعملون': [
            'تَعْمَلُونَ'], 
   'تحاجون': [
            'تُحَاجُّونَ'], 
   'وصلوات': [
            'وَصَلَوَاتِ',
            'وَصَلَوَاتٌ'], 
   'جذوع': [
          'جُذُوعِ'], 
   'لتسلكوا': [
             'لِتَسْلُكُوا'], 
   'المهاجرين': [
               'الْمُهَاجِرِينَ'], 
   'اصطفيتك': [
             'اصْطَفَيْتُكَ'], 
   'فغفر': [
          'فَغَفَرَ'], 
   'ويسلموا': [
             'وَيُسَلِّمُوا'], 
   'فبظلم': [
           'فَبِظُلْمٍ'], 
   'جذوة': [
          'جَذْوَةٍ'], 
   'لوجه': [
          'لِوَجْهِ'], 
   'فساد': [
          'فَسَادٍ'], 
   'الحسنى': [
            'الْحُسْنَى'], 
   'لبثنا': [
           'لَبِثْنَا'], 
   'كتابنا': [
            'كِتَابُنَا'], 
   'وعذبناها': [
              'وَعَذَّبْنَاهَا'], 
   'وأشد': [
          'وَأَشَدَّ',
          'وَأَشَدُّ'], 
   'لأقطعن': [
            'لَأُقَطِّعَنَّ'], 
   'فتبسم': [
           'فَتَبَسَّمَ'], 
   'صفر': [
         'صُفْرٌ'], 
   'لا': [
        'لَا'], 
   'حليهم': [
           'حُلِيِّهِمْ'], 
   'وكونوا': [
            'وَكُونُوا'], 
   'فتخشى': [
           'فَتَخْشَى'], 
   'لتأتنني': [
             'لَتَأْتُنَّنِي'], 
   'وخاتم': [
           'وَخَاتَمَ'], 
   'لتستووا': [
             'لِتَسْتَوُوا'], 
   'الطارق': [
            'الطَّارِقُ'], 
   'أتمدونن': [
             'أَتُمِدُّونَنِ'], 
   'كالدهان': [
             'كَالدِّهَانِ'], 
   'وآمنتم': [
            'وَآمَنْتُمْ'], 
   'فأحسن': [
           'فَأَحْسَنَ'], 
   'مشهودا': [
            'مَشْهُودًا'], 
   'عوج': [
         'عِوَجَ',
         'عِوَجٍ'], 
   'للشهادة': [
             'لِلشَّهَادَةِ'], 
   'ميلا': [
          'مَيْلًا'], 
   'ادخلا': [
           'ادْخُلَا'], 
   'يعلم': [
          'يَعْلَمُ',
          'يَعْلَمْ',
          'يَعْلَمِ',
          'يَعْلَمَ'], 
   'يقول': [
          'يَقُولُ',
          'يَقُولَ'], 
   'يقوم': [
          'يَقُومُ'], 
   'وأرجلهم': [
             'وَأَرْجُلُهُمْ'], 
   'فجاءها': [
            'فَجَاءَهَا'], 
   'قدره': [
          'قَدْرِهِ',
          'قَدَرُهُ'], 
   'يعذبكم': [
            'يُعَذِّبْكُمْ',
            'يُعَذِّبُكُمْ'], 
   'ذكره': [
          'ذَكَرَهُ'], 
   'وتكون': [
           'وَتَكُونُ',
           'وَتَكُونَ'], 
   'جلودكم': [
            'جُلُودُكُمْ'], 
   'وأحضرت': [
            'وَأُحْضِرَتِ'], 
   'لأزيدنكم': [
              'لَأَزِيدَنَّكُمْ'], 
   'المعوقين': [
              'الْمُعَوِّقِينَ'], 
   'لشاعر': [
           'لِشَاعِرٍ'], 
   'مثنى': [
          'مَثْنَى'], 
   'أثر': [
         'أَثَرِ'], 
   'مختال': [
           'مُخْتَالٍ'], 
   'بمؤمن': [
           'بِمُؤْمِنٍ'], 
   'جرحتم': [
           'جَرَحْتُمْ'], 
   'حارب': [
          'حَارَبَ'], 
   'رجالا': [
           'رِجَالًا'], 
   'يضلونكم': [
             'يُضِلُّونَكُمْ'], 
   'سيئاتنا': [
             'سَيِّئَاتِنَا'], 
   'أثم': [
         'أَثُمَّ'], 
   'الوهاب': [
            'الْوَهَّابُ',
            'الْوَهَّابِ'], 
   'وداعيا': [
            'وَدَاعِيًا'], 
   'بطانة': [
           'بِطَانَةً'], 
   'آياتنا': [
            'آيَاتِنَا',
            'آيَاتُنَا'], 
   'نحس': [
         'نَحْسٍ'], 
   'ذكرانا': [
            'ذُكْرَانًا'], 
   'كادوا': [
           'كَادُوا'], 
   'ودا': [
         'وُدًّا',
         'وَدًّا'], 
   'فاكتبوه': [
             'فَاكْتُبُوهُ'], 
   'سنعيدها': [
             'سَنُعِيدُهَا'], 
   'ادخلي': [
           'ادْخُلِي'], 
   'مسرفون': [
            'مُسْرِفُونَ'], 
   'لتتلو': [
           'لِتَتْلُوَ'], 
   'سميع': [
          'سَمِيعٌ',
          'سَمِيعُ'], 
   'غافلا': [
           'غَافِلًا'], 
   'وأنفسنا': [
             'وَأَنْفُسَنَا'], 
   'وتبارك': [
            'وَتَبَارَكَ'], 
   'الغني': [
           'الْغَنِيُّ'], 
   'أمتا': [
          'أَمْتًا'], 
   'ابنك': [
          'ابْنَكَ'], 
   'قدرا': [
          'قَدْرًا',
          'قَدَرًا'], 
   'نسينا': [
           'نَسِينَا'], 
   'اسمه': [
          'اسْمُهُ'], 
   'يهدوننا': [
             'يَهْدُونَنَا'], 
   'سعيها': [
           'سَعْيَهَا'], 
   'الذكر': [
           'الذِّكْرَ',
           'الذِّكْرِ',
           'الذِّكْرُ',
           'الذَّكَرَ',
           'الذَّكَرُ'], 
   'أعمامكم': [
             'أَعْمَامِكُمْ'], 
   'آلهتهم': [
            'آلِهَتِهِمْ',
            'آلِهَتُهُمُ'], 
   'أمرتك': [
           'أَمَرْتُكَ'], 
   'كوكبا': [
           'كَوْكَبًا'], 
   'ليقضوا': [
            'لْيَقْضُوا'], 
   'كيدهن': [
           'كَيْدَهُنَّ'], 
   'كيدهم': [
           'كَيْدُهُمْ',
           'كَيْدَهُمْ'], 
   'يصنعون': [
            'يَصْنَعُونَ'], 
   'مرضاتي': [
            'مَرْضَاتِي'], 
   'جناحك': [
           'جَنَاحَكَ',
           'جَنَاحِكَ'], 
   'ممسكات': [
            'مُمْسِكَاتُ'], 
   'معهم': [
          'مَعَهُمْ',
          'مَعَهُمُ'], 
   'وتقول': [
           'وَتَقُولُ'], 
   'ترميهم': [
            'تَرْمِيهِمْ'], 
   'وقدرنا': [
            'وَقَدَّرْنَا'], 
   'تولج': [
          'تُولِجُ'], 
   'عظيما': [
           'عَظِيمًا'], 
   'نأت': [
         'نَأْتِ'], 
   'حرمنا': [
           'حَرَّمْنَا'], 
   'واذكروا': [
             'وَاذْكُرُوا'], 
   'فتية': [
          'فِتْيَةٌ'], 
   'يكتبون': [
            'يَكْتُبُونَ'], 
   'بالروح': [
            'بِالرُّوحِ'], 
   'كالذي': [
           'كَالَّذِي'], 
   'غافلون': [
            'غَافِلُونَ'], 
   'وأنبتنا': [
             'وَأَنْبَتْنَا'], 
   'لستم': [
          'لَسْتُمْ'], 
   'تفسحوا': [
            'تَفَسَّحُوا'], 
   'لستن': [
          'لَسْتُنَّ'], 
   'وسلك': [
          'وَسَلَكَ'], 
   'واعف': [
          'وَاعْفُ'], 
   'أخرجكم': [
            'أَخْرَجَكُمْ'], 
   'أنفقتم': [
            'أَنْفَقْتُمْ'], 
   'معها': [
          'مَعَهَا'], 
   'حتى': [
         'حَتَّى'], 
   'نبيا': [
          'نَبِيًّا'], 
   'جاءتك': [
           'جَاءَتْكَ'], 
   'أقلامهم': [
             'أَقْلَامَهُمْ'], 
   'ضيزى': [
          'ضِيزَى'], 
   'طينا': [
          'طِينًا'], 
   'واذكر': [
           'وَاذْكُرْ',
           'وَاذْكُرِ'], 
   'أسمع': [
          'أَسْمِعْ',
          'أَسْمَعُ'], 
   'واذكروه': [
             'وَاذْكُرُوهُ'], 
   'رسالة': [
           'رِسَالَةَ'], 
   'أأنذرتهم': [
              'أَأَنْذَرْتَهُمْ'], 
   'نصروهم': [
            'نَصَرُوهُمْ'], 
   'ولتتقوا': [
             'وَلِتَتَّقُوا'], 
   'مقيتا': [
           'مُقِيتًا'], 
   'بهتان': [
           'بُهْتَانٌ'], 
   'للمتكبرين': [
               'لِلْمُتَكَبِّرِينَ'], 
   'النشأة': [
            'النَّشْأَةَ'], 
   'سعيهم': [
           'سَعْيُهُمْ'], 
   'بالشهادة': [
              'بِالشَّهَادَةِ'], 
   'معزل': [
          'مَعْزِلٍ'], 
   'شقوتنا': [
            'شِقْوَتُنَا'], 
   'لكلماته': [
             'لِكَلِمَاتِهِ'], 
   'بالساحل': [
             'بِالسَّاحِلِ'], 
   'شهرين': [
           'شَهْرَيْنِ'], 
   'دائبين': [
            'دَائِبَيْنِ'], 
   'مؤمنون': [
            'مُؤْمِنُونَ'], 
   'اعتدى': [
           'اعْتَدَى'], 
   'شاهدين': [
            'شَاهِدِينَ'], 
   'يكفله': [
           'يَكْفُلُهُ'], 
   'بالعبد': [
            'بِالْعَبْدِ'], 
   'السحاب': [
            'السَّحَابِ',
            'السَّحَابَ'], 
   'يضره': [
          'يَضُرُّهُ'], 
   'فرطتم': [
           'فَرَّطْتُمْ'], 
   'يضرك': [
          'يَضُرُّكَ'], 
   'ومأجوج': [
            'وَمَأْجُوجُ',
            'وَمَأْجُوجَ'], 
   'تركوا': [
           'تَرَكُوا'], 
   'حسابهم': [
            'حِسَابِهِمْ',
            'حِسَابُهُمْ',
            'حِسَابَهُمْ'], 
   'يكونون': [
            'يَكُونُونَ'], 
   'تبدون': [
           'تُبْدُونَ'], 
   'وتوفى': [
           'وَتُوَفَّى'], 
   'بقرة': [
          'بَقَرَةٌ',
          'بَقَرَةً'], 
   'اليقين': [
            'الْيَقِينِ',
            'الْيَقِينُ'], 
   'يحاوره': [
            'يُحَاوِرُهُ'], 
   'أهليهم': [
            'أَهْلِيهِمْ'], 
   'عامين': [
           'عَامَيْنِ'], 
   'نقذف': [
          'نَقْذِفُ'], 
   'الأيمن': [
            'الْأَيْمَنِ',
            'الْأَيْمَنَ'], 
   'أرضعيه': [
            'أَرْضِعِيهِ'], 
   'وزينه': [
           'وَزَيَّنَهُ'], 
   'مسومين': [
            'مُسَوِّمِينَ'], 
   'واغلظ': [
           'وَاغْلُظْ'], 
   'تبدوا': [
           'تُبْدُوا'], 
   'نكحتم': [
           'نَكَحْتُمُ'], 
   'وثقالا': [
            'وَثِقَالًا'], 
   'بالطيب': [
            'بِالطَّيِّبِ'], 
   'بالشاكرين': [
               'بِالشَّاكِرِينَ'], 
   'تقدروا': [
            'تَقْدِرُوا'], 
   'يضربن': [
           'يَضْرِبْنَ'], 
   'يصدكم': [
           'يَصُدَّكُمْ'], 
   'وجرين': [
           'وَجَرَيْنَ'], 
   'منكرون': [
            'مُنْكِرُونَ',
            'مُنْكَرُونَ'], 
   'أنظر': [
          'أَنْظُرْ'], 
   'أطلع': [
          'أَطَّلِعُ',
          'أَطَّلَعَ'], 
   'أفكلما': [
            'أَفَكُلَّمَا'], 
   'الخاسرون': [
              'الْخَاسِرُونَ'], 
   'يستوون': [
            'يَسْتَوُونَ'], 
   'متكبر': [
           'مُتَكَبِّرٍ'], 
   'الأخلاء': [
             'الْأَخِلَّاءُ'], 
   'تبسل': [
          'تُبْسَلَ'], 
   'والدار': [
            'وَالدَّارُ',
            'وَالدَّارَ'], 
   'يضرب': [
          'يَضْرِبُ',
          'يَضْرِبَ'], 
   'ثيابهم': [
            'ثِيَابَهُمْ'], 
   'وعصينا': [
            'وَعَصَيْنَا'], 
   'حذركم': [
           'حِذْرَكُمْ'], 
   'أحدكم': [
           'أَحَدَكُمُ',
           'أَحَدُكُمْ',
           'أَحَدَكُمْ'], 
   'يسرا': [
          'يُسْرًا'], 
   'والنجم': [
            'وَالنَّجْمِ',
            'وَالنَّجْمُ'], 
   'ظلمات': [
           'ظُلُمَاتِ',
           'ظُلُمَاتٍ',
           'ظُلُمَاتٌ'], 
   'بجانبه': [
            'بِجَانِبِهِ'], 
   'ورضوانا': [
             'وَرِضْوَانًا'], 
   'استوى': [
           'اسْتَوَى'], 
   'قلوبكم': [
            'قُلُوبِكُمْ',
            'قُلُوبُكُمْ'], 
   'قريبا': [
           'قَرِيبًا'], 
   'فأوردهم': [
             'فَأَوْرَدَهُمُ'], 
   'الكتاب': [
            'الْكِتَابَ',
            'الْكِتَابِ',
            'الْكِتَابُ'], 
   'أولا': [
          'أَوَلَا'], 
   'مرفوعة': [
            'مَرْفُوعَةٍ',
            'مَرْفُوعَةٌ'], 
   'صدقت': [
          'صَدَّقْتَ'], 
   'صدقة': [
          'صَدَقَةٍ',
          'صَدَقَةً'], 
   'وتسعون': [
            'وَتِسْعُونَ'], 
   'فتبينوا': [
             'فَتَبَيَّنُوا'], 
   'أبلغتكم': [
             'أَبْلَغْتُكُمْ'], 
   'وآلهتك': [
            'وَآلِهَتَكَ'], 
   'ننجيك': [
           'نُنَجِّيكَ'], 
   'واضربوا': [
             'وَاضْرِبُوا'], 
   'وسبعة': [
           'وَسَبْعَةٍ'], 
   'اتبعون': [
            'اتَّبِعُونِ'], 
   'لحدود': [
           'لِحُدُودِ'], 
   'الباب': [
           'الْبَابَ',
           'الْبَابِ'], 
   'والساعة': [
             'وَالسَّاعَةُ'], 
   'يتفطرن': [
            'يَتَفَطَّرْنَ'], 
   'اثنتي': [
           'اثْنَتَيْ'], 
   'ولذكر': [
           'وَلَذِكْرُ'], 
   'الموقدة': [
             'الْمُوقَدَةُ'], 
   'فاكهين': [
            'فَاكِهِينَ'], 
   'وأسلحتهم': [
              'وَأَسْلِحَتَهُمْ'], 
   'فصدهم': [
           'فَصَدَّهُمْ'], 
   'أبدله': [
           'أُبَدِّلَهُ'], 
   'وأخذتم': [
            'وَأَخَذْتُمْ'], 
   'فيكم': [
          'فِيكُمْ'], 
   'مجنون': [
           'مَجْنُونٌ',
           'مَجْنُونٍ'], 
   'أهذا': [
          'أَهَذَا'], 
   'يوصين': [
           'يُوصِينَ'], 
   'كهفهم': [
           'كَهْفِهِمْ'], 
   'فواق': [
          'فَوَاقٍ'], 
   'آزر': [
         'آزَرَ'], 
   'فرشناها': [
             'فَرَشْنَاهَا'], 
   'اثنتا': [
           'اثْنَتَا'], 
   'فزادهم': [
            'فَزَادَهُمْ',
            'فَزَادَهُمُ'], 
   'تجد': [
         'تَجِدَ',
         'تَجِدُ'], 
   'منافقون': [
             'مُنَافِقُونَ'], 
   'ببهتان': [
            'بِبُهْتَانٍ'], 
   'طلعت': [
          'طَلَعَتْ'], 
   'يسره': [
          'يَسَّرَهُ'], 
   'أمسك': [
          'أَمْسِكْ',
          'أَمْسَكَ'], 
   'يسرق': [
          'يَسْرِقْ'], 
   'هن': [
        'هُنَّ'], 
   'ورهبانا': [
             'وَرُهْبَانًا'], 
   'فتمثل': [
           'فَتَمَثَّلَ'], 
   'تستكبرون': [
              'تَسْتَكْبِرُونَ'], 
   'أولم': [
          'أَوَلَمْ'], 
   'وإذا': [
          'وَإِذَا',
          'وَإِذًا'], 
   'أولى': [
          'أَوْلَى'], 
   'أولو': [
          'أُولُو',
          'أَوَلَوْ'], 
   'أولي': [
          'أُولِي'], 
   'ونستحيي': [
             'وَنَسْتَحْيِي'], 
   'يستأذنونك': [
               'يَسْتَأْذِنُونَكَ'], 
   'يواري': [
           'يُوَارِي'], 
   'قل': [
        'قُلْ',
        'قُلِ',
        'قَلَّ'], 
   'قم': [
        'قُمْ',
        'قُمِ'], 
   'وتبرئ': [
           'وَتُبْرِئُ'], 
   'تضار': [
          'تُضَارَّ'], 
   'زعم': [
         'زَعَمَ'], 
   'معروفة': [
            'مَعْرُوفَةٌ'], 
   'نسوه': [
          'نَسُوهُ'], 
   'وشيء': [
          'وَشَيْءٍ'], 
   'وسواء': [
           'وَسَوَاءٌ'], 
   'فلنأتينك': [
              'فَلَنَأْتِيَنَّكَ'], 
   'الوريد': [
            'الْوَرِيدِ'], 
   'ينصرونه': [
             'يَنْصُرُونَهُ'], 
   'أموالهم': [
             'أَمْوَالَهُمْ',
             'أَمْوَالِهِمْ',
             'أَمْوَالُهُمْ',
             'أَمْوَالَهُمُ'], 
   'ولنسكننكم': [
               'وَلَنُسْكِنَنَّكُمُ'], 
   'ورواحها': [
             'وَرَوَاحُهَا'], 
   'لتنبؤن': [
            'لَتُنَبَّؤُنَّ'], 
   'وعلمتم': [
            'وَعُلِّمْتُمْ'], 
   'فطر': [
         'فَطَرَ'], 
   'بصحاف': [
           'بِصِحَافٍ'], 
   'وأفئدة': [
            'وَأَفْئِدَةً'], 
   'النخل': [
           'النَّخْلِ'], 
   'الشاهدين': [
              'الشَّاهِدِينَ'], 
   'سموهم': [
           'سَمُّوهُمْ'], 
   'أخواتهن': [
             'أَخَوَاتِهِنَّ'], 
   'موته': [
          'مَوْتِهِ'], 
   'والمرسلات': [
               'وَالْمُرْسَلَاتِ'], 
   'ينشر': [
          'يَنْشُرْ'], 
   'اسودت': [
           'اسْوَدَّتْ'], 
   'سنراود': [
            'سَنُرَاوِدُ'], 
   'وظاهروا': [
             'وَظَاهَرُوا'], 
   'لجمعهم': [
            'لَجَمَعَهُمْ'], 
   'دعاؤكم': [
            'دُعَاؤُكُمْ'], 
   'لينذر': [
           'لِيُنْذِرَ'], 
   'ينشأ': [
          'يُنَشَّأُ'], 
   'سلما': [
          'سُلَّمًا',
          'سَلَمًا'], 
   'ينشئ': [
          'يُنْشِئُ'], 
   'وأيدناه': [
             'وَأَيَّدْنَاهُ'], 
   'فاستجاب': [
             'فَاسْتَجَابَ'], 
   'موتا': [
          'مَوْتًا'], 
   'خبزا': [
          'خُبْزًا'], 
   'يغيروا': [
            'يُغَيِّرُوا'], 
   'شرقية': [
           'شَرْقِيَّةٍ'], 
   'وتوفنا': [
            'وَتَوَفَّنَا'], 
   'ولتنازعتم': [
               'وَلَتَنَازَعْتُمْ'], 
   'قد': [
        'قَدْ',
        'قُدَّ',
        'قَدِ'], 
   'حيران': [
           'حَيْرَانَ'], 
   'كمثل': [
          'كَمَثَلِ'], 
   'ولأغوينهم': [
               'وَلَأُغْوِيَنَّهُمْ'], 
   'أقوم': [
          'أَقْوَمُ'], 
   'الخيرة': [
            'الْخِيَرَةُ'], 
   'مترفيهم': [
             'مُتْرَفِيهِمْ'], 
   'ليبلغ': [
           'لِيَبْلُغَ'], 
   'رسلك': [
          'رُسُلِكَ'], 
   'فسيدخلهم': [
              'فَسَيُدْخِلُهُمْ'], 
   'ويدرأ': [
           'وَيَدْرَأُ'], 
   'فأشارت': [
            'فَأَشَارَتْ'], 
   'عليك': [
          'عَلَيْكَ',
          'عَلَيْكِ'], 
   'عزلت': [
          'عَزَلْتَ'], 
   'عليم': [
          'عَلِيمٌ',
          'عَلِيمٍ'], 
   'واحذرهم': [
             'وَاحْذَرْهُمْ'], 
   'عليه': [
          'عَلَيْهِ',
          'عَلَيْهُ'], 
   'والمسكين': [
              'وَالْمِسْكِينَ'], 
   'اقعدوا': [
            'اقْعُدُوا'], 
   'بإذنه': [
           'بِإِذْنِهِ'], 
   'يكادون': [
            'يَكَادُونَ'], 
   'راودتني': [
             'رَاوَدَتْنِي'], 
   'متحيزا': [
            'مُتَحَيِّزًا'], 
   'فتطردهم': [
             'فَتَطْرُدَهُمْ'], 
   'فادعوا': [
            'فَادْعُوا'], 
   'مثل': [
         'مِثْلَ',
         'مَثَلُ',
         'مِثْلُ',
         'مَثَلٍ',
         'مَثَلَ',
         'مَثَلٌ'], 
   'محذورا': [
            'مَحْذُورًا'], 
   'أخرجني': [
            'أَخْرَجَنِي'], 
   'فخورا': [
           'فَخُورًا'], 
   'ويبسط': [
           'وَيَبْسُطُ'], 
   'والسعة': [
            'وَالسَّعَةِ'], 
   'ويحمل': [
           'وَيَحْمِلُ'], 
   'فكسونا': [
            'فَكَسَوْنَا'], 
   'فليذوقوه': [
              'فَلْيَذُوقُوهُ'], 
   'عمران': [
           'عِمْرَانَ'], 
   'فناظرة': [
            'فَنَاظِرَةٌ'], 
   'خروا': [
          'خَرُّوا'], 
   'يردون': [
           'يُرَدُّونَ'], 
   'ينادون': [
            'يُنَادَوْنَ'], 
   'يبعثهم': [
            'يَبْعَثُهُمُ'], 
   'تحروا': [
           'تَحَرَّوْا'], 
   'تعبثون': [
            'تَعْبَثُونَ'], 
   'خوفهم': [
           'خَوْفِهِمْ'], 
   'تعبد': [
          'تَعْبُدُ',
          'تَعْبُدِ'], 
   'يجزى': [
          'يُجْزَى'], 
   'يجزي': [
          'يَجْزِي'], 
   'ونأى': [
          'وَنَأَى'], 
   'وهاجروا': [
             'وَهَاجَرُوا'], 
   'حزنا': [
          'حَزَنًا'], 
   'فسيأتيهم': [
              'فَسَيَأْتِيهِمْ'], 
   'بالأنف': [
            'بِالْأَنْفِ'], 
   'إخوانهن': [
             'إِخْوَانِهِنَّ'], 
   'يتفيأ': [
           'يَتَفَيَّأُ'], 
   'عاصم': [
          'عَاصِمٍ',
          'عَاصِمَ'], 
   'بما': [
         'بِمَا'], 
   'تعثوا': [
           'تَعْثَوْا'], 
   'عليا': [
          'عَلِيًّا'], 
   'عذت': [
         'عُذْتُ'], 
   'عذب': [
         'عَذْبٌ'], 
   'يغشاها': [
            'يَغْشَاهَا'], 
   'فحدث': [
          'فَحَدِّثْ'], 
   'أفبالباطل': [
               'أَفَبِالْبَاطِلِ'], 
   'المصلح': [
            'الْمُصْلِحِ'], 
   'نسارع': [
           'نُسَارِعُ'], 
   'أصوافها': [
             'أَصْوَافِهَا'], 
   'مفترون': [
            'مُفْتَرُونَ'], 
   'الأسباب': [
             'الْأَسْبَابِ',
             'الْأَسْبَابُ',
             'الْأَسْبَابَ'], 
   'ركوبهم': [
            'رَكُوبُهُمْ'], 
   'تقتلني': [
            'تَقْتُلَنِي'], 
   'سحار': [
          'سَحَّارٍ'], 
   'وعتوا': [
           'وَعَتَوْا'], 
   'أخ': [
        'أَخٌ'], 
   'فعليها': [
            'فَعَلَيْهَا'], 
   'ويستنبئونك': [
                'وَيَسْتَنْبِئُونَكَ'], 
   'الياقوت': [
             'الْيَاقُوتُ'], 
   'وأتبعناهم': [
               'وَأَتْبَعْنَاهُمْ'], 
   'والشفع': [
            'وَالشَّفْعِ'], 
   'فلنأتينهم': [
               'فَلَنَأْتِيَنَّهُمْ'], 
   'فلينفق': [
            'فَلْيُنْفِقْ'], 
   'ترهبون': [
            'تُرْهِبُونَ'], 
   'الممات': [
            'الْمَمَاتِ'], 
   'وقال': [
          'وَقَالَ'], 
   'أعداء': [
           'أَعْدَاءً',
           'أَعْدَاءِ',
           'أَعْدَاءُ'], 
   'وألزمهم': [
             'وَأَلْزَمَهُمْ'], 
   'فبئس': [
          'فَبِئْسَ'], 
   'جراد': [
          'جَرَادٌ'], 
   'ثقلت': [
          'ثَقُلَتْ'], 
   'ويذكروا': [
             'وَيَذْكُرُوا'], 
   'وكنتم': [
           'وَكُنْتُمْ'], 
   'بقبول': [
           'بِقَبُولٍ'], 
   'فأغرقناه': [
              'فَأَغْرَقْنَاهُ'], 
   'للملإ': [
           'لِلْمَلَإِ'], 
   'وجادلوا': [
             'وَجَادَلُوا'], 
   'الأكرم': [
            'الْأَكْرَمُ'], 
   'أتبع': [
          'أَتَّبِعُ',
          'أَتْبَعَ'], 
   'مثواه': [
           'مَثْوَاهُ'], 
   'أتمم': [
          'أَتْمِمْ'], 
   'متشاكسون': [
              'مُتَشَاكِسُونَ'], 
   'نتبعه': [
           'نَتَّبِعُهُ'], 
   'فمحونا': [
            'فَمَحَوْنَا'], 
   'قضوا': [
          'قَضَوْا'], 
   'والصائمات': [
               'وَالصَّائِمَاتِ'], 
   'ونخوفهم': [
             'وَنُخَوِّفُهُمْ'], 
   'مثواي': [
           'مَثْوَايَ'], 
   'أأسلمتم': [
             'أَأَسْلَمْتُمْ'], 
   'وحفدة': [
           'وَحَفَدَةً'], 
   'ظهره': [
          'ظَهْرِهِ'], 
   'رأتهم': [
           'رَأَتْهُمْ'], 
   'للآخرة': [
            'لَلْآخِرَةَ'], 
   'بيوسف': [
           'بِيُوسُفَ'], 
   'فهزموهم': [
             'فَهَزَمُوهُمْ'], 
   'نساءهم': [
            'نِسَاءَهُمْ'], 
   'يحطمنكم': [
             'يَحْطِمَنَّكُمْ'], 
   'تحاضون': [
            'تَحَاضُّونَ'], 
   'شئت': [
         'شِئْتَ'], 
   'لأزواجك': [
             'لِأَزْوَاجِكَ'], 
   'يفتنهم': [
            'يَفْتِنَهُمْ'], 
   'والصابرات': [
               'وَالصَّابِرَاتِ'], 
   'وتركنا': [
            'وَتَرَكْنَا'], 
   'شجرة': [
          'شَجَرَةٍ',
          'شَجَرَةِ',
          'شَجَرَةُ',
          'شَجَرَةٌ',
          'شَجَرَةً'], 
   'بيان': [
          'بَيَانٌ'], 
   'الأمور': [
            'الْأُمُورُ',
            'الْأُمُورِ',
            'الْأُمُورَ'], 
   'تتقون': [
           'تَتَّقُونَ'], 
   'تحتها': [
           'تَحْتِهَا',
           'تَحْتَهَا'], 
   'والأميين': [
              'وَالْأُمِّيِّينَ'], 
   'يأتوك': [
           'يَأْتُوكَ'], 
   'جار': [
         'جَارٌ'], 
   'يأتون': [
           'يَأْتُونَ'], 
   'مجيب': [
          'مُجِيبٌ'], 
   'تلبسوا': [
            'تَلْبِسُوا'], 
   'للخبيثين': [
              'لِلْخَبِيثِينَ'], 
   'صبوا': [
          'صُبُّوا'], 
   'مقيم': [
          'مُقِيمٌ',
          'مُقِيمٍ',
          'مُقِيمَ'], 
   'وهمت': [
          'وَهَمَّتْ'], 
   'ويرجون': [
            'وَيَرْجُونَ'], 
   'سيناء': [
           'سَيْنَاءَ'], 
   'وهما': [
          'وَهُمَا'], 
   'قوما': [
          'قَوْمًا'], 
   'واستفتحوا': [
               'وَاسْتَفْتَحُوا'], 
   'وتماثيل': [
             'وَتَمَاثِيلَ'], 
   'فأنبئكم': [
             'فَأُنَبِّئُكُمْ'], 
   'صنوان': [
           'صِنْوَانٍ',
           'صِنْوَانٌ'], 
   'أتجادلونني': [
                'أَتُجَادِلُونَنِي'], 
   'بنان': [
          'بَنَانٍ'], 
   'كسبت': [
          'كَسَبَتْ'], 
   'وآخر': [
          'وَآخِرُ',
          'وَآخَرُ',
          'وَآخَرَ'], 
   'تلبسون': [
            'تَلْبِسُونَ'], 
   'أدلكم': [
           'أَدُلُّكُمْ'], 
   'خلوا': [
          'خَلَوْا'], 
   'تعلمن': [
           'تُعَلِّمَنِ'], 
   'كاذبين': [
            'كَاذِبِينَ'], 
   'أحقابا': [
            'أَحْقَابًا'], 
   'قومك': [
          'قَوْمَكَ',
          'قَوْمُكَ',
          'قَوْمِكَ'], 
   'رءوسهم': [
            'رُءُوسِهِمْ',
            'رُءُوسَهُمْ',
            'رُءُوسِهِمُ'], 
   'ثيابا': [
           'ثِيَابًا'], 
   'قومه': [
          'قَوْمِهِ',
          'قَوْمَهُ',
          'قَوْمُهُ'], 
   'فعرفهم': [
            'فَعَرَفَهُمْ'], 
   'يكفيكم': [
            'يَكْفِيَكُمْ'], 
   'يأمرهم': [
            'يَأْمُرُهُمْ'], 
   'فمكث': [
          'فَمَكَثَ'], 
   'ظنوا': [
          'ظَنُّوا'], 
   'طرائق': [
           'طَرَائِقَ'], 
   'واصفح': [
           'وَاصْفَحْ'], 
   'تمش': [
         'تَمْشِ'], 
   'أدركه': [
           'أَدْرَكَهُ'], 
   'ومصدقا': [
            'وَمُصَدِّقًا'], 
   'فاذهبا': [
            'فَاذْهَبَا'], 
   'لمكر': [
          'لَمَكْرٌ'], 
   'تتقوا': [
           'تَتَّقُوا'], 
   'فأردنا': [
            'فَأَرَدْنَا'], 
   'بالصلاة': [
             'بِالصَّلَاةِ'], 
   'تحتهم': [
           'تَحْتِهِمُ',
           'تَحْتِهِمْ'], 
   'أجرموا': [
            'أَجْرَمُوا'], 
   'يأتوا': [
           'يَأْتُوا'], 
   'كاذب': [
          'كَاذِبٌ'], 
   'متخذي': [
           'مُتَّخِذِي'], 
   'التناد': [
            'التَّنَادِ'], 
   'أدعوكم': [
            'أَدْعُوكُمْ'], 
   'وأنفسكم': [
             'وَأَنْفُسِكُمْ',
             'وَأَنْفُسَكُمْ'], 
   'والأعناق': [
              'وَالْأَعْنَاقِ'], 
   'تكفرون': [
            'تَكْفُرُونَ',
            'تَكْفُرُونِ'], 
   'كنتم': [
          'كُنْتُمْ'], 
   'لكبيرة': [
            'لَكَبِيرَةٌ',
            'لَكَبِيرَةً'], 
   'كنتن': [
          'كُنْتُنَّ'], 
   'للعالمين': [
              'لِلْعَالَمِينَ',
              'لِلْعَالِمِينَ'], 
   'بنون': [
          'بَنُونَ'], 
   'الروع': [
           'الرَّوْعُ'], 
   'الر': [
         'الر'], 
   'منيرا': [
           'مُنِيرًا'], 
   'حجة': [
         'حُجَّةٌ',
         'حُجَّةَ'], 
   'حجج': [
         'حِجَجٍ'], 
   'ووضع': [
          'وَوُضِعَ',
          'وَوَضَعَ'], 
   'ونساء': [
           'وَنِسَاءً',
           'وَنِسَاءِ',
           'وَنِسَاءٌ'], 
   'حجر': [
         'حِجْرٍ',
         'حِجْرٌ'], 
   'الناقور': [
             'النَّاقُورِ'], 
   'وجدها': [
           'وَجَدَهَا'], 
   'خلقها': [
           'خَلَقَهَا'], 
   'فينبئهم': [
             'فَيُنَبِّئُهُمْ'], 
   'فردوا': [
           'فَرَدُّوا'], 
   'ويدع': [
          'وَيَدْعُ'], 
   'بإيمانهن': [
              'بِإِيمَانِهِنَّ'], 
   'للعسرى': [
            'لِلْعُسْرَى'], 
   'العاقبة': [
             'الْعَاقِبَةَ'], 
   'فأخذه': [
           'فَأَخَذَهُ'], 
   'وكذبتم': [
            'وَكَذَّبْتُمْ'], 
   'سفها': [
          'سَفَهًا'], 
   'استكانوا': [
              'اسْتَكَانُوا'], 
   'الم': [
         'الم'], 
   'سابغات': [
            'سَابِغَاتٍ'], 
   'لأقعدن': [
            'لَأَقْعُدَنَّ'], 
   'انشزوا': [
            'انْشُزُوا'], 
   'يتيمين': [
            'يَتِيمَيْنِ'], 
   'ثبات': [
          'ثُبَاتٍ'], 
   'سبتهم': [
           'سَبْتِهِمْ'], 
   'فيمكث': [
           'فَيَمْكُثُ'], 
   'وأعدوا': [
            'وَأَعِدُّوا'], 
   'فأحياكم': [
             'فَأَحْيَاكُمْ'], 
   'موقوفون': [
             'مَوْقُوفُونَ'], 
   'البقعة': [
            'الْبُقْعَةِ'], 
   'تكفروا': [
            'تَكْفُرُوا'], 
   'يوما': [
          'يَوْمًا'], 
   'اجتنبوا': [
             'اجْتَنِبُوا',
             'اجْتَنَبُوا'], 
   'والأعناب': [
              'وَالْأَعْنَابِ',
              'وَالْأَعْنَابَ'], 
   'وذكروا': [
            'وَذَكَرُوا'], 
   'تسنيم': [
           'تَسْنِيمٍ'], 
   'يأتيكم': [
            'يَأْتِيكُمْ',
            'يَأْتِيَكُمُ'], 
   'بيننا': [
           'بَيْنَنَا',
           'بَيْنِنَا'], 
   'وتصريف': [
            'وَتَصْرِيفِ'], 
   'بأصحاب': [
            'بِأَصْحَابِ'], 
   'سريع': [
          'سَرِيعُ'], 
   'وذريتها': [
             'وَذُرِّيَّتَهَا'], 
   'وتصفحوا': [
             'وَتَصْفَحُوا'], 
   'نسوة': [
          'نِسْوَةٌ'], 
   'إفك': [
         'إِفْكٌ'], 
   'اضطررتم': [
             'اضْطُرِرْتُمْ'], 
   'نذرتم': [
           'نَذَرْتُمْ'], 
   'مذكر': [
          'مُذَكِّرٌ'], 
   'فتنفعه': [
            'فَتَنْفَعَهُ'], 
   'نخفي': [
          'نُخْفِي'], 
   'ترقب': [
          'تَرْقُبْ'], 
   'رجا': [
         'رَجًّا'], 
   'مثلنا': [
           'مِثْلُنَا',
           'مِثْلِنَا',
           'مِثْلَنَا'], 
   'أجاجا': [
           'أُجَاجًا'], 
   'استحياء': [
             'اسْتِحْيَاءٍ'], 
   'المسيح': [
            'الْمَسِيحُ',
            'الْمَسِيحَ'], 
   'كيد': [
         'كَيْدُ',
         'كَيْدَ',
         'كَيْدِ',
         'كَيْدٌ'], 
   'تبديل': [
           'تَبْدِيلَ'], 
   'سيصيب': [
           'سَيُصِيبُ'], 
   'فأتبعوهم': [
              'فَأَتْبَعُوهُمْ'], 
   'شيطان': [
           'شَيْطَانٍ'], 
   'ينقض': [
          'يَنْقَضَّ'], 
   'بشيء': [
          'بِشَيْءٍ'], 
   'نجواكم': [
            'نَجْوَاكُمْ'], 
   'وجدت': [
          'وَجَدْتُ'], 
   'توكلنا': [
            'تَوَكَّلْنَا'], 
   'سألتموه': [
             'سَأَلْتُمُوهُ'], 
   'فأذنوا': [
            'فَأْذَنُوا'], 
   'بشير': [
          'بَشِيرٍ',
          'بَشِيرٌ'], 
   'آتنا': [
          'آتِنَا'], 
   'آنفا': [
          'آنِفًا'], 
   'المفترين': [
              'الْمُفْتَرِينَ'], 
   'كيف': [
         'كَيْفَ'], 
   'المسكنة': [
             'الْمَسْكَنَةُ'], 
   'كيل': [
         'كَيْلَ',
         'كَيْلٌ'], 
   'فصكت': [
          'فَصَكَّتْ'], 
   'الساخرين': [
              'السَّاخِرِينَ'], 
   'أسرف': [
          'أَسْرَفَ'], 
   'بعذاب': [
           'بِعَذَابٍ',
           'بِعَذَابِ'], 
   'ويأمركم': [
             'وَيَأْمُرُكُمْ'], 
   'عاملة': [
           'عَامِلَةٌ'], 
   'تبرجن': [
           'تَبَرَّجْنَ'], 
   'فليتنافس': [
              'فَلْيَتَنَافَسِ'], 
   'مصدقا': [
           'مُصَدِّقًا'], 
   'تبخلوا': [
            'تَبْخَلُوا'], 
   'فاجعل': [
           'فَاجْعَلْ'], 
   'واخشوني': [
             'وَاخْشَوْنِي'], 
   'يقص': [
         'يَقُصُّ'], 
   'الحبك': [
           'الْحُبُكِ'], 
   'وكلمهم': [
            'وَكَلَّمَهُمُ'], 
   'لؤلؤ': [
          'لُؤْلُؤٌ'], 
   'يبيتون': [
            'يُبَيِّتُونَ',
            'يَبِيتُونَ'], 
   'اخترتك': [
            'اخْتَرْتُكَ'], 
   'مؤمنين': [
            'مُؤْمِنِينَ',
            'مُؤْمِنَيْنِ'], 
   'أبسلوا': [
            'أُبْسِلُوا'], 
   'لمثله': [
           'لِمِثْلِهِ'], 
   'صبا': [
         'صَبًّا'], 
   'طريقا': [
           'طَرِيقًا'], 
   'تأويل': [
           'تَأْوِيلِ',
           'تَأْوِيلُ'], 
   'مرسلين': [
            'مُرْسِلِينَ'], 
   'يشركون': [
            'يُشْرِكُونَ'], 
   'وموسى': [
           'وَمُوسَى'], 
   'تضرونه': [
            'تَضُرُّونَهُ'], 
   'مناع': [
          'مَنَّاعٍ'], 
   'وعبد': [
          'وَعَبَدَ'], 
   'شرعة': [
          'شِرْعَةً'], 
   'وزر': [
         'وِزْرَ',
         'وَزَرَ'], 
   'مبدل': [
          'مُبَدِّلَ'], 
   'فاحتمل': [
            'فَاحْتَمَلَ'], 
   'ظعنكم': [
           'ظَعْنِكُمْ'], 
   'صبر': [
         'صَبَرَ'], 
   'قضي': [
         'قُضِيَ'], 
   'قضى': [
         'قَضَى'], 
   'فطل': [
         'فَطَلٌّ'], 
   'تسمعوا': [
            'تَسْمَعُوا'], 
   'الذكرى': [
            'الذِّكْرَى'], 
   'فأحيا': [
           'فَأَحْيَا'], 
   'وليوفوا': [
             'وَلْيُوفُوا'], 
   'والمكذبين': [
               'وَالْمُكَذِّبِينَ'], 
   'ملكين': [
           'مَلَكَيْنِ'], 
   'يشوي': [
          'يَشْوِي'], 
   'أمرت': [
          'أُمِرْتُ',
          'أُمِرْتَ'], 
   'تخف': [
         'تَخَفْ'], 
   'غفور': [
          'غَفُورٌ',
          'غَفُورٍ'], 
   'الكافر': [
            'الْكَافِرُ'], 
   'أمرا': [
          'أَمْرًا'], 
   'ذهاب': [
          'ذَهَابٍ'], 
   'ويسعون': [
            'وَيَسْعَوْنَ'], 
   'أهمتهم': [
            'أَهَمَّتْهُمْ'], 
   'فأعرضوا': [
             'فَأَعْرِضُوا',
             'فَأَعْرَضُوا'], 
   'أي': [
        'أَيُّ',
        'أَيِّ',
        'أَيَّ'], 
   'المفسد': [
            'الْمُفْسِدَ'], 
   'أطعتم': [
           'أَطَعْتُمْ'], 
   'عددا': [
          'عَدَدًا'], 
   'لموفوهم': [
             'لَمُوَفُّوهُمْ'], 
   'فجوة': [
          'فَجْوَةٍ'], 
   'كالأعلام': [
              'كَالْأَعْلَامِ'], 
   'كيدا': [
          'كَيْدًا'], 
   'أشق': [
         'أَشُقَّ',
         'أَشَقُّ'], 
   'فادرءوا': [
             'فَادْرَءُوا'], 
   'أزواجنا': [
             'أَزْوَاجِنَا'], 
   'جعلته': [
           'جَعَلَتْهُ'], 
   'أمره': [
          'أَمْرِهِ',
          'أَمْرُهُ',
          'أَمَرَهُ'], 
   'لربه': [
          'لِرَبِّهِ'], 
   'تركنوا': [
            'تَرْكَنُوا'], 
   'ذنوبكم': [
            'ذُنُوبِكُمْ',
            'ذُنُوبَكُمْ'], 
   'تثريب': [
           'تَثْرِيبَ'], 
   'قديم': [
          'قَدِيمٌ'], 
   'فعدتهن': [
            'فَعِدَّتُهُنَّ'], 
   'طاغون': [
           'طَاغُونَ'], 
   'والنخل': [
            'وَالنَّخْلَ',
            'وَالنَّخْلُ'], 
   'بطارد': [
           'بِطَارِدِ'], 
   'عطفه': [
          'عِطْفِهِ'], 
   'وثبت': [
          'وَثَبِّتْ'], 
   'الألباب': [
             'الْأَلْبَابِ'], 
   'تسمعون': [
            'تَسْمَعُونَ'], 
   'متاعا': [
           'مَتَاعًا'], 
   'حسان': [
          'حِسَانٍ',
          'حِسَانٌ'], 
   'حلالا': [
           'حَلَالًا'], 
   'بسلطان': [
            'بِسُلْطَانٍ'], 
   'فطلقوهن': [
             'فَطَلِّقُوهُنَّ'], 
   'ومواليكم': [
              'وَمَوَالِيكُمْ'], 
   'مستهزئون': [
              'مُسْتَهْزِئُونَ'], 
   'وعلمه': [
           'وَعَلَّمَهُ'], 
   'الأخيار': [
             'الْأَخْيَارِ'], 
   'وعلمك': [
           'وَعَلَّمَكَ'], 
   'ترفعوا': [
            'تَرْفَعُوا'], 
   'سلكناه': [
            'سَلَكْنَاهُ'], 
   'الحكيم': [
            'الْحَكِيمُ',
            'الْحَكِيمِ'], 
   'يمنون': [
           'يَمُنُّونَ'], 
   'قبلها': [
           'قَبْلِهَا'], 
   'اطرحوه': [
            'اطْرَحُوهُ'], 
   'أرذل': [
          'أَرْذَلِ'], 
   'وحففناهما': [
               'وَحَفَفْنَاهُمَا'], 
   'وأظهره': [
            'وَأَظْهَرَهُ'], 
   'لكيلا': [
           'لِكَيْلَا'], 
   'كنفس': [
          'كَنَفْسٍ'], 
   'يعيده': [
           'يُعِيدُهُ'], 
   'وامتازوا': [
              'وَامْتَازُوا'], 
   'بالعمرة': [
             'بِالْعُمْرَةِ'], 
   'سألك': [
          'سَأَلَكَ'], 
   'يسأله': [
           'يَسْأَلُهُ'], 
   'ويجزي': [
           'وَيَجْزِيَ'], 
   'يريد': [
          'يُرِيدُ'], 
   'ساقطا': [
           'سَاقِطًا'], 
   'بشركائهم': [
              'بِشُرَكَائِهِمْ'], 
   'عملوا': [
           'عَمِلُوا'], 
   'أشهر': [
          'أَشْهُرٍ',
          'أَشْهُرٌ'], 
   'قبلهم': [
           'قَبْلِهِمْ',
           'قَبْلَهُمْ',
           'قَبْلِهِمُ'], 
   'ضيقا': [
          'ضَيِّقًا'], 
   'أخلصناهم': [
              'أَخْلَصْنَاهُمْ'], 
   'ولما': [
          'وَلَمَّا',
          'وَلِمَا'], 
   'ليوحون': [
            'لَيُوحُونَ'], 
   'التكاثر': [
             'التَّكَاثُرُ'], 
   'وعند': [
          'وَعِنْدَ'], 
   'والحمير': [
             'وَالْحَمِيرَ'], 
   'كفورا': [
           'كَفُورًا',
           'كُفُورًا'], 
   'تبكون': [
           'تَبْكُونَ'], 
   'تبغي': [
          'تَبْغِي'], 
   'الحكام': [
            'الْحُكَّامِ'], 
   'سلاسل': [
           'سَلَاسِلَ'], 
   'جدارا': [
           'جِدَارًا'], 
   'بدلنا': [
           'بَدَّلْنَا'], 
   'ومضى': [
          'وَمَضَى'], 
   'فآمن': [
          'فَآمَنَ'], 
   'وعلما': [
           'وَعِلْمًا'], 
   'يوعدون': [
            'يُوعَدُونَ'], 
   'ميقاتهم': [
             'مِيقَاتُهُمْ'], 
   'ينهاكم': [
            'يَنْهَاكُمُ'], 
   'يتوفون': [
            'يُتَوَفَّوْنَ'], 
   'ليفتدوا': [
             'لِيَفْتَدُوا'], 
   'ألسنتكم': [
             'أَلْسِنَتِكُمْ',
             'أَلْسِنَتُكُمُ'], 
   'ولعلا': [
           'وَلَعَلَا'], 
   'تمشون': [
           'تَمْشُونَ'], 
   'يقضون': [
           'يَقْضُونَ'], 
   'الحياة': [
            'الْحَيَاةِ',
            'الْحَيَاةُ',
            'الْحَيَاةَ'], 
   'وراءهم': [
            'وَرَاءَهُمْ'], 
   'مدادا': [
           'مِدَادًا'], 
   'عزم': [
         'عَزْمِ',
         'عَزَمَ'], 
   'مكانا': [
           'مَكَانًا'], 
   'بأنكم': [
           'بِأَنَّكُمُ'], 
   'يحق': [
         'يُحِقَّ'], 
   'ماكثون': [
            'مَاكِثُونَ'], 
   'سبقوا': [
           'سَبَقُوا'], 
   'ظلمونا': [
            'ظَلَمُونَا'], 
   'بجذع': [
          'بِجِذْعِ'], 
   'وكذبوا': [
            'وَكَذَّبُوا'], 
   'وأدخلهم': [
             'وَأَدْخِلْهُمْ'], 
   'غسلين': [
           'غِسْلِينٍ'], 
   'بالذكر': [
            'بِالذِّكْرِ'], 
   'يجزاه': [
           'يُجْزَاهُ'], 
   'تشابهت': [
            'تَشَابَهَتْ'], 
   'كذبت': [
          'كَذَّبَتْ',
          'كُذِّبَتْ'], 
   'واتبعتهم': [
              'وَاتَّبَعَتْهُمْ'], 
   'كذبا': [
          'كَذِبًا'], 
   'تقيكم': [
           'تَقِيكُمْ',
           'تَقِيكُمُ'], 
   'رفعه': [
          'رَفَعَهُ'], 
   'تربصون': [
            'تَرَبَّصُونَ'], 
   'انفصام': [
            'انْفِصَامَ'], 
   'ويبصرون': [
             'وَيُبْصِرُونَ'], 
   'فأفوز': [
           'فَأَفُوزَ'], 
   'غرفا': [
          'غُرَفًا'], 
   'والزاني': [
             'وَالزَّانِي'], 
   'غرفة': [
          'غُرْفَةً'], 
   'ضنكا': [
          'ضَنْكًا'], 
   'حاضرة': [
           'حَاضِرَةَ',
           'حَاضِرَةً'], 
   'للجبين': [
            'لِلْجَبِينِ'], 
   'جبل': [
         'جَبَلٍ'], 
   'يتعد': [
          'يَتَعَدَّ'], 
   'اللاعنون': [
              'اللَّاعِنُونَ'], 
   'وسار': [
          'وَسَارَ'], 
   'لنفتنهم': [
             'لِنَفْتِنَهُمْ'], 
   'استكبر': [
            'اسْتَكْبَرَ'], 
   'كذبه': [
          'كَذِبُهُ'], 
   'وسخرنا': [
            'وَسَخَّرْنَا'], 
   'الأنهار': [
             'الْأَنْهَارُ',
             'الْأَنْهَارَ'], 
   'ونصحت': [
           'وَنَصَحْتُ'], 
   'لنحرقنه': [
             'لَنُحَرِّقَنَّهُ'], 
   'تربصوا': [
            'تَرَبَّصُوا'], 
   'وساء': [
          'وَسَاءَ'], 
   'سنقتل': [
           'سَنُقَتِّلُ'], 
   'المستهزئين': [
                'الْمُسْتَهْزِئِينَ'], 
   'سبقكم': [
           'سَبَقَكُمْ'], 
   'بأفواههم': [
              'بِأَفْوَاهِهِمْ'], 
   'ونحن': [
          'وَنَحْنُ'], 
   'ببدر': [
          'بِبَدْرٍ'], 
   'أبلغ': [
          'أَبْلُغُ',
          'أَبْلُغَ'], 
   'علوا': [
          'عُلُوًّا',
          'عَلَوْا'], 
   'معاذيره': [
             'مَعَاذِيرَهُ'], 
   'تتركه': [
           'تَتْرُكْهُ'], 
   'مكانه': [
           'مَكَانَهُ'], 
   'ترمي': [
          'تَرْمِي'], 
   'ردها': [
          'رَدَّهَا'], 
   'مال': [
         'مَالِ',
         'مَالَ',
         'مَالٍ',
         'مَالٌ'], 
   'فتعسا': [
           'فَتَعْسًا'], 
   'يبايعون': [
             'يُبَايِعُونَ'], 
   'وغفر': [
          'وَغَفَرَ'], 
   'عدوان': [
           'عُدْوَانَ'], 
   'عذرا': [
          'عُذْرًا'], 
   'تدور': [
          'تَدُورُ'], 
   'المحراب': [
             'الْمِحْرَابِ',
             'الْمِحْرَابَ'], 
   'فجاسوا': [
            'فَجَاسُوا'], 
   'المنصورون': [
               'الْمَنْصُورُونَ'], 
   'ومأواه': [
            'وَمَأْوَاهُ'], 
   'نكاحا': [
           'نِكَاحًا'], 
   'ويلنا': [
           'وَيْلَنَا'], 
   'وحملناهم': [
              'وَحَمَلْنَاهُمْ'], 
   'استجارك': [
             'اسْتَجَارَكَ'], 
   'يزفون': [
           'يَزِفُّونَ'], 
   'وكرها': [
           'وَكَرْهًا'], 
   'ليؤمنن': [
            'لَيُؤْمِنُنَّ',
            'لَيُؤْمِنَنَّ'], 
   'بال': [
         'بَالُ'], 
   'وبرزت': [
           'وَبُرِّزَتِ'], 
   'ضعفوا': [
           'ضَعُفُوا'], 
   'ورماحكم': [
             'وَرِمَاحُكُمْ'], 
   'مرقوم': [
           'مَرْقُومٌ'], 
   'ليلا': [
          'لَيْلًا'], 
   'مد': [
        'مَدَّ'], 
   'مرحا': [
          'مَرَحًا'], 
   'مت': [
        'مِتُّ',
        'مِتَّ'], 
   'ما': [
        'مَا'], 
   'ينفعكم': [
            'يَنْفَعُكُمْ',
            'يَنْفَعَكُمُ'], 
   'قاعا': [
          'قَاعًا'], 
   'يدخلنها': [
             'يَدْخُلَنَّهَا'], 
   'ليلة': [
          'لَيْلَةً',
          'لَيْلَةُ',
          'لَيْلَةِ',
          'لَيْلَةَ',
          'لَيْلَةٍ'], 
   'قبضة': [
          'قَبْضَةً'], 
   'مع': [
        'مَعَ'], 
   'تشربون': [
            'تَشْرَبُونَ'], 
   'وضعها': [
           'وَضَعَهَا'], 
   'والشهر': [
            'وَالشَّهْرَ'], 
   'مر': [
        'مَرَّ'], 
   'مس': [
        'مَسَّ'], 
   'فزيلنا': [
            'فَزَيَّلْنَا'], 
   'واقعدوا': [
             'وَاقْعُدُوا'], 
   'بالبيت': [
            'بِالْبَيْتِ'], 
   'وأثقالا': [
             'وَأَثْقَالًا'], 
   'مم': [
        'مِمَّ'], 
   'لتفتروا': [
             'لِتَفْتَرُوا'], 
   'فاشهدوا': [
             'فَاشْهَدُوا'], 
   'من': [
        'مِنْ',
        'مِنَ',
        'مَنْ',
        'مَنِ',
        'مَنَّ'], 
   'تمترون': [
            'تَمْتَرُونَ'], 
   'يحسب': [
          'يَحْسَبُ'], 
   'الهدهد': [
            'الْهُدْهُدَ'], 
   'الأذقان': [
             'الْأَذْقَانِ'], 
   'آتاك': [
          'آتَاكَ'], 
   'الملائكة': [
              'الْمَلَائِكَةُ',
              'الْمَلَائِكَةَ',
              'الْمَلَائِكَةِ'], 
   'وذوقوا': [
            'وَذُوقُوا'], 
   'لسعيها': [
            'لِسَعْيِهَا'], 
   'بأيام': [
           'بِأَيَّامِ'], 
   'أعبد': [
          'أَعْبُدُ',
          'أَعْبُدَ'], 
   'باغ': [
         'بَاغٍ'], 
   'الأجل': [
           'الْأَجَلَ'], 
   'أصابته': [
            'أَصَابَتْهُ'], 
   'ويدرءون': [
             'وَيَدْرَءُونَ'], 
   'سيئة': [
          'سَيِّئَةٌ',
          'سَيِّئَةٍ',
          'سَيِّئَةً'], 
   'والجوع': [
            'وَالْجُوعِ'], 
   'سيئت': [
          'سِيئَتْ'], 
   'ومثل': [
          'وَمَثَلُ'], 
   'يغفرون': [
            'يَغْفِرُونَ'], 
   'باب': [
         'بَابٍ',
         'بَابٌ'], 
   'فبعزتك': [
            'فَبِعِزَّتِكَ'], 
   'أهلكت': [
           'أَهْلَكْتُ'], 
   'فنجيناك': [
             'فَنَجَّيْنَاكَ'], 
   'تأكل': [
          'تَأْكُلُ',
          'تَأْكُلْ'], 
   'نتبع': [
          'نَتَّبِعُ',
          'نَتَّبِعِ'], 
   'فنجيناه': [
             'فَنَجَّيْنَاهُ'], 
   'باء': [
         'بَاءَ'], 
   'طوافون': [
            'طَوَّافُونَ'], 
   'للملائكة': [
              'لِلْمَلَائِكَةِ'], 
   'قدمتموه': [
             'قَدَّمْتُمُوهُ'], 
   'حمالة': [
           'حَمَّالَةَ'], 
   'وأقمن': [
           'وَأَقِمْنَ'], 
   'موثقهم': [
            'مَوْثِقَهُمْ'], 
   'الشياطين': [
              'الشَّيَاطِينَ',
              'الشَّيَاطِينِ',
              'الشَّيَاطِينُ'], 
   'الشعر': [
           'الشِّعْرَ'], 
   'يفتدي': [
           'يَفْتَدِي'], 
   'يأتين': [
           'يَأْتِينَ'], 
   'يأتيه': [
           'يَأْتِيهِ'], 
   'وطرا': [
          'وَطَرًا'], 
   'صاحبة': [
           'صَاحِبَةٌ',
           'صَاحِبَةً'], 
   'آتيناكم': [
             'آتَيْنَاكُمْ'], 
   'آبائك': [
           'آبَائِكَ'], 
   'ويتناجون': [
              'وَيَتَنَاجَوْنَ'], 
   'ونعمة': [
           'وَنِعْمَةً',
           'وَنَعْمَةٍ'], 
   'لفتحنا': [
            'لَفَتَحْنَا'], 
   'ورتلناه': [
             'وَرَتَّلْنَاهُ'], 
   'تجوع': [
          'تَجُوعَ'], 
   'بالسيئة': [
             'بِالسَّيِّئَةِ'], 
   'فررتم': [
           'فَرَرْتُمْ'], 
   'أخرتني': [
            'أَخَّرْتَنِي'], 
   'يدخلون': [
            'يَدْخُلُونَ'], 
   'ملوكا': [
           'مُلُوكًا'], 
   'كالطود': [
            'كَالطَّوْدِ'], 
   'شرابا': [
           'شَرَابًا'], 
   'أنباء': [
           'أَنْبَاءِ',
           'أَنْبَاءُ'], 
   'لترضوا': [
            'لِتَرْضَوْا'], 
   'استضعفوا': [
              'اسْتُضْعِفُوا'], 
   'طوبى': [
          'طُوبَى'], 
   'جئناكم': [
            'جِئْنَاكُمْ'], 
   'وأوفوا': [
            'وَأَوْفُوا'], 
   'دنا': [
         'دَنَا'], 
   'ونعمه': [
           'وَنَعَّمَهُ'], 
   'مهاجر': [
           'مُهَاجِرٌ'], 
   'آبائي': [
           'آبَائِي'], 
   'مسكين': [
           'مِسْكِينٍ',
           'مِسْكِينٌ'], 
   'البشير': [
            'الْبَشِيرُ'], 
   'افتح': [
          'افْتَحْ'], 
   'فضلتكم': [
            'فَضَّلْتُكُمْ'], 
   'فاتبعني': [
             'فَاتَّبِعْنِي'], 
   'ديارا': [
           'دَيَّارًا'], 
   'صدقوا': [
           'صَدَقُوا'], 
   'ضريع': [
          'ضَرِيعٍ'], 
   'شرابه': [
           'شَرَابُهُ'], 
   'فأصحاب': [
            'فَأَصْحَابُ'], 
   'فاستبشروا': [
               'فَاسْتَبْشِرُوا'], 
   'الأمين': [
            'الْأَمِينُ',
            'الْأَمِينِ'], 
   'فأقبلوا': [
             'فَأَقْبَلُوا'], 
   'تلقونه': [
            'تَلَقَّوْنَهُ'], 
   'أمها': [
          'أُمِّهَا'], 
   'ومثله': [
           'وَمِثْلَهُ'], 
   'تحيون': [
           'تَحْيَوْنَ'], 
   'تفقهون': [
            'تَفْقَهُونَ'], 
   'فاطهروا': [
             'فَاطَّهَّرُوا'], 
   'أفحكم': [
           'أَفَحُكْمَ'], 
   'فليصمه': [
            'فَلْيَصُمْهُ'], 
   'صاحبه': [
           'صَاحِبُهُ'], 
   'حوتهما': [
            'حُوتَهُمَا'], 
   'صاحبي': [
           'صَاحِبَيِ'], 
   'ففدية': [
           'فَفِدْيَةٌ'], 
   'الدرك': [
           'الدَّرْكِ'], 
   'للخبيثات': [
              'لِلْخَبِيثَاتِ'], 
   'والأزلام': [
              'وَالْأَزْلَامُ'], 
   'ويمشي': [
           'وَيَمْشِي'], 
   'وينصركم': [
             'وَيَنْصُرْكُمْ'], 
   'يدعنا': [
           'يَدْعُنَا'], 
   'بمسمع': [
           'بِمُسْمِعٍ'], 
   'نوف': [
         'نُوَفِّ'], 
   'تخوف': [
          'تَخَوُّفٍ'], 
   'والكفار': [
             'وَالْكُفَّارَ'], 
   'يبشرهم': [
            'يُبَشِّرُهُمْ'], 
   'يزكى': [
          'يَزَّكَّى'], 
   'يزكي': [
          'يُزَكِّي'], 
   'والمؤلفة': [
              'وَالْمُؤَلَّفَةِ'], 
   'سندس': [
          'سُنْدُسٍ'], 
   'أأنتم': [
           'أَأَنْتُمْ'], 
   'الحصيد': [
            'الْحَصِيدِ'], 
   'وآت': [
         'وَآتِ'], 
   'وسيحبط': [
            'وَسَيُحْبِطُ'], 
   'يؤتكم': [
           'يُؤْتِكُمْ',
           'يُؤْتِكُمُ'], 
   'وفار': [
          'وَفَارَ'], 
   'لفتيانه': [
             'لِفِتْيَانِهِ'], 
   'الثالثة': [
             'الثَّالِثَةَ'], 
   'نجوت': [
          'نَجَوْتَ'], 
   'لطيف': [
          'لَطِيفٌ'], 
   'واجفة': [
           'وَاجِفَةٌ'], 
   'مثله': [
          'مِثْلِهِ',
          'مِثْلُهُ',
          'مَثَلُهُ'], 
   'غافلين': [
            'غَافِلِينَ'], 
   'فقاتلوا': [
             'فَقَاتِلُوا'], 
   'شعوبا': [
           'شُعُوبًا'], 
   'وآتاه': [
           'وَآتَاهُ'], 
   'أحطنا': [
           'أَحَطْنَا'], 
   'فاتخذوه': [
             'فَاتَّخِذُوهُ'], 
   'فتمسكم': [
            'فَتَمَسَّكُمُ'], 
   'صبرنا': [
           'صَبَرْنَا'], 
   'تنزيل': [
           'تَنْزِيلُ',
           'تَنْزِيلٌ',
           'تَنْزِيلَ'], 
   'ابلعي': [
           'ابْلَعِي'], 
   'نسمع': [
          'نَسْمَعُ'], 
   'مضار': [
          'مُضَارٍّ'], 
   'ختم': [
         'خَتَمَ'], 
   'عصوا': [
          'عَصَوْا'], 
   'قبلتهم': [
            'قِبْلَتِهِمُ',
            'قِبْلَتَهُمْ'], 
   'جميل': [
          'جَمِيلٌ'], 
   'نكير': [
          'نَكِيرِ',
          'نَكِيرٍ'], 
   'صلواتهم': [
             'صَلَوَاتِهِمْ'], 
   'نوح': [
         'نُوحٍ',
         'نُوحٌ',
         'نُوحُ'], 
   'آذيتمونا': [
              'آذَيْتُمُونَا'], 
   'عين': [
         'عَيْنٍ',
         'عِينٍ',
         'عِينٌ',
         'عَيْنَ',
         'عَيْنٌ'], 
   'فأنا': [
          'فَأَنَا'], 
   'ونميت': [
           'وَنُمِيتُ'], 
   'لأنفسكم': [
             'لِأَنْفُسِكُمْ'], 
   'غيرها': [
           'غَيْرَهَا'], 
   'تقتيلا': [
            'تَقْتِيلًا'], 
   'لمسكم': [
           'لَمَسَّكُمْ'], 
   'أنتما': [
           'أَنْتُمَا'], 
   'سنبله': [
           'سُنْبُلِهِ'], 
   'أبصارهم': [
             'أَبْصَارُهُمْ',
             'أَبْصَارِهِمْ',
             'أَبْصَارَهُمْ'], 
   'وإياك': [
           'وَإِيَّاكَ'], 
   'وبدلناهم': [
              'وَبَدَّلْنَاهُمْ'], 
   'معذبهم': [
            'مُعَذِّبُهُمْ',
            'مُعَذِّبَهُمْ'], 
   'نور': [
         'نُورٍ',
         'نُورَ',
         'نُورٌ',
         'نُورُ'], 
   'فوكزه': [
           'فَوَكَزَهُ'], 
   'وإياي': [
           'وَإِيَّايَ'], 
   'أكلا': [
          'أَكْلًا'], 
   'قيلا': [
          'قِيلًا'], 
   'يغشى': [
          'يَغْشَى',
          'يُغْشَى'], 
   'يغشي': [
          'يُغْشِي'], 
   'بشهاب': [
           'بِشِهَابٍ'], 
   'ينكحها': [
            'يَنْكِحُهَا'], 
   'بكلمات': [
            'بِكَلِمَاتِ',
            'بِكَلِمَاتٍ'], 
   'النشور': [
            'النُّشُورُ'], 
   'وحيث': [
          'وَحَيْثُ'], 
   'ثاني': [
          'ثَانِيَ'], 
   'الأماني': [
             'الْأَمَانِيُّ'], 
   'وكرهوا': [
            'وَكَرِهُوا'], 
   'ضياء': [
          'ضِيَاءً'], 
   'راجعون': [
            'رَاجِعُونَ'], 
   'رأى': [
         'رَأَى'], 
   'فاءوا': [
           'فَاءُوا'], 
   'تصبك': [
          'تُصِبْكَ'], 
   'كرهتموهن': [
              'كَرِهْتُمُوهُنَّ'], 
   'مراء': [
          'مِرَاءً'], 
   'فيموتوا': [
             'فَيَمُوتُوا'], 
   'آذوا': [
          'آذَوْا'], 
   'تحس': [
         'تُحِسُّ'], 
   'وتخشى': [
           'وَتَخْشَى'], 
   'مرات': [
          'مَرَّاتٍ'], 
   'الوارثين': [
              'الْوَارِثِينَ'], 
   'مخزي': [
          'مُخْزِي'], 
   'روح': [
         'رَوْحِ',
         'رُوحُ'], 
   'خذولا': [
           'خَذُولًا'], 
   'بشهيد': [
           'بِشَهِيدٍ'], 
   'الخائضين': [
              'الْخَائِضِينَ'], 
   'مهجورا': [
            'مَهْجُورًا'], 
   'خلاق': [
          'خَلَاقٍ',
          'خَلَاقَ'], 
   'الحميد': [
            'الْحَمِيدُ',
            'الْحَمِيدِ'], 
   'مكذبين': [
            'مُكَذِّبِينَ'], 
   'راكعا': [
           'رَاكِعًا'], 
   'برق': [
         'بَرِقَ'], 
   'تفسقون': [
            'تَفْسُقُونَ'], 
   'فأسقيناكموه': [
                 'فَأَسْقَيْنَاكُمُوهُ'], 
   'سلطانيه': [
             'سُلْطَانِيَهْ'], 
   'تسألهم': [
            'تَسْأَلُهُمْ'], 
   'تزيدونني': [
              'تَزِيدُونَنِي'], 
   'القدر': [
           'الْقَدْرِ'], 
   'تحت': [
         'تَحْتَ',
         'تَحْتِ'], 
   'القدس': [
           'الْقُدُسِ'], 
   'وجنودا': [
            'وَجُنُودًا'], 
   'نتخذ': [
          'نَتَّخِذَ'], 
   'والأنعام': [
              'وَالْأَنْعَامِ',
              'وَالْأَنْعَامُ',
              'وَالْأَنْعَامَ'], 
   'فأثرن': [
           'فَأَثَرْنَ'], 
   'تصبر': [
          'تَصْبِرُ'], 
   'وخلقته': [
            'وَخَلَقْتَهُ'], 
   'خسروا': [
           'خَسِرُوا'], 
   'الغافلات': [
              'الْغَافِلَاتِ'], 
   'مولاهم': [
            'مَوْلَاهُمُ'], 
   'وصبغ': [
          'وَصِبْغٍ'], 
   'مروا': [
          'مَرُّوا'], 
   'إسرارهم': [
             'إِسْرَارَهُمْ'], 
   'مشهود': [
           'مَشْهُودٌ'], 
   'وحيه': [
          'وَحْيُهُ'], 
   'وحين': [
          'وَحِينَ'], 
   'سمين': [
          'سَمِينٍ'], 
   'وحيل': [
          'وَحِيلَ'], 
   'التوب': [
           'التَّوْبِ'], 
   'خفت': [
         'خَفَّتْ',
         'خِفْتِ',
         'خِفْتُ'], 
   'القانطين': [
              'الْقَانِطِينَ'], 
   'نساءكم': [
            'نِسَاءَكُمْ'], 
   'تعدوا': [
           'تَعُدُّوا',
           'تَعْدُوا'], 
   'يرهق': [
          'يَرْهَقُ'], 
   'ثلاثون': [
            'ثَلَاثُونَ'], 
   'قرآن': [
          'قُرْآنَ',
          'قُرْآنٍ',
          'قُرْآنٌ'], 
   'فقلنا': [
           'فَقُلْنَا'], 
   'أوتيت': [
           'أُوتِيتَ'], 
   'ودية': [
          'وَدِيَةٌ'], 
   'بقبس': [
          'بِقَبَسٍ'], 
   'أوت': [
         'أُوتَ'], 
   'للشوى': [
           'لِلشَّوَى'], 
   'لفرعون': [
            'لِفِرْعَوْنَ'], 
   'الغروب': [
            'الْغُرُوبِ'], 
   'أفتنا': [
           'أَفْتِنَا'], 
   'وربكم': [
           'وَرَبُّكُمْ',
           'وَرَبِّكُمْ',
           'وَرَبَّكُمْ'], 
   'انشقت': [
           'انْشَقَّتْ',
           'انْشَقَّتِ'], 
   'يغفر': [
          'يَغْفِرُ',
          'يَغْفِرَ',
          'يَغْفِرْ',
          'يُغْفَرْ'], 
   'الغرور': [
            'الْغَرُورُ',
            'الْغُرُورِ'], 
   'فاسجد': [
           'فَاسْجُدْ'], 
   'أخلفوا': [
            'أَخْلَفُوا'], 
   'طيباتكم': [
             'طَيِّبَاتِكُمْ'], 
   'فمهل': [
          'فَمَهِّلِ'], 
   'رهينة': [
           'رَهِينَةٌ'], 
   'تقلبون': [
            'تُقْلَبُونَ'], 
   'أبشر': [
          'أَبَشَرٌ'], 
   'يتحاجون': [
             'يَتَحَاجُّونَ'], 
   'أجعل': [
          'أَجْعَلْ',
          'أَجَعَلَ'], 
   'ودين': [
          'وَدِينِ'], 
   'والنخيل': [
             'وَالنَّخِيلَ'], 
   'الضالون': [
             'الضَّالُّونَ'], 
   'واركعوا': [
             'وَارْكَعُوا'], 
   'تكاد': [
          'تَكَادُ'], 
   'وآتينا': [
            'وَآتَيْنَا'], 
   'وحبل': [
          'وَحَبْلٍ'], 
   'يأمركم': [
            'يَأْمُرُكُمْ',
            'يَأْمُرَكُمْ'], 
   'متقلبكم': [
             'مُتَقَلَّبَكُمْ'], 
   'خفف': [
         'خَفَّفَ'], 
   'تقدير': [
           'تَقْدِيرُ'], 
   'خفي': [
         'خَفِيٍّ'], 
   'الجحيم': [
            'الْجَحِيمِ',
            'الْجَحِيمُ',
            'الْجَحِيمَ'], 
   'تعدون': [
           'تَعُدُّونَ'], 
   'ليريهما': [
             'لِيُرِيَهُمَا'], 
   'يخلفه': [
           'يُخْلِفُهُ'], 
   'ويعذب': [
           'وَيُعَذِّبُ',
           'وَيُعَذِّبَ'], 
   'وضعتها': [
            'وَضَعْتُهَا',
            'وَضَعَتْهَا'], 
   'تريحون': [
            'تُرِيحُونَ'], 
   'ترقى': [
          'تَرْقَى'], 
   'وقومك': [
           'وَقَوْمَكَ'], 
   'القهار': [
            'الْقَهَّارُ',
            'الْقَهَّارِ'], 
   'وقومه': [
           'وَقَوْمِهِ',
           'وَقَوْمُهُ',
           'وَقَوْمَهُ'], 
   'معدودة': [
            'مَعْدُودَةٍ',
            'مَعْدُودَةً'], 
   'وانتظر': [
            'وَانْتَظِرْ'], 
   'لتخرجنا': [
             'لِتُخْرِجَنَا'], 
   'ركبك': [
          'رَكَّبَكَ'], 
   'ومناة': [
           'وَمَنَاةَ'], 
   'لجميع': [
           'لَجَمِيعٌ'], 
   'سفيهنا': [
            'سَفِيهُنَا'], 
   'تسأموا': [
            'تَسْأَمُوا'], 
   'أثقالهم': [
             'أَثْقَالِهِمْ',
             'أَثْقَالَهُمْ'], 
   'وفريق': [
           'وَفَرِيقٌ'], 
   'ولكنكم': [
            'وَلَكِنَّكُمْ'], 
   'ويحرم': [
           'وَيُحَرِّمُ'], 
   'ليقتلوك': [
             'لِيَقْتُلُوكَ'], 
   'فبهداهم': [
             'فَبِهُدَاهُمُ'], 
   'رفعها': [
           'رَفَعَهَا'], 
   'رحماء': [
           'رُحَمَاءُ'], 
   'مرضا': [
          'مَرَضًا'], 
   'ليضل': [
          'لِيُضِلَّ'], 
   'وجاهدوا': [
             'وَجَاهَدُوا',
             'وَجَاهِدُوا'], 
   'ائتوا': [
           'ائْتُوا'], 
   'إعصار': [
           'إِعْصَارٌ'], 
   'المسرفين': [
              'الْمُسْرِفِينَ'], 
   'تصعدون': [
            'تُصْعِدُونَ'], 
   'بعبادة': [
            'بِعِبَادَةِ'], 
   'يكاد': [
          'يَكَادُ'], 
   'ذلك': [
         'ذَلِكَ'], 
   'مناكبها': [
             'مَنَاكِبِهَا'], 
   'أهلكني': [
            'أَهْلَكَنِيَ'], 
   'لننسفنه': [
             'لَنَنْسِفَنَّهُ'], 
   'والمقيمي': [
              'وَالْمُقِيمِي'], 
   'جاءوك': [
           'جَاءُوكَ'], 
   'أطعمه': [
           'أَطْعَمَهُ'], 
   'أفأمنتم': [
             'أَفَأَمِنْتُمْ'], 
   'يتمتعون': [
             'يَتَمَتَّعُونَ'], 
   'بعباده': [
            'بِعِبَادِهِ'], 
   'ببدنك': [
           'بِبَدَنِكَ'], 
   'بعبادي': [
            'بِعِبَادِي'], 
   'زبدا': [
          'زَبَدًا'], 
   'ألقاه': [
           'أَلْقَاهُ'], 
   'بشهاداتهم': [
               'بِشَهَادَاتِهِمْ'], 
   'وأصيلا': [
            'وَأَصِيلًا'], 
   'يخرجنكما': [
              'يُخْرِجَنَّكُمَا'], 
   'جاوزا': [
           'جَاوَزَا'], 
   'ولأمنينهم': [
               'وَلَأُمَنِّيَنَّهُمْ'], 
   'المثلى': [
            'الْمُثْلَى'], 
   'العالين': [
             'الْعَالِينَ'], 
   'عرشك': [
          'عَرْشُكِ'], 
   'أثقالها': [
             'أَثْقَالَهَا'], 
   'الأخت': [
           'الْأُخْتِ'], 
   'تحبط': [
          'تَحْبَطَ'], 
   'يطعمون': [
            'يُطْعِمُونِ'], 
   'دخله': [
          'دَخَلَهُ'], 
   'والحافظون': [
               'وَالْحَافِظُونَ'], 
   'وخلقهم': [
            'وَخَلَقَهُمْ'], 
   'فألقوه': [
            'فَأَلْقُوهُ'], 
   'نكروا': [
           'نَكِّرُوا'], 
   'واستوى': [
            'وَاسْتَوَى'], 
   'عرشه': [
          'عَرْشُهُ'], 
   'الفائزون': [
              'الْفَائِزُونَ'], 
   'نستعين': [
            'نَسْتَعِينُ'], 
   'أرسلتم': [
            'أُرْسِلْتُمْ'], 
   'صغير': [
          'صَغِيرٍ'], 
   'السوأى': [
            'السُّوأَى'], 
   'ومرعاها': [
             'وَمَرْعَاهَا'], 
   'أسفى': [
          'أَسَفَى'], 
   'حضر': [
         'حَضَرَ'], 
   'ميت': [
         'مَيِّتٍ',
         'مَيِّتٌ'], 
   'كخلقه': [
           'كَخَلْقِهِ'], 
   'ويعف': [
          'وَيَعْفُ'], 
   'يأكل': [
          'يَأْكُلُ',
          'يَأْكُلَ'], 
   'نار': [
         'نَارِ',
         'نَارٍ',
         'نَارُ',
         'نَارٌ',
         'نَارَ'], 
   'ناج': [
         'نَاجٍ'], 
   'انفطرت': [
            'انْفَطَرَتْ'], 
   'وذات': [
          'وَذَاتَ'], 
   'واصب': [
          'وَاصِبٌ'], 
   'فألقياه': [
             'فَأَلْقِيَاهُ'], 
   'حبالهم': [
            'حِبَالُهُمْ',
            'حِبَالَهُمْ'], 
   'وأموالا': [
             'وَأَمْوَالًا'], 
   'أباهم': [
           'أَبَاهُمْ'], 
   'وليبكوا': [
             'وَلْيَبْكُوا'], 
   'حريص': [
          'حَرِيصٌ'], 
   'حرير': [
          'حَرِيرٌ'], 
   'أسفا': [
          'أَسِفًا',
          'أَسَفًا'], 
   'وصى': [
         'وَصَّى'], 
   'فارقوهن': [
             'فَارِقُوهُنَّ'], 
   'فتكونا': [
            'فَتَكُونَا'], 
   'فإخوانكم': [
              'فَإِخْوَانُكُمْ'], 
   'ليسوءوا': [
             'لِيَسُوءُوا'], 
   'يكتمون': [
            'يَكْتُمُونَ'], 
   'فآتوا': [
           'فَآتُوا'], 
   'المبين': [
            'الْمُبِينُ',
            'الْمُبِينِ'], 
   'وسوف': [
          'وَسَوْفَ'], 
   'تحسبن': [
           'تَحْسَبَنَّ'], 
   'واستغفره': [
              'وَاسْتَغْفِرْهُ'], 
   'دخلا': [
          'دَخَلًا'], 
   'فألقوا': [
            'فَأَلْقَوْا',
            'فَأَلْقَوُا'], 
   'دخلت': [
          'دُخِلَتْ',
          'دَخَلْتَ',
          'دَخَلَتْ'], 
   'ونكفر': [
           'وَنَكْفُرُ'], 
   'جاءوا': [
           'جَاءُوا'], 
   'يفسقون': [
            'يَفْسُقُونَ'], 
   'تكتمونه': [
             'تَكْتُمُونَهُ'], 
   'بضاعة': [
           'بِضَاعَةً'], 
   'سعيكم': [
           'سَعْيُكُمْ',
           'سَعْيَكُمْ'], 
   'أخطأنا': [
            'أَخْطَأْنَا'], 
   'تخرصون': [
            'تَخْرُصُونَ'], 
   'يلمزك': [
           'يَلْمِزُكَ'], 
   'الأنثيين': [
              'الْأُنْثَيَيْنِ'], 
   'ومكروا': [
            'وَمَكَرُوا'], 
   'يضرعون': [
            'يَضَّرَّعُونَ'], 
   'يشفعون': [
            'يَشْفَعُونَ'], 
   'وضل': [
         'وَضَلَّ'], 
   'تشاء': [
          'تَشَاءُ'], 
   'والمؤمنات': [
               'وَالْمُؤْمِنَاتِ',
               'وَالْمُؤْمِنَاتُ'], 
   'لتركبوها': [
              'لِتَرْكَبُوهَا'], 
   'وأتبعوا': [
             'وَأُتْبِعُوا'], 
   'والمنافقات': [
                'وَالْمُنَافِقَاتِ',
                'وَالْمُنَافِقَاتُ'], 
   'ليصرمنها': [
              'لَيَصْرِمُنَّهَا'], 
   'يكنزون': [
            'يَكْنِزُونَ'], 
   'واعبدوا': [
             'وَاعْبُدُوا'], 
   'لحديث': [
           'لِحَدِيثٍ'], 
   'نتلوه': [
           'نَتْلُوهُ'], 
   'يفترون': [
            'يَفْتَرُونَ',
            'يَفْتُرُونَ'], 
   'يبدله': [
           'يُبْدِلَهُ'], 
   'ألقيا': [
           'أَلْقِيَا'], 
   'يتوارى': [
            'يَتَوَارَى'], 
   'أغنى': [
          'أَغْنَى'], 
   'مستطر': [
           'مُسْتَطَرٌ'], 
   'بعثرت': [
           'بُعْثِرَتْ'], 
   'وبطل': [
          'وَبَطَلَ'], 
   'غفلة': [
          'غَفْلَةٍ'], 
   'عيونا': [
           'عُيُونًا'], 
   'ويطيعون': [
             'وَيُطِيعُونَ'], 
   'ليحق': [
          'لِيُحِقَّ'], 
   'بالكفر': [
            'بِالْكُفْرِ'], 
   'أرحامكم': [
             'أَرْحَامُكُمْ',
             'أَرْحَامَكُمْ'], 
   'يكلؤكم': [
            'يَكْلَؤُكُمْ'], 
   'وفى': [
         'وَفَّى'], 
   'وفي': [
         'وَفِي'], 
   'واعبدوه': [
             'وَاعْبُدُوهُ'], 
   'تعرج': [
          'تَعْرُجُ'], 
   'يفجرونها': [
              'يُفَجِّرُونَهَا'], 
   'فدية': [
          'فِدْيَةٌ',
          'فَدِيَةٌ'], 
   'شكور': [
          'شَكُورٍ',
          'شَكُورٌ'], 
   'القرية': [
            'الْقَرْيَةِ',
            'الْقَرْيَةَ'], 
   'والشمائل': [
              'وَالشَّمَائِلِ'], 
   'تأخذونها': [
              'تَأْخُذُونَهَا'], 
   'ينصرونهم': [
              'يَنْصُرُونَهُمْ'], 
   'أغنت': [
          'أَغْنَتْ'], 
   'أهلكنا': [
            'أَهْلَكْنَا'], 
   'إيلافهم': [
             'إِيلَافِهِمْ'], 
   'تعرض': [
          'تُعْرِضْ'], 
   'زكاة': [
          'زَكَاةٍ',
          'زَكَاةً'], 
   'فاتخذت': [
            'فَاتَّخَذَتْ'], 
   'الظلة': [
           'الظُّلَّةِ'], 
   'القيمة': [
            'الْقَيِّمَةِ'], 
   'بمجنون': [
            'بِمَجْنُونٍ'], 
   'تنكحوهن': [
             'تَنْكِحُوهُنَّ'], 
   'تترى': [
          'تَتْرَى'], 
   'جعلناك': [
            'جَعَلْنَاكَ'], 
   'ذنوبهم': [
            'ذُنُوبِهِمْ',
            'ذُنُوبِهِمُ'], 
   'مستسلمون': [
              'مُسْتَسْلِمُونَ'], 
   'جعلناه': [
            'جَعَلْنَاهُ'], 
   'وضع': [
         'وُضِعَ'], 
   'استغفروا': [
              'اسْتَغْفِرُوا'], 
   'فليعلمن': [
             'فَلَيَعْلَمَنَّ'], 
   'تزكى': [
          'تَزَكَّى'], 
   'يقترفون': [
             'يَقْتَرِفُونَ'], 
   'لتعودن': [
            'لَتَعُودُنَّ'], 
   'بمعجزين': [
             'بِمُعْجِزِينَ'], 
   'كنزهما': [
            'كَنْزَهُمَا'], 
   'ضالين': [
           'ضَالِّينَ'], 
   'أيأمركم': [
             'أَيَأْمُرُكُمْ'], 
   'يقتلون': [
            'يَقْتُلُونِ',
            'يَقْتُلُونَ',
            'يُقَتِّلُونَ'], 
   'بحمده': [
           'بِحَمْدِهِ'], 
   'أعمالكم': [
             'أَعْمَالُكُمْ',
             'أَعْمَالَكُمْ',
             'أَعْمَالِكُمْ'], 
   'مجرمون': [
            'مُجْرِمُونَ'], 
   'تفلحون': [
            'تُفْلِحُونَ'], 
   'الزبانية': [
              'الزَّبَانِيَةَ'], 
   'أرضنا': [
           'أَرْضِنَا'], 
   'طعام': [
          'طَعَامِ',
          'طَعَامُ',
          'طَعَامٌ',
          'طَعَامٍ'], 
   'والغنم': [
            'وَالْغَنَمِ'], 
   'طبع': [
         'طَبَعَ'], 
   'فطوعت': [
           'فَطَوَّعَتْ'], 
   'وكفلها': [
            'وَكَفَّلَهَا'], 
   'أولما': [
           'أَوَلَمَّا'], 
   'المنير': [
            'الْمُنِيرِ'], 
   'حمولة': [
           'حَمُولَةً'], 
   'بغافل': [
           'بِغَافِلٍ'], 
   'أكبرنه': [
            'أَكْبَرْنَهُ'], 
   'أراكم': [
           'أَرَاكُمْ'], 
   'ناديتم': [
            'نَادَيْتُمْ'], 
   'أشكو': [
          'أَشْكُو'], 
   'الناقة': [
            'النَّاقَةَ',
            'النَّاقَةِ'], 
   'فأجمعوا': [
             'فَأَجْمِعُوا'], 
   'والمستضعفين': [
                 'وَالْمُسْتَضْعَفِينَ'], 
   'ادفعوا': [
            'ادْفَعُوا'], 
   'فانتهى': [
            'فَانْتَهَى'], 
   'فخانتاهما': [
               'فَخَانَتَاهُمَا'], 
   'فاكهون': [
            'فَاكِهُونَ'], 
   'وشرابك': [
            'وَشَرَابِكَ'], 
   'أشكر': [
          'أَشْكُرَ'], 
   'والموتى': [
             'وَالْمَوْتَى'], 
   'آبائهن': [
            'آبَائِهِنَّ'], 
   'آبائهم': [
            'آبَائِهِمْ'], 
   'لهمت': [
          'لَهَمَّتْ'], 
   'ينشرون': [
            'يُنْشِرُونَ'], 
   'يردوكم': [
            'يَرُدُّوكُمْ'], 
   'تقيا': [
          'تَقِيًّا'], 
   'أمسكهما': [
             'أَمْسَكَهُمَا'], 
   'أنفقت': [
           'أَنْفَقْتَ'], 
   'ليستخلفنهم': [
                'لَيَسْتَخْلِفَنَّهُمْ'], 
   'طبن': [
         'طِبْنَ'], 
   'طبق': [
         'طَبَقٍ'], 
   'عشرون': [
           'عِشْرُونَ'], 
   'وحال': [
          'وَحَالَ'], 
   'فنتبع': [
           'فَنَتَّبِعَ'], 
   'بالظالمين': [
               'بِالظَّالِمِينَ'], 
   'يعظكم': [
           'يَعِظُكُمْ',
           'يَعِظُكُمُ'], 
   'ضعفين': [
           'ضِعْفَيْنِ'], 
   'وحاق': [
          'وَحَاقَ'], 
   'تفلحوا': [
            'تُفْلِحُوا'], 
   'جاعل': [
          'جَاعِلِ',
          'جَاعِلٌ'], 
   'أعرض': [
          'أَعْرَضَ',
          'أَعْرِضْ'], 
   'لآتيناهم': [
              'لَآتَيْنَاهُمْ'], 
   'جحدوا': [
           'جَحَدُوا'], 
   'سيرت': [
          'سُيِّرَتْ'], 
   'بالساق': [
            'بِالسَّاقِ'], 
   'سيرا': [
          'سَيْرًا'], 
   'وعزرتموهم': [
               'وَعَزَّرْتُمُوهُمْ'], 
   'البلدة': [
            'الْبَلْدَةِ'], 
   'أسرع': [
          'أَسْرَعُ'], 
   'ويونس': [
           'وَيُونُسَ'], 
   'سألهم': [
           'سَأَلَهُمْ'], 
   'العابدين': [
              'الْعَابِدِينَ'], 
   'بيناه': [
           'بَيَّنَّاهُ'], 
   'انفروا': [
            'انْفِرُوا'], 
   'الأسواق': [
             'الْأَسْوَاقِ'], 
   'يجمعكم': [
            'يَجْمَعُكُمْ'], 
   'الماء': [
           'الْمَاءَ',
           'الْمَاءِ',
           'الْمَاءُ'], 
   'فأسر': [
          'فَأَسْرِ'], 
   'فقضاهن': [
            'فَقَضَاهُنَّ'], 
   'فامشوا': [
            'فَامْشُوا'], 
   'أولاء': [
           'أُولَاءِ'], 
   'تكلم': [
          'تُكَلِّمَ',
          'تُكَلِّمُ',
          'تَكَلَّمُ'], 
   'أولات': [
           'أُولَاتِ'], 
   'تكلف': [
          'تُكَلَّفُ'], 
   'بالبر': [
           'بِالْبِرِّ'], 
   'أسلمنا': [
            'أَسْلَمْنَا'], 
   'الزوجين': [
             'الزَّوْجَيْنِ'], 
   'نقدر': [
          'نَقْدِرَ'], 
   'اذهبوا': [
            'اذْهَبُوا'], 
   'وزوجناهم': [
              'وَزَوَّجْنَاهُمْ'], 
   'تركن': [
          'تَرْكَنُ',
          'تَرَكْنَ'], 
   'أموالكم': [
             'أَمْوَالُكُمْ',
             'أَمْوَالِكُمْ',
             'أَمْوَالَكُمْ',
             'أَمْوَالَكُمُ'], 
   'شيبا': [
          'شِيبًا',
          'شَيْبًا'], 
   'أشركوا': [
            'أَشْرَكُوا'], 
   'يحتسبون': [
             'يَحْتَسِبُونَ'], 
   'حاج': [
         'حَاجَّ'], 
   'ونقول': [
           'وَنَقُولُ'], 
   'مجيد': [
          'مَجِيدٌ'], 
   'يجمع': [
          'يَجْمَعُ'], 
   'مستقيم': [
            'مُسْتَقِيمٍ',
            'مُسْتَقِيمٌ'], 
   'فمالئون': [
             'فَمَالِئُونَ'], 
   'فردا': [
          'فَرْدًا'], 
   'ظهرها': [
           'ظَهْرِهَا'], 
   'يرشدون': [
            'يَرْشُدُونَ'], 
   'والهدي': [
            'وَالْهَدْيَ'], 
   'نرسل': [
          'نُرْسِلُ',
          'نُرْسِلَ'], 
   'نولي': [
          'نُوَلِّي'], 
   'فعليهن': [
            'فَعَلَيْهِنَّ'], 
   'فعليهم': [
            'فَعَلَيْهِمْ'], 
   'الأيمان': [
             'الْأَيْمَانَ'], 
   'وصاحبته': [
             'وَصَاحِبَتِهِ'], 
   'كطي': [
         'كَطَيِّ'], 
   'لفاعلون': [
             'لَفَاعِلُونَ'], 
   'ليكتمون': [
             'لَيَكْتُمُونَ'], 
   'فبلغن': [
           'فَبَلَغْنَ'], 
   'نوله': [
          'نُوَلِّهِ'], 
   'فأتوا': [
           'فَأْتُوا',
           'فَأَتَوْا'], 
   'فاستعذ': [
            'فَاسْتَعِذْ'], 
   'لأسمعهم': [
             'لَأَسْمَعَهُمْ'], 
   'تجهلون': [
            'تَجْهَلُونَ'], 
   'وصاكم': [
           'وَصَّاكُمْ',
           'وَصَّاكُمُ'], 
   'بينات': [
           'بَيِّنَاتٍ',
           'بَيِّنَاتٌ'], 
   'كأنه': [
          'كَأَنَّهُ'], 
   'المال': [
           'الْمَالَ',
           'الْمَالِ',
           'الْمَالُ'], 
   'كأنك': [
          'كَأَنَّكَ'], 
   'أسرى': [
          'أَسْرَى'], 
   'فباءوا': [
            'فَبَاءُوا'], 
   'زانية': [
           'زَانِيَةً'], 
   'إجرامي': [
            'إِجْرَامِي'], 
   'سريا': [
          'سَرِيًّا'], 
   'مفتريات': [
             'مُفْتَرَيَاتٍ'], 
   'يملك': [
          'يَمْلِكُ'], 
   'ويقذفون': [
             'وَيُقْذَفُونَ',
             'وَيَقْذِفُونَ'], 
   'وتقبل': [
           'وَتَقَبَّلْ'], 
   'جميلا': [
           'جَمِيلًا'], 
   'لرزقنا': [
            'لَرِزْقُنَا'], 
   'وتعاونوا': [
              'وَتَعَاوَنُوا'], 
   'دونكم': [
           'دُونِكُمْ'], 
   'عربيا': [
           'عَرَبِيًّا'], 
   'عارض': [
          'عَارِضٌ'], 
   'وشهيق': [
           'وَشَهِيقٌ'], 
   'لآتية': [
           'لَآتِيَةٌ'], 
   'وساءت': [
           'وَسَاءَتْ'], 
   'روضات': [
           'رَوْضَاتِ'], 
   'تجمعوا': [
            'تَجْمَعُوا'], 
   'بارد': [
          'بَارِدٍ',
          'بَارِدٌ'], 
   'وإلينا': [
            'وَإِلَيْنَا'], 
   'للطائفين': [
              'لِلطَّائِفِينَ'], 
   'الخلق': [
           'الْخَلْقَ',
           'الْخَلْقِ',
           'الْخَلْقُ'], 
   'قرونا': [
           'قُرُونًا'], 
   'لصادقون': [
             'لَصَادِقُونَ'], 
   'اعمل': [
          'اعْمَلْ'], 
   'برادي': [
           'بِرَادِّي'], 
   'غربت': [
          'غَرَبَتْ'], 
   'وتخلت': [
           'وَتَخَلَّتْ'], 
   'يمهدون': [
            'يَمْهَدُونَ'], 
   'شر': [
        'شَرٌّ',
        'شَرِّ',
        'شَرَّ',
        'شَرُّ'], 
   'شح': [
        'شُحَّ'], 
   'زلزلة': [
           'زَلْزَلَةَ'], 
   'زلزلت': [
           'زُلْزِلَتِ'], 
   'واتخذ': [
           'وَاتَّخَذَ'], 
   'جملة': [
          'جُمْلَةً'], 
   'أخرجتك': [
            'أَخْرَجَتْكَ'], 
   'لقمان': [
           'لُقْمَانُ',
           'لُقْمَانَ'], 
   'تنطقون': [
            'تَنْطِقُونَ'], 
   'أعصي': [
          'أَعْصِي'], 
   'وعماتكم': [
             'وَعَمَّاتُكُمْ'], 
   'لأغلبن': [
            'لَأَغْلِبَنَّ'], 
   'آتاه': [
          'آتَاهُ'], 
   'ليفجر': [
           'لِيَفْجُرَ'], 
   'ذات': [
         'ذَاتِ',
         'ذَاتَ',
         'ذَاتُ'], 
   'بسور': [
          'بِسُورٍ'], 
   'اتخذوني': [
             'اتَّخِذُونِي'], 
   'مات': [
         'مَاتَ'], 
   'منقلبون': [
             'مُنْقَلِبُونَ'], 
   'والجلود': [
             'وَالْجُلُودُ'], 
   'ماء': [
         'مَاءً',
         'مَاءٍ',
         'مَاءَ'], 
   'الحزبين': [
             'الْحِزْبَيْنِ'], 
   'شك': [
        'شَكٍّ',
        'شَكٌّ'], 
   'بسوء': [
          'بِسُوءٍ'], 
   'تطيرنا': [
            'تَطَيَّرْنَا'], 
   'وشهيد': [
           'وَشَهِيدٌ'], 
   'تركت': [
          'تَرَكْتُ'], 
   'قدير': [
          'قَدِيرٌ'], 
   'مبصرون': [
            'مُبْصِرُونَ'], 
   'كرتين': [
           'كَرَّتَيْنِ'], 
   'والبنون': [
             'وَالْبَنُونَ'], 
   'عشر': [
         'عَشَرَ',
         'عَشْرُ',
         'عَشْرٍ'], 
   'يمتعون': [
            'يُمَتَّعُونَ'], 
   'الخلد': [
           'الْخُلْدِ',
           'الْخُلْدَ'], 
   'مننا': [
          'مَنَنَّا'], 
   'ولايتهم': [
             'وَلَايَتِهِمْ'], 
   'يريكموهم': [
              'يُرِيكُمُوهُمْ'], 
   'إخوانكم': [
             'إِخْوَانِكُمْ'], 
   'الحزن': [
           'الْحُزْنِ',
           'الْحَزَنَ'], 
   'ذكرت': [
          'ذَكَرْتَ'], 
   'بصلاتك': [
            'بِصَلَاتِكَ'], 
   'يجهلون': [
            'يَجْهَلُونَ'], 
   'فكيدوني': [
             'فَكِيدُونِي'], 
   'زوجناكها': [
              'زَوَّجْنَاكَهَا'], 
   'يبحث': [
          'يَبْحَثُ'], 
   'يخرون': [
           'يَخِرُّونَ'], 
   'عدوكم': [
           'عَدُوِّكُمْ',
           'عَدُوَّكُمْ'], 
   'كأحد': [
          'كَأَحَدٍ'], 
   'وسنزيد': [
            'وَسَنَزِيدُ'], 
   'مالا': [
          'مَالًا'], 
   'اصبروا': [
            'اصْبِرُوا'], 
   'فآزره': [
           'فَآزَرَهُ'], 
   'ليتها': [
           'لَيْتَهَا'], 
   'سحرهم': [
           'سِحْرِهِمْ'], 
   'فزادوهم': [
             'فَزَادُوهُمْ'], 
   'وانظروا': [
             'وَانْظُرُوا'], 
   'والأرحام': [
              'وَالْأَرْحَامَ'], 
   'يعتزلوكم': [
              'يَعْتَزِلُوكُمْ'], 
   'ودوا': [
          'وَدُّوا'], 
   'فأينما': [
            'فَأَيْنَمَا'], 
   'آتيناهم': [
             'آتَيْنَاهُمْ',
             'آتَيْنَاهُمُ'], 
   'لبئس': [
          'لَبِئْسَ'], 
   'أسكنت': [
           'أَسْكَنْتُ'], 
   'فاعتلوه': [
             'فَاعْتِلُوهُ'], 
   'ودود': [
          'وَدُودٌ'], 
   'صبيا': [
          'صَبِيًّا'], 
   'لواذا': [
           'لِوَاذًا'], 
   'وتكتمون': [
             'وَتَكْتُمُونَ'], 
   'وعرضوا': [
            'وَعُرِضُوا'], 
   'شركاؤهم': [
             'شُرَكَاؤُهُمْ'], 
   'محمودا': [
            'مَحْمُودًا'], 
   'ودون': [
          'وَدُونَ'], 
   'المريض': [
            'الْمَرِيضِ'], 
   'آتيناها': [
             'آتَيْنَاهَا'], 
   'البيع': [
           'الْبَيْعَ',
           'الْبَيْعُ'], 
   'كاذبون': [
            'كَاذِبُونَ'], 
   'فرقة': [
          'فِرْقَةٍ'], 
   'وتكتموا': [
             'وَتَكْتُمُوا'], 
   'نبذه': [
          'نَبَذَهُ'], 
   'نسيناكم': [
             'نَسِينَاكُمْ'], 
   'يشاقق': [
           'يُشَاقِقِ'], 
   'زقوم': [
          'زَقُّومٍ'], 
   'البيت': [
           'الْبَيْتِ',
           'الْبَيْتَ'], 
   'فرقا': [
          'فَرْقًا'], 
   'يسيرا': [
           'يَسِيرًا'], 
   'أنبأك': [
           'أَنْبَأَكَ'], 
   'فينقلبوا': [
              'فَيَنْقَلِبُوا'], 
   'أساور': [
           'أَسَاوِرَ'], 
   'مالك': [
          'مَالِكِ',
          'مَالِكُ',
          'مَالِكَ'], 
   'الفريضة': [
             'الْفَرِيضَةِ'], 
   'ماله': [
          'مَالُهُ',
          'مَالَهُ'], 
   'اختلافا': [
             'اخْتِلَافًا'], 
   'فنبذوه': [
            'فَنَبَذُوهُ'], 
   'بظلام': [
           'بِظَلَّامٍ'], 
   'النسوة': [
            'النِّسْوَةِ'], 
   'وتظنون': [
            'وَتَظُنُّونَ'], 
   'تنفقوا': [
            'تُنْفِقُوا'], 
   'مكانكم': [
            'مَكَانَكُمْ'], 
   'وكره': [
          'وَكَرَّهَ'], 
   'ألتناهم': [
             'أَلَتْنَاهُمْ'], 
   'أخالفكم': [
             'أُخَالِفَكُمْ'], 
   'يرتابوا': [
             'يَرْتَابُوا'], 
   'يقين': [
          'يَقِينٍ'], 
   'سيبطله': [
            'سَيُبْطِلُهُ'], 
   'المسبحون': [
              'الْمُسَبِّحُونَ'], 
   'ترجعوهن': [
             'تَرْجِعُوهُنَّ'], 
   'فنخرج': [
           'فَنُخْرِجُ'], 
   'أحد': [
         'أَحَدٍ',
         'أَحَدٌ',
         'أَحَدَ'], 
   'أطهر': [
          'أَطْهَرُ'], 
   'أخفيتم': [
            'أَخْفَيْتُمْ'], 
   'وليسألن': [
             'وَلَيُسْأَلُنَّ'], 
   'تمسوها': [
            'تَمَسُّوهَا'], 
   'أحب': [
         'أَحَبُّ',
         'أُحِبُّ',
         'أَحَبَّ'], 
   'يرضوه': [
           'يُرْضُوهُ'], 
   'وشيبة': [
           'وَشَيْبَةً'], 
   'قلب': [
         'قَلْبِ',
         'قَلْبٌ'], 
   'قلت': [
         'قُلْتَ',
         'قُلْتُ'], 
   'مرصادا': [
            'مِرْصَادًا'], 
   'صنعا': [
          'صُنْعًا'], 
   'زدناهم': [
            'زِدْنَاهُمْ'], 
   'مقامهما': [
             'مَقَامَهُمَا'], 
   'صنعة': [
          'صَنْعَةَ'], 
   'أحس': [
         'أَحَسَّ'], 
   'فأكلا': [
           'فَأَكَلَا'], 
   'ليعذب': [
           'لِيُعَذِّبَ'], 
   'فسبح': [
          'فَسَبِّحْ'], 
   'فالنار': [
            'فَالنَّارُ'], 
   'أخباركم': [
             'أَخْبَارِكُمْ',
             'أَخْبَارَكُمْ'], 
   'قلن': [
         'قُلْنَ'], 
   'تراضيتم': [
             'تَرَاضَيْتُمْ'], 
   'تمسوهن': [
            'تَمَسُّوهُنَّ'], 
   'تجادلوا': [
             'تُجَادِلُوا'], 
   'قلى': [
         'قَلَى'], 
   'أحل': [
         'أُحِلَّ',
         'أَحَلَّ'], 
   'وخشي': [
          'وَخَشِيَ'], 
   'أحق': [
         'أَحَقُّ',
         'أَحَقَّ',
         'أَحَقٌّ'], 
   'علمتنا': [
            'عَلَّمْتَنَا'], 
   'راغبون': [
            'رَاغِبُونَ'], 
   'ليذر': [
          'لِيَذَرَ'], 
   'سيماهم': [
            'سِيمَاهُمْ'], 
   'اختصموا': [
             'اخْتَصَمُوا'], 
   'التنور': [
            'التَّنُّورُ'], 
   'والمجاهدون': [
                'وَالْمُجَاهِدُونَ'], 
   'الصاغرين': [
              'الصَّاغِرِينَ'], 
   'أحطت': [
          'أَحَطْتُ'], 
   'يستقدمون': [
              'يَسْتَقْدِمُونَ'], 
   'يصلح': [
          'يُصْلِحْ',
          'يُصْلِحُ'], 
   'بعهد': [
          'بِعَهْدِ'], 
   'تنفقون': [
            'تُنْفِقُونَ'], 
   'أيمان': [
           'أَيْمَانٌ',
           'أَيْمَانَ'], 
   'حسبنا': [
           'حَسْبُنَا'], 
   'سنفرغ': [
           'سَنَفْرُغُ'], 
   'فأجره': [
           'فَأَجْرُهُ',
           'فَأَجِرْهُ'], 
   'أحياها': [
            'أَحْيَاهَا'], 
   'لأنفسهم': [
             'لِأَنْفُسِهِمْ'], 
   'فأردت': [
           'فَأَرَدْتُ'], 
   'فوجدناها': [
              'فَوَجَدْنَاهَا'], 
   'فألقيه': [
            'فَأَلْقِيهِ'], 
   'الشهداء': [
             'الشُّهَدَاءِ',
             'الشُّهَدَاءُ'], 
   'الرحمة': [
            'الرَّحْمَةِ',
            'الرَّحْمَةَ',
            'الرَّحْمَةُ'], 
   'بجهازهم': [
             'بِجَهَازِهِمْ'], 
   'والحافظين': [
               'وَالْحَافِظِينَ'], 
   'أصبناهم': [
             'أَصَبْنَاهُمْ'], 
   'وصلنا': [
           'وَصَّلْنَا'], 
   'أبواه': [
           'أَبَوَاهُ'], 
   'وهداه': [
           'وَهَدَاهُ'], 
   'بخيلك': [
           'بِخَيْلِكَ'], 
   'وجوهكم': [
            'وُجُوهَكُمْ'], 
   'خلقنا': [
           'خَلَقْنَا'], 
   'اجتمعوا': [
             'اجْتَمَعُوا'], 
   'ليستفزونك': [
               'لَيَسْتَفِزُّونَكَ'], 
   'بأيدينا': [
             'بِأَيْدِينَا'], 
   'استغنى': [
            'اسْتَغْنَى'], 
   'ببعضها': [
            'بِبَعْضِهَا'], 
   'وأمرنا': [
            'وَأُمِرْنَا'], 
   'فرجعوا': [
            'فَرَجَعُوا'], 
   'حبب': [
         'حَبَّبَ'], 
   'حبة': [
         'حَبَّةٍ'], 
   'استطعما': [
             'اسْتَطْعَمَا'], 
   'حبا': [
         'حَبًّا',
         'حُبًّا'], 
   'فإليه': [
           'فَإِلَيْهِ'], 
   'مضاجعهم': [
             'مَضَاجِعِهِمْ'], 
   'يديه': [
          'يَدَيْهِ'], 
   'حفيظا': [
           'حَفِيظًا'], 
   'عقبى': [
          'عُقْبَى'], 
   'الأكمه': [
            'الْأَكْمَهَ'], 
   'حبط': [
         'حَبِطَ'], 
   'عقبه': [
          'عَقِبِهِ'], 
   'معمر': [
          'مُعَمَّرٍ'], 
   'ردءا': [
          'رِدْءًا'], 
   'آثارهما': [
             'آثَارِهِمَا'], 
   'الداع': [
           'الدَّاعِ'], 
   'ونخل': [
          'وَنَخْلٍ',
          'وَنَخْلٌ'], 
   'حبه': [
         'حُبِّهِ'], 
   'الميزان': [
             'الْمِيزَانَ',
             'الْمِيزَانِ'], 
   'وملكا': [
           'وَمُلْكًا'], 
   'الدار': [
           'الدَّارِ',
           'الدَّارَ',
           'الدَّارُ'], 
   'يعكفون': [
            'يَعْكُفُونَ'], 
   'زفير': [
          'زَفِيرٌ'], 
   'يقال': [
          'يُقَالُ'], 
   'وبنيه': [
           'وَبَنِيهِ'], 
   'وأيديكم': [
             'وَأَيْدِيَكُمْ',
             'وَأَيْدِيكُمْ'], 
   'وتخر': [
          'وَتَخِرُّ'], 
   'مرضات': [
           'مَرْضَاتِ',
           'مَرْضَاتَ'], 
   'بكافرين': [
             'بِكَافِرِينَ'], 
   'نفخة': [
          'نَفْخَةٌ'], 
   'آخر': [
         'آخَرَ'], 
   'تقربكم': [
            'تُقَرِّبُكُمْ'], 
   'الرحمن': [
            'الرَّحْمَنِ',
            'الرَّحْمَنُ',
            'الرَّحْمَنَ'], 
   'وليحملن': [
             'وَلَيَحْمِلُنَّ'], 
   'وأرسلناه': [
              'وَأَرْسَلْنَاهُ'], 
   'خلقني': [
           'خَلَقَنِي'], 
   'راعون': [
           'رَاعُونَ'], 
   'وأرسلناك': [
              'وَأَرْسَلْنَاكَ'], 
   'أنشأنا': [
            'أَنْشَأْنَا'], 
   'أبواب': [
           'أَبْوَابَ',
           'أَبْوَابٍ',
           'أَبْوَابُ'], 
   'وللمؤمنين': [
               'وَلِلْمُؤْمِنِينَ'], 
   'والهدى': [
            'وَالْهُدَى'], 
   'وآتاكم': [
            'وَآتَاكُمْ'], 
   'لديهم': [
           'لَدَيْهِمْ'], 
   'ماءك': [
          'مَاءَكِ'], 
   'وكلمة': [
           'وَكَلِمَةُ'], 
   'الأنباء': [
             'الْأَنْبَاءِ',
             'الْأَنْبَاءُ'], 
   'يصدقوا': [
            'يَصَّدَّقُوا'], 
   'النكاح': [
            'النِّكَاحِ',
            'النِّكَاحَ'], 
   'الخير': [
           'الْخَيْرِ',
           'الْخَيْرُ',
           'الْخَيْرَ'], 
   'يرفعه': [
           'يَرْفَعُهُ'], 
   'الحجرات': [
             'الْحُجُرَاتِ'], 
   'ويسألون': [
             'وَيُسْأَلُونَ'], 
   'زنجبيلا': [
             'زَنْجَبِيلًا'], 
   'خلفتموني': [
              'خَلَفْتُمُونِي'], 
   'صبحهم': [
           'صَبَّحَهُمْ'], 
   'الخيط': [
           'الْخَيْطِ',
           'الْخَيْطُ'], 
   'ترجون': [
           'تَرْجُونَ'], 
   'ناكسو': [
           'نَاكِسُو'], 
   'كافرون': [
            'كَافِرُونَ'], 
   'أسفارا': [
            'أَسْفَارًا'], 
   'بالصالحين': [
               'بِالصَّالِحِينَ'], 
   'توقنون': [
            'تُوقِنُونَ'], 
   'المسكين': [
             'الْمِسْكِينِ',
             'الْمِسْكِينَ'], 
   'لمساكين': [
             'لِمَسَاكِينَ'], 
   'أقسموا': [
            'أَقْسَمُوا'], 
   'بينه': [
          'بَيْنَهُ'], 
   'بينك': [
          'بَيْنَكَ'], 
   'وخاف': [
          'وَخَافَ'], 
   'بيني': [
          'بَيْنِي'], 
   'موسى': [
          'مُوسَى'], 
   'ليسأل': [
           'لِيَسْأَلَ'], 
   'أحياهم': [
            'أَحْيَاهُمْ'], 
   'مدرارا': [
            'مِدْرَارًا'], 
   'توسوس': [
           'تُوَسْوِسُ'], 
   'كالفخار': [
             'كَالْفَخَّارِ'], 
   'وكلما': [
           'وَكُلَّمَا'], 
   'خرجتم': [
           'خَرَجْتُمْ'], 
   'ليسكنوا': [
             'لِيَسْكُنُوا'], 
   'تنحتون': [
            'تَنْحِتُونَ'], 
   'ظهوره': [
           'ظُهُورِهِ'], 
   'بينا': [
          'بَيَّنَّا'], 
   'أحييناها': [
              'أَحْيَيْنَاهَا'], 
   'بينة': [
          'بَيِّنَةٍ',
          'بَيِّنَةٌ',
          'بَيِّنَةُ',
          'بَيِّنَةً'], 
   'والمرجان': [
              'وَالْمَرْجَانُ'], 
   'صلصال': [
           'صَلْصَالٍ'], 
   'خصمون': [
           'خَصِمُونَ'], 
   'وكشفت': [
           'وَكَشَفَتْ'], 
   'طهرا': [
          'طَهِّرَا'], 
   'كسالى': [
           'كُسَالَى'], 
   'الخاسرين': [
              'الْخَاسِرِينَ'], 
   'مطمئنين': [
             'مُطْمَئِنِّينَ'], 
   'دابة': [
          'دَابَّةٍ',
          'دَابَّةُ',
          'دَابَّةً'], 
   'يصدقون': [
            'يُصَدِّقُونَ'], 
   'عندكم': [
           'عِنْدَكُمْ'], 
   'الحجر': [
           'الْحَجَرَ',
           'الْحِجْرِ'], 
   'دابر': [
          'دَابِرَ',
          'دَابِرُ'], 
   'زوجين': [
           'زَوْجَيْنِ'], 
   'مستقر': [
           'مُسْتَقَرٌّ',
           'مُسْتَقِرٌّ'], 
   'نخرجكم': [
            'نُخْرِجُكُمْ'], 
   'فاستغاثه': [
              'فَاسْتَغَاثَهُ'], 
   'طريا': [
          'طَرِيًّا'], 
   'فأبوا': [
           'فَأَبَوْا'], 
   'ليكونا': [
            'لِيَكُونَا'], 
   'ويأخذ': [
           'وَيَأْخُذُ'], 
   'مجرمين': [
            'مُجْرِمِينَ'], 
   'يخرجكم': [
            'يُخْرِجَكُمْ',
            'يُخْرِجُكُمْ'], 
   'نكالا': [
           'نَكَالًا'], 
   'وأبونا': [
            'وَأَبُونَا'], 
   'نراك': [
          'نَرَاكَ'], 
   'سبقا': [
          'سَبْقًا'], 
   'تصدى': [
          'تَصَدَّى'], 
   'لتنوء': [
           'لَتَنُوءُ'], 
   'غضبوا': [
           'غَضِبُوا'], 
   'سبقت': [
          'سَبَقَتْ'], 
   'ظلال': [
          'ظِلَالٍ'], 
   'فاستقيما': [
              'فَاسْتَقِيمَا'], 
   'وويل': [
          'وَوَيْلٌ'], 
   'وسعها': [
           'وُسْعَهَا'], 
   'أوتادا': [
            'أَوْتَادًا'], 
   'بعثناهم': [
             'بَعَثْنَاهُمْ'], 
   'تقول': [
          'تَقُولَ',
          'تَقُولُ',
          'تَقَوَّلَ'], 
   'تقوم': [
          'تَقُومُ',
          'تَقُومَ'], 
   'ولهم': [
          'وَلَهُمْ',
          'وَلَهُمُ'], 
   'تقوى': [
          'تَقْوَى'], 
   'ولهن': [
          'وَلَهُنَّ'], 
   'أهؤلاء': [
            'أَهَؤُلَاءِ'], 
   'القتال': [
            'الْقِتَالُ',
            'الْقِتَالَ',
            'الْقِتَالِ'], 
   'وأعتدت': [
            'وَأَعْتَدَتْ'], 
   'محرومون': [
             'مَحْرُومُونَ'], 
   'المنون': [
            'الْمَنُونِ'], 
   'فاضرب': [
           'فَاضْرِبْ'], 
   'العلماء': [
             'الْعُلَمَاءُ'], 
   'وأبقى': [
           'وَأَبْقَى'], 
   'بألسنتهم': [
              'بِأَلْسِنَتِهِمْ'], 
   'ولها': [
          'وَلَهَا'], 
   'اليسر': [
           'الْيُسْرَ'], 
   'إبليس': [
           'إِبْلِيسَ',
           'إِبْلِيسُ'], 
   'ونسقيه': [
            'وَنُسْقِيَهُ'], 
   'مستقرها': [
             'مُسْتَقَرَّهَا'], 
   'ليكونن': [
            'لَيَكُونُنَّ'], 
   'زكاها': [
           'زَكَّاهَا'], 
   'أخفي': [
          'أُخْفِيَ'], 
   'ظليل': [
          'ظَلِيلٍ'], 
   'أذكركم': [
            'أَذْكُرْكُمْ'], 
   'بمكرهن': [
            'بِمَكْرِهِنَّ'], 
   'كشطت': [
          'كُشِطَتْ'], 
   'وقتلوا': [
            'وَقُتِّلُوا',
            'وَقُتِلُوا'], 
   'تبينت': [
           'تَبَيَّنَتِ'], 
   'صغيرة': [
           'صَغِيرَةً'], 
   'تعزموا': [
            'تَعْزِمُوا'], 
   'صغيرا': [
           'صَغِيرًا'], 
   'وطبع': [
          'وَطُبِعَ',
          'وَطَبَعَ'], 
   'فكذب': [
          'فَكَذَّبَ'], 
   'أشراطها': [
             'أَشْرَاطُهَا'], 
   'مأتيا': [
           'مَأْتِيًّا'], 
   'رزقا': [
          'رِزْقًا'], 
   'صببنا': [
           'صَبَبْنَا'], 
   'تحصنا': [
           'تَحَصُّنًا'], 
   'فراتا': [
           'فُرَاتًا'], 
   'العذاب': [
            'الْعَذَابِ',
            'الْعَذَابَ',
            'الْعَذَابُ'], 
   'ورثوا': [
           'وَرِثُوا'], 
   'يوعظ': [
          'يُوعَظُ'], 
   'فاتخذتموهم': [
                'فَاتَّخَذْتُمُوهُمْ'], 
   'بجنود': [
           'بِجُنُودٍ'], 
   'وأناسي': [
            'وَأَنَاسِيَّ'], 
   'زان': [
         'زَانٍ'], 
   'فبإذن': [
           'فَبِإِذْنِ'], 
   'عائدون': [
            'عَائِدُونَ'], 
   'استحوذ': [
            'اسْتَحْوَذَ'], 
   'فأتيا': [
           'فَأْتِيَا'], 
   'وعملوا': [
            'وَعَمِلُوا'], 
   'يتربصون': [
             'يَتَرَبَّصُونَ'], 
   'فجاء': [
          'فَجَاءَ'], 
   'إيابهم': [
            'إِيَابَهُمْ'], 
   'خفتكم': [
           'خِفْتُكُمْ'], 
   'مدخل': [
          'مُدْخَلَ'], 
   'يتكبرون': [
             'يَتَكَبَّرُونَ'], 
   'كلمح': [
          'كَلَمْحِ',
          'كَلَمْحٍ'], 
   'أفنجعل': [
            'أَفَنَجْعَلُ'], 
   'خطايانا': [
             'خَطَايَانَا'], 
   'كفرهم': [
           'كُفْرُهُمْ'], 
   'ويستغفرونه': [
                'وَيَسْتَغْفِرُونَهُ'], 
   'تخافوهم': [
             'تَخَافُوهُمْ'], 
   'مستخلفين': [
              'مُسْتَخْلَفِينَ'], 
   'نبدل': [
          'نُبَدِّلَ'], 
   'وأزواجكم': [
              'وَأَزْوَاجُكُمْ'], 
   'الغضب': [
           'الْغَضَبُ'], 
   'لذكورنا': [
             'لِذُكُورِنَا'], 
   'لعبرة': [
           'لَعِبْرَةً'], 
   'صياصيهم': [
             'صَيَاصِيهِمْ'], 
   'رحمنا': [
           'رَحِمَنَا'], 
   'وأيدهم': [
            'وَأَيَّدَهُمْ'], 
   'فيركمه': [
            'فَيَرْكُمَهُ'], 
   'برهانكم': [
             'بُرْهَانَكُمْ'], 
   'ويخوفونك': [
              'وَيُخَوِّفُونَكَ'], 
   'واكتب': [
           'وَاكْتُبْ'], 
   'أمعاءهم': [
             'أَمْعَاءَهُمْ'], 
   'تواعدتم': [
             'تَوَاعَدْتُمْ'], 
   'رزقه': [
          'رِزْقَهُ',
          'رِزْقِهِ',
          'رِزْقُهُ'], 
   'فأصابه': [
            'فَأَصَابَهُ'], 
   'وأثاروا': [
             'وَأَثَارُوا'], 
   'فصل': [
         'فَصْلٌ',
         'فَصَّلَ',
         'فَصَلِّ',
         'فَصَلَ'], 
   'وليتبروا': [
              'وَلِيُتَبِّرُوا'], 
   'تبطلوا': [
            'تُبْطِلُوا'], 
   'المطهرون': [
              'الْمُطَهَّرُونَ'], 
   'بالتي': [
           'بِالَّتِي'], 
   'ورعد': [
          'وَرَعْدٌ'], 
   'عاصف': [
          'عَاصِفٍ',
          'عَاصِفٌ'], 
   'كفيلا': [
           'كَفِيلًا'], 
   'شجرتها': [
            'شَجَرَتَهَا'], 
   'فآتوهم': [
            'فَآتُوهُمْ'], 
   'فآتوهن': [
            'فَآتُوهُنَّ'], 
   'وتوبوا': [
            'وَتُوبُوا'], 
   'العقبة': [
            'الْعَقَبَةُ',
            'الْعَقَبَةَ'], 
   'والترائب': [
              'وَالتَّرَائِبِ'], 
   'والمنافقين': [
                'وَالْمُنَافِقِينَ'], 
   'وسطا': [
          'وَسَطًا'], 
   'لأخته': [
           'لِأُخْتِهِ'], 
   'موتها': [
           'مَوْتِهَا'], 
   'أواه': [
          'أَوَّاهٌ'], 
   'يتوب': [
          'يَتُوبُ',
          'يَتُوبَ'], 
   'بنصر': [
          'بِنَصْرِ'], 
   'نؤتى': [
          'نُؤْتَى'], 
   'وراءكم': [
            'وَرَاءَكُمْ'], 
   'والضراء': [
             'وَالضَّرَّاءِ',
             'وَالضَّرَّاءُ'], 
   'نؤته': [
          'نُؤْتِهِ'], 
   'وأمهاتكم': [
              'وَأُمَّهَاتُكُمُ'], 
   'كانوا': [
           'كَانُوا'], 
   'وانتظروا': [
              'وَانْتَظِرُوا'], 
   'ليجزيك': [
            'لِيَجْزِيَكَ'], 
   'فبعدا': [
           'فَبُعْدًا'], 
   'فطاف': [
          'فَطَافَ'], 
   'فاستغفروه': [
               'فَاسْتَغْفِرُوهُ'], 
   'قطعن': [
          'قَطَّعْنَ'], 
   'منقلب': [
           'مُنْقَلَبٍ'], 
   'تحرير': [
           'تَحْرِيرُ'], 
   'يجره': [
          'يَجُرُّهُ'], 
   'وتزهق': [
           'وَتَزْهَقَ'], 
   'وأهليهم': [
             'وَأَهْلِيهِمْ'], 
   'ينجيكم': [
            'يُنَجِّيكُمْ'], 
   'تقاتلونهم': [
               'تُقَاتِلُونَهُمْ'], 
   'فاستغفروا': [
               'فَاسْتَغْفَرُوا'], 
   'فأعرض': [
           'فَأَعْرِضْ',
           'فَأَعْرَضَ'], 
   'أواب': [
          'أَوَّابٌ',
          'أَوَّابٍ'], 
   'وجنودهما': [
              'وَجُنُودَهُمَا'], 
   'يمسهم': [
           'يَمَسُّهُمْ',
           'يَمَسُّهُمُ'], 
   'يأتوننا': [
             'يَأْتُونَنَا'], 
   'عينيك': [
           'عَيْنَيْكَ'], 
   'وأيمانهم': [
              'وَأَيْمَانِهِمْ'], 
   'عينين': [
           'عَيْنَيْنِ'], 
   'فأمسكوهن': [
              'فَأَمْسِكُوهُنَّ'], 
   'الحسنات': [
             'الْحَسَنَاتِ'], 
   'مخمصة': [
           'مَخْمَصَةٍ',
           'مَخْمَصَةٌ'], 
   'بأفواهكم': [
              'بِأَفْوَاهِكُمْ'], 
   'يتول': [
          'يَتَوَلَّ'], 
   'وبذلك': [
           'وَبِذَلِكَ'], 
   'أضاعوا': [
            'أَضَاعُوا'], 
   'وسقياها': [
             'وَسُقْيَاهَا'], 
   'يكشف': [
          'يُكْشَفُ'], 
   'وتخونوا': [
             'وَتَخُونُوا'], 
   'وبرزوا': [
            'وَبَرَزُوا'], 
   'مريم': [
          'مَرْيَمَ',
          'مَرْيَمُ'], 
   'السمع': [
           'السَّمْعَ',
           'السَّمْعِ'], 
   'نفيرا': [
           'نَفِيرًا'], 
   'الوالدان': [
              'الْوَالِدَانِ'], 
   'ريب': [
         'رَيْبَ',
         'رَيْبٍ'], 
   'طاقة': [
          'طَاقَةَ'], 
   'وزينة': [
           'وَزِينَةٌ',
           'وَزِينَةً'], 
   'يصحبون': [
            'يُصْحَبُونَ'], 
   'ريح': [
         'رِيحٌ',
         'رِيحَ',
         'رِيحٍ'], 
   'ويتربص': [
            'وَيَتَرَبَّصُ'], 
   'الزنا': [
           'الزِّنَا'], 
   'فلنولينك': [
              'فَلَنُوَلِّيَنَّكَ'], 
   'فج': [
        'فَجٍّ'], 
   'أتتك': [
          'أَتَتْكَ'], 
   'يستنكحها': [
              'يَسْتَنْكِحَهَا'], 
   'بذنبهم': [
            'بِذَنْبِهِمْ'], 
   'ريع': [
         'رِيعٍ'], 
   'ولسوف': [
           'وَلَسَوْفَ'], 
   'انطلقتم': [
             'انْطَلَقْتُمْ'], 
   'أقلام': [
           'أَقْلَامٌ'], 
   'كأن': [
         'كَأَنْ',
         'كَأَنَّ'], 
   'يساقون': [
            'يُسَاقُونَ'], 
   'يضيفوهما': [
              'يُضَيِّفُوهُمَا'], 
   'فك': [
        'فَكُّ'], 
   'محفوظا': [
            'مَحْفُوظًا'], 
   'في': [
        'فِي'], 
   'أتريد': [
           'أَتُرِيدُ'], 
   'كأس': [
         'كَأْسٍ'], 
   'اضطر': [
          'اضْطُرَّ'], 
   'المكيدون': [
              'الْمَكِيدُونَ'], 
   'كغلي': [
          'كَغَلْيِ'], 
   'بالحسنات': [
              'بِالْحَسَنَاتِ'], 
   'والحكمة': [
             'وَالْحِكْمَةَ',
             'وَالْحِكْمَةِ'], 
   'بالإفك': [
            'بِالْإِفْكِ'], 
   'كنزتم': [
           'كَنَزْتُمْ'], 
   'ويكونون': [
             'وَيَكُونُونَ'], 
   'يجزون': [
           'يُجْزَوْنَ'], 
   'خلافك': [
           'خِلَافَكَ'], 
   'فلأقطعن': [
             'فَلَأُقَطِّعَنَّ'], 
   'بضنين': [
           'بِضَنِينٍ'], 
   'مريج': [
          'مَرِيجٍ'], 
   'بالعين': [
            'بِالْعَيْنِ'], 
   'وأقام': [
           'وَأَقَامَ'], 
   'صافات': [
           'صَافَّاتٍ'], 
   'مريب': [
          'مُرِيبٍ'], 
   'مرية': [
          'مِرْيَةٍ'], 
   'مسومة': [
           'مُسَوَّمَةً'], 
   'فأنساهم': [
             'فَأَنْسَاهُمْ'], 
   'شعب': [
         'شُعَبٍ'], 
   'أماني': [
           'أَمَانِيِّ',
           'أَمَانِيَّ'], 
   'ليعلم': [
           'لِيَعْلَمَ',
           'لِيُعْلَمَ',
           'لَيَعْلَمُ'], 
   'فعلت': [
          'فَعَلْتَ'], 
   'تتفرقوا': [
             'تَتَفَرَّقُوا'], 
   'فتول': [
          'فَتَوَلَّ'], 
   'فشلتم': [
           'فَشِلْتُمْ'], 
   'يؤاخذهم': [
             'يُؤَاخِذُهُمْ'], 
   'عقبا': [
          'عُقْبًا'], 
   'وبنين': [
           'وَبَنِينَ'], 
   'الكبرى': [
            'الْكُبْرَى'], 
   'نوحي': [
          'نُوحِي'], 
   'أوفوا': [
           'أَوْفُوا'], 
   'أمرها': [
           'أَمْرِهَا',
           'أَمْرَهَا'], 
   'أخوهم': [
           'أَخُوهُمْ'], 
   'فقالوا': [
            'فَقَالُوا'], 
   'والجبلة': [
             'وَالْجِبِلَّةَ'], 
   'وناديناه': [
              'وَنَادَيْنَاهُ'], 
   'إدريس': [
           'إِدْرِيسَ'], 
   'تتوبا': [
           'تَتُوبَا'], 
   'ونصروه': [
            'وَنَصَرُوهُ'], 
   'ألقي': [
          'أُلْقِيَ'], 
   'ألقى': [
          'أَلْقَى'], 
   'تتكبر': [
           'تَتَكَبَّرَ'], 
   'مغلوب': [
           'مَغْلُوبٌ'], 
   'أمرهم': [
           'أَمْرَهُمْ',
           'أَمْرِهِمْ',
           'أَمَرَهُمْ',
           'أَمْرُهُمْ'], 
   'فأكثرت': [
            'فَأَكْثَرْتَ'], 
   'نوحا': [
          'نُوحًا'], 
   'عشاء': [
          'عِشَاءً'], 
   'أنشره': [
           'أَنْشَرَهُ'], 
   'بكتاب': [
           'بِكِتَابٍ'], 
   'شافعين': [
            'شَافِعِينَ'], 
   'ساءت': [
          'سَاءَتْ'], 
   'الفتنة': [
            'الْفِتْنَةِ',
            'الْفِتْنَةَ'], 
   'أذاعوا': [
            'أَذَاعُوا'], 
   'نعجزه': [
           'نُعْجِزَهُ'], 
   'فعليكم': [
            'فَعَلَيْكُمُ'], 
   'غرف': [
         'غُرَفٌ'], 
   'يموج': [
          'يَمُوجُ'], 
   'يموت': [
          'يَمُوتُ'], 
   'قاتلوهم': [
             'قَاتِلُوهُمْ'], 
   'فعلي': [
          'فَعَلَيَّ'], 
   'فافسحوا': [
             'فَافْسَحُوا'], 
   'فأنفخ': [
           'فَأَنْفُخُ'], 
   'فعلى': [
          'فَعَلَى'], 
   'نضطرهم': [
            'نَضْطَرُّهُمْ'], 
   'المثل': [
           'الْمَثَلُ'], 
   'فعلن': [
          'فَعَلْنَ'], 
   'فعله': [
          'فَعَلَهُ'], 
   'فأكله': [
           'فَأَكَلَهُ'], 
   'فعلم': [
          'فَعَلِمَ'], 
   'ولعنوا': [
            'وَلُعِنُوا'], 
   'بالملائكة': [
               'بِالْمَلَائِكَةِ'], 
   'وتنسون': [
            'وَتَنْسَوْنَ'], 
   'محرم': [
          'مُحَرَّمٌ'], 
   'أهديكم': [
            'أَهْدِيكُمْ'], 
   'بروح': [
          'بِرُوحِ',
          'بِرُوحٍ'], 
   'تعرى': [
          'تَعْرَى'], 
   'دونهم': [
           'دُونِهِمْ',
           'دُونِهِمُ'], 
   'مساجد': [
           'مَسَاجِدَ'], 
   'أربابا': [
            'أَرْبَابًا'], 
   'غاوين': [
           'غَاوِينَ'], 
   'تأثيما': [
            'تَأْثِيمًا'], 
   'أوهن': [
          'أَوْهَنَ'], 
   'عاقبتهما': [
              'عَاقِبَتَهُمَا'], 
   'وليضربن': [
             'وَلْيَضْرِبْنَ'], 
   'أمسكن': [
           'أَمْسَكْنَ'], 
   'المنافقين': [
               'الْمُنَافِقِينَ'], 
   'ونحاس': [
           'وَنُحَاسٌ'], 
   'ذا': [
        'ذَا'], 
   'بإذن': [
          'بِإِذْنِ'], 
   'ذريتهم': [
            'ذُرِّيَّتَهُمْ',
            'ذُرِّيَّتُهُمْ'], 
   'علقة': [
          'عَلَقَةٍ',
          'عَلَقَةً'], 
   'خاشعا': [
           'خَاشِعًا'], 
   'كذكركم': [
            'كَذِكْرِكُمْ'], 
   'منضود': [
           'مَنْضُودٍ'], 
   'خاشعة': [
           'خَاشِعَةً',
           'خَاشِعَةٌ'], 
   'سعيرا': [
           'سَعِيرًا'], 
   'ذق': [
        'ذُقْ'], 
   'أغلالا': [
            'أَغْلَالًا'], 
   'تقوله': [
           'تَقَوَّلَهُ'], 
   'تقولن': [
           'تَقُولَنَّ'], 
   'ينبئك': [
           'يُنَبِّئُكَ'], 
   'ذي': [
        'ذِي'], 
   'ذو': [
        'ذُو'], 
   'ببضاعة': [
            'بِبِضَاعَةٍ'], 
   'فسينفقونها': [
                'فَسَيُنْفِقُونَهَا'], 
   'الإبل': [
           'الْإِبِلِ'], 
   'سبعون': [
           'سَبْعُونَ'], 
   'ينطق': [
          'يَنْطِقُ'], 
   'سأصرف': [
           'سَأَصْرِفُ'], 
   'المقدسة': [
             'الْمُقَدَّسَةَ'], 
   'حلا': [
         'حِلًّا'], 
   'لتردين': [
            'لَتُرْدِينِ'], 
   'رمضان': [
           'رَمَضَانَ'], 
   'خاضوا': [
           'خَاضُوا'], 
   'لازب': [
          'لَازِبٍ'], 
   'يقربوا': [
            'يَقْرَبُوا'], 
   'والمستغفرين': [
                 'وَالْمُسْتَغْفِرِينَ'], 
   'كاشف': [
          'كَاشِفَ'], 
   'التغابن': [
             'التَّغَابُنِ'], 
   'للمتقين': [
             'لِلْمُتَّقِينَ'], 
   'تزدري': [
           'تَزْدَرِي'], 
   'نفعل': [
          'نَفْعَلُ',
          'نَفْعَلَ'], 
   'فحاق': [
          'فَحَاقَ'], 
   'إحسانا': [
            'إِحْسَانًا'], 
   'فأقمت': [
           'فَأَقَمْتَ'], 
   'ولتجدن': [
            'وَلَتَجِدَنَّ'], 
   'وللسيارة': [
              'وَلِلسَّيَّارَةِ'], 
   'بضارين': [
            'بِضَارِّينَ'], 
   'أأقررتم': [
             'أَأَقْرَرْتُمْ'], 
   'تذرن': [
          'تَذَرُنَّ'], 
   'الشافعين': [
              'الشَّافِعِينَ'], 
   'ران': [
         'رَانَ'], 
   'جاءوكم': [
            'جَاءُوكُمْ'], 
   'مولود': [
           'مَوْلُودٌ'], 
   'لتمرون': [
            'لَتَمُرُّونَ'], 
   'فوزا': [
          'فَوْزًا'], 
   'وتقلبك': [
            'وَتَقَلُّبَكَ'], 
   'هالك': [
          'هَالِكٌ'], 
   'يوعظون': [
            'يُوعَظُونَ'], 
   'تخيرون': [
            'تَخَيَّرُونَ'], 
   'وقليل': [
           'وَقَلِيلٌ'], 
   'توقدون': [
            'تُوقِدُونَ'], 
   'وصينا': [
           'وَصَّيْنَا'], 
   'تدركه': [
           'تُدْرِكُهُ'], 
   'شاهدون': [
            'شَاهِدُونَ'], 
   'شداد': [
          'شِدَادٌ'], 
   'وقالت': [
           'وَقَالَتِ',
           'وَقَالَتْ'], 
   'فأخاف': [
           'فَأَخَافُ'], 
   'لباسا': [
           'لِبَاسًا'], 
   'أخلده': [
           'أَخْلَدَهُ'], 
   'ويدعوننا': [
              'وَيَدْعُونَنَا'], 
   'لاتخذت': [
            'لَاتَّخَذْتَ'], 
   'وقالا': [
           'وَقَالَا'], 
   'تطلع': [
          'تَطَّلِعُ',
          'تَطْلُعُ'], 
   'القتلى': [
            'الْقَتْلَى'], 
   'نفعا': [
          'نَفْعًا'], 
   'وأخفى': [
           'وَأَخْفَى'], 
   'نعدهم': [
           'نَعِدُهُمْ',
           'نَعُدُّهُمْ'], 
   'ظهوركم': [
            'ظُهُورِكُمْ'], 
   'جمعهم': [
           'جَمْعِهِمْ'], 
   'يهتدي': [
           'يَهْتَدِي'], 
   'كاتبون': [
            'كَاتِبُونَ'], 
   'نفعت': [
          'نَفَعَتِ'], 
   'الجياد': [
            'الْجِيَادُ'], 
   'وأصلح': [
           'وَأَصْلَحَ',
           'وَأَصْلِحْ'], 
   'يقضي': [
          'يَقْضِي'], 
   'وليوفيهم': [
              'وَلِيُوَفِّيَهُمْ'], 
   'وقطعن': [
           'وَقَطَّعْنَ'], 
   'الأكل': [
           'الْأُكُلِ'], 
   'أزيد': [
          'أَزِيدَ'], 
   'وجدتها': [
            'وَجَدْتُهَا'], 
   'وأعنابا': [
             'وَأَعْنَابًا'], 
   'مولاكم': [
            'مَوْلَاكُمْ'], 
   'والإثم': [
            'وَالْإِثْمَ'], 
   'منصورا': [
            'مَنْصُورًا'], 
   'تسألني': [
            'تَسْأَلْنِي'], 
   'واعتصموا': [
              'وَاعْتَصِمُوا',
              'وَاعْتَصَمُوا'], 
   'الورد': [
           'الْوِرْدُ'], 
   'أعهد': [
          'أَعْهَدْ'], 
   'ولتكبروا': [
              'وَلِتُكَبِّرُوا'], 
   'حلال': [
          'حَلَالٌ'], 
   'جابوا': [
           'جَابُوا'], 
   'الملك': [
           'الْمُلْكُ',
           'الْمَلِكُ',
           'الْمُلْكِ',
           'الْمُلْكَ',
           'الْمَلِكِ'], 
   'القواعد': [
             'الْقَوَاعِدِ',
             'الْقَوَاعِدَ'], 
   'متبرجات': [
             'مُتَبَرِّجَاتٍ'], 
   'خمط': [
         'خَمْطٍ'], 
   'وقيله': [
           'وَقِيلِهِ'], 
   'تحسب': [
          'تَحْسَبُ'], 
   'خمر': [
         'خَمْرٍ'], 
   'ويلعب': [
           'وَيَلْعَبْ'], 
   'التعفف': [
            'التَّعَفُّفِ'], 
   'منافع': [
           'مَنَافِعُ',
           'مَنَافِعَ'], 
   'كأنما': [
           'كَأَنَّمَا'], 
   'بيده': [
          'بِيَدِهِ'], 
   'بئيس': [
          'بَئِيسٍ'], 
   'بيدك': [
          'بِيَدِكَ'], 
   'يفترى': [
           'يُفْتَرَى'], 
   'يفتري': [
           'يَفْتَرِي'], 
   'أجرهم': [
           'أَجْرُهُمْ',
           'أَجْرَهُمْ'], 
   'لبإمام': [
            'لَبِإِمَامٍ'], 
   'دراهم': [
           'دَرَاهِمَ'], 
   'اهتديت': [
            'اهْتَدَيْتُ'], 
   'والجروح': [
             'وَالْجُرُوحَ'], 
   'الرأي': [
           'الرَّأْيِ'], 
   'استضعفوني': [
               'اسْتَضْعَفُونِي'], 
   'ولكنه': [
           'وَلَكِنَّهُ'], 
   'وخشعت': [
           'وَخَشَعَتِ'], 
   'مكنا': [
          'مَكَّنَّا'], 
   'وصوركم': [
            'وَصَوَّرَكُمْ'], 
   'غمرات': [
           'غَمَرَاتِ'], 
   'شمسا': [
          'شَمْسًا'], 
   'لنحشرنهم': [
              'لَنَحْشُرَنَّهُمْ'], 
   'بمسبوقين': [
              'بِمَسْبُوقِينَ'], 
   'لدا': [
         'لُدًّا'], 
   'تنازعتم': [
             'تَنَازَعْتُمْ'], 
   'ربانيين': [
             'رَبَّانِيِّينَ'], 
   'آتيتنا': [
            'آتَيْتَنَا'], 
   'أجرها': [
           'أَجْرَهَا'], 
   'هاتوا': [
           'هَاتُوا'], 
   'لنبلوهم': [
             'لِنَبْلُوَهُمْ'], 
   'أتعجبين': [
             'أَتَعْجَبِينَ'], 
   'سعرت': [
          'سُعِّرَتْ'], 
   'أتقولون': [
             'أَتَقُولُونَ'], 
   'إليه': [
          'إِلَيْهِ'], 
   'إليك': [
          'إِلَيْكَ',
          'إِلَيْكِ'], 
   'القدوس': [
            'الْقُدُّوسِ',
            'الْقُدُّوسُ'], 
   'الملإ': [
           'الْمَلَإِ'], 
   'الملأ': [
           'الْمَلَأُ',
           'الْمَلَأَ'], 
   'السرائر': [
             'السَّرَائِرُ'], 
   'ويبغون': [
            'وَيَبْغُونَ'], 
   'البارئ': [
            'الْبَارِئُ'], 
   'المقنطرة': [
              'الْمُقَنْطَرَةِ'], 
   'الملة': [
           'الْمِلَّةِ'], 
   'منتقمون': [
             'مُنْتَقِمُونَ'], 
   'فأتبعهم': [
             'فَأَتْبَعَهُمْ'], 
   'بالحكمة': [
             'بِالْحِكْمَةِ'], 
   'الفقراء': [
             'الْفُقَرَاءُ',
             'الْفُقَرَاءَ'], 
   'الكاذبون': [
              'الْكَاذِبُونَ'], 
   'إلهين': [
           'إِلَهَيْنِ'], 
   'وأقنى': [
           'وَأَقْنَى'], 
   'ولقومك': [
            'وَلِقَوْمِكَ'], 
   'صم': [
        'صُمٌّ'], 
   'أراكهم': [
            'أَرَاكَهُمْ'], 
   'وتكاثر': [
            'وَتَكَاثُرٌ'], 
   'وجوههم': [
            'وُجُوهُهُمْ',
            'وُجُوهِهِمْ',
            'وُجُوهَهُمْ',
            'وُجُوهَهُمُ',
            'وُجُوهِهِمُ'], 
   'موص': [
         'مُوصٍ'], 
   'ذنب': [
         'ذَنْبٍ',
         'ذَنْبٌ'], 
   'حشر': [
         'حُشِرَ',
         'حَشْرٌ'], 
   'ويمدهم': [
            'وَيَمُدُّهُمْ'], 
   'لمغرمون': [
             'لَمُغْرَمُونَ'], 
   'خصمان': [
           'خَصْمَانِ'], 
   'المخلفون': [
              'الْمُخَلَّفُونَ'], 
   'رأفة': [
          'رَأْفَةٌ',
          'رَأْفَةً'], 
   'خاطئين': [
            'خَاطِئِينَ'], 
   'موج': [
         'مَوْجٌ',
         'مَوْجٍ'], 
   'اطمأن': [
           'اطْمَأَنَّ'], 
   'ويؤمنون': [
             'وَيُؤْمِنُونَ'], 
   'فكلي': [
          'فَكُلِي'], 
   'الضلالة': [
             'الضَّلَالَةَ',
             'الضَّلَالَةُ',
             'الضَّلَالَةِ'], 
   'أكثر': [
          'أَكْثَرَ',
          'أَكْثَرُ'], 
   'تؤاخذني': [
             'تُؤَاخِذْنِي'], 
   'آتت': [
         'آتَتْ'], 
   'فنظرة': [
           'فَنَظِرَةٌ'], 
   'استكبرتم': [
              'اسْتَكْبَرْتُمْ'], 
   'فعميت': [
           'فَعُمِّيَتْ',
           'فَعَمِيَتْ'], 
   'تأمرون': [
            'تَأْمُرُونَ'], 
   'وفعلت': [
           'وَفَعَلْتَ'], 
   'يعدهم': [
           'يَعِدُهُمُ',
           'يَعِدُهُمْ'], 
   'وكيلا': [
           'وَكِيلًا'], 
   'بآية': [
          'بِآيَةٍ'], 
   'أرني': [
          'أَرِنِي'], 
   'يبتغ': [
          'يَبْتَغِ'], 
   'وسيق': [
          'وَسِيقَ'], 
   'الخياط': [
            'الْخِيَاطِ'], 
   'صر': [
        'صِرٌّ'], 
   'سرابيلهم': [
              'سَرَابِيلُهُمْ'], 
   'صد': [
        'صَدَّ'], 
   'تؤاخذنا': [
             'تُؤَاخِذْنَا'], 
   'معشر': [
          'مَعْشَرَ'], 
   'يقيما': [
           'يُقِيمَا'], 
   'الجبل': [
           'الْجَبَلِ',
           'الْجَبَلَ'], 
   'متعناه': [
            'مَتَّعْنَاهُ'], 
   'جيبك': [
          'جَيْبِكَ'], 
   'فرارا': [
           'فِرَارًا'], 
   'ظلوما': [
           'ظَلُومًا'], 
   'فصب': [
         'فَصَبَّ'], 
   'موقنين': [
            'مُوقِنِينَ'], 
   'أحكمت': [
           'أُحْكِمَتْ'], 
   'وآتاهم': [
            'وَآتَاهُمْ'], 
   'أفبنعمة': [
             'أَفَبِنِعْمَةِ'], 
   'وجاء': [
          'وَجَاءَ'], 
   'دوني': [
          'دُونِي'], 
   'وقيضنا': [
            'وَقَيَّضْنَا'], 
   'دونه': [
          'دُونِهِ'], 
   'يريدان': [
            'يُرِيدَانِ'], 
   'دونك': [
          'دُونِكَ'], 
   'واسأل': [
           'وَاسْأَلْ',
           'وَاسْأَلِ'], 
   'ذلكما': [
           'ذَلِكُمَا'], 
   'عندها': [
           'عِنْدَهَا'], 
   'يذكرون': [
            'يَذَّكَّرُونَ',
            'يَذْكُرُونَ'], 
   'والتين': [
            'وَالتِّينِ'], 
   'فيذرها': [
            'فَيَذَرُهَا'], 
   'كتابيه': [
            'كِتَابِيَهْ'], 
   'بالقلم': [
            'بِالْقَلَمِ'], 
   'مطرا': [
          'مَطَرًا'], 
   'يوصيكم': [
            'يُوصِيكُمُ'], 
   'لكفرنا': [
            'لَكَفَّرْنَا'], 
   'الإنجيل': [
             'الْإِنْجِيلِ',
             'الْإِنْجِيلَ'], 
   'لفروجهم': [
             'لِفُرُوجِهِمْ'], 
   'وصدوا': [
           'وَصَدُّوا',
           'وَصُدُّوا'], 
   'الظالمين': [
              'الظَّالِمِينَ'], 
   'اذهب': [
          'اذْهَبْ'], 
   'تأخر': [
          'تَأَخَّرَ'], 
   'يخلقوا': [
            'يَخْلُقُوا'], 
   'ذنبك': [
          'ذَنْبِكَ'], 
   'تأخذ': [
          'تَأْخُذْ'], 
   'يعي': [
         'يَعْيَ'], 
   'ذنبه': [
          'ذَنْبِهِ'], 
   'ذراعيه': [
            'ذِرَاعَيْهِ'], 
   'يعض': [
         'يَعَضُّ'], 
   'يرجون': [
           'يَرْجُونَ'], 
   'يعص': [
         'يَعْصِ'], 
   'نربك': [
          'نُرَبِّكَ'], 
   'وكتبنا': [
            'وَكَتَبْنَا'], 
   'مردوا': [
           'مَرَدُوا'], 
   'أتبعك': [
           'أَتَّبِعُكَ'], 
   'نعقل': [
          'نَعْقِلُ'], 
   'عذابهما': [
             'عَذَابَهُمَا'], 
   'أتبعه': [
           'أَتَّبِعْهُ'], 
   'متاعنا': [
            'مَتَاعِنَا',
            'مَتَاعَنَا'], 
   'مردود': [
           'مَرْدُودٍ'], 
   'هما': [
         'هُمَا'], 
   'يخلقون': [
            'يُخْلَقُونَ',
            'يَخْلُقُونَ'], 
   'وريشا': [
           'وَرِيشًا'], 
   'همت': [
         'هَمَّتْ'], 
   'ويتخذ': [
           'وَيَتَّخِذُ',
           'وَيَتَّخِذَ'], 
   'تسعا': [
          'تِسْعًا'], 
   'بطشتم': [
           'بَطَشْتُمْ'], 
   'أهلنا': [
           'أَهْلِنَا',
           'أَهْلَنَا'], 
   'آسفونا': [
            'آسَفُونَا'], 
   'فتخبت': [
           'فَتُخْبِتَ'], 
   'وفاقا': [
           'وِفَاقًا'], 
   'رباط': [
          'رِبَاطِ'], 
   'يمحق': [
          'يَمْحَقُ'], 
   'شفا': [
         'شَفَا'], 
   'يطيعكم': [
            'يُطِيعُكُمْ'], 
   'تلاها': [
           'تَلَاهَا'], 
   'يمحو': [
          'يَمْحُو'], 
   'عندهم': [
           'عِنْدَهُمْ',
           'عِنْدَهُمُ'], 
   'الغيوب': [
            'الْغُيُوبِ'], 
   'قلوبهم': [
            'قُلُوبِهِمْ',
            'قُلُوبُهُمْ',
            'قُلُوبِهِمُ',
            'قُلُوبَهُمْ'], 
   'الصيد': [
           'الصَّيْدِ',
           'الصَّيْدَ'], 
   'بعهده': [
           'بِعَهْدِهِ'], 
   'والقائمين': [
               'وَالْقَائِمِينَ'], 
   'سنين': [
          'سِنِينَ'], 
   'فيقول': [
           'فَيَقُولُ',
           'فَيَقُولَ'], 
   'يعصمك': [
           'يَعْصِمُكَ'], 
   'اليم': [
          'الْيَمِّ',
          'الْيَمُّ'], 
   'وبني': [
          'وَبَنِيَّ'], 
   'الفوز': [
           'الْفَوْزُ'], 
   'تعلمها': [
            'تَعْلَمُهَا'], 
   'نمكن': [
          'نُمَكِّنْ'], 
   'ومقصرين': [
             'وَمُقَصِّرِينَ'], 
   'وعذب': [
          'وَعَذَّبَ'], 
   'فكرهتموه': [
              'فَكَرِهْتُمُوهُ'], 
   'صدقاتكم': [
             'صَدَقَاتِكُمْ'], 
   'ويمكرون': [
             'وَيَمْكُرُونَ'], 
   'البحر': [
           'الْبَحْرِ',
           'الْبَحْرَ',
           'الْبَحْرُ'], 
   'أعناب': [
           'أَعْنَابٍ'], 
   'متاع': [
          'مَتَاعٌ',
          'مَتَاعُ',
          'مَتَاعَ',
          'مَتَاعٍ'], 
   'المخسرين': [
              'الْمُخْسِرِينَ'], 
   'أرادني': [
            'أَرَادَنِيَ',
            'أَرَادَنِي'], 
   'لحسن': [
          'لَحُسْنَ'], 
   'أصبح': [
          'أَصْبَحَ'], 
   'استحق': [
           'اسْتَحَقَّ'], 
   'فأووا': [
           'فَأْوُوا'], 
   'وما': [
         'وَمَا'], 
   'متاب': [
          'مَتَابِ'], 
   'بينت': [
          'بَيِّنَتٍ'], 
   'أقطار': [
           'أَقْطَارِ'], 
   'فيما': [
          'فِيمَا'], 
   'فتقبلها': [
             'فَتَقَبَّلَهَا'], 
   'لخلق': [
          'لِخَلْقِ',
          'لَخَلْقُ'], 
   'بالأخسرين': [
               'بِالْأَخْسَرِينَ'], 
   'يلقونه': [
            'يَلْقَوْنَهُ'], 
   'حضروه': [
           'حَضَرُوهُ'], 
   'وبالوالدين': [
                'وَبِالْوَالِدَيْنِ'], 
   'اللائي': [
            'اللَّائِي'], 
   'تهنوا': [
           'تَهِنُوا'], 
   'فابتغوا': [
             'فَابْتَغُوا'], 
   'ومن': [
         'وَمَنْ',
         'وَمِنْ',
         'وَمِنَ',
         'وَمَنِ'], 
   'يركعون': [
            'يَرْكَعُونَ'], 
   'يغيظ': [
          'يَغِيظُ'], 
   'والزيتون': [
              'وَالزَّيْتُونَ',
              'وَالزَّيْتُونِ'], 
   'الرقيب': [
            'الرَّقِيبَ'], 
   'عقلوه': [
           'عَقَلُوهُ'], 
   'تتبعن': [
           'تَتَّبِعَنِ'], 
   'تتولوا': [
            'تَتَوَلَّوْا'], 
   'الثمرات': [
             'الثَّمَرَاتِ'], 
   'فورهم': [
           'فَوْرِهِمْ'], 
   'لأكلوا': [
            'لَأَكَلُوا'], 
   'تعلمهم': [
            'تَعْلَمُهُمْ'], 
   'لحكمه': [
           'لِحُكْمِهِ'], 
   'أنلزمكموها': [
                'أَنُلْزِمُكُمُوهَا'], 
   'العسرة': [
            'الْعُسْرَةِ'], 
   'وجوها': [
           'وُجُوهًا'], 
   'واستغنى': [
             'وَاسْتَغْنَى'], 
   'برسلنا': [
            'بِرُسُلِنَا'], 
   'أنثى': [
          'أُنْثَى'], 
   'صدور': [
          'صُدُورِ',
          'صُدُورَ'], 
   'كتابك': [
           'كِتَابَكَ'], 
   'نسبا': [
          'نَسَبًا'], 
   'بآبائنا': [
             'بِآبَائِنَا'], 
   'نسبح': [
          'نُسَبِّحُ'], 
   'ويأبى': [
           'وَيَأْبَى'], 
   'وجئتك': [
           'وَجِئْتُكَ'], 
   'تبقي': [
          'تُبْقِي'], 
   'الحجة': [
           'الْحُجَّةُ'], 
   'أحللنا': [
            'أَحْلَلْنَا'], 
   'اصنع': [
          'اصْنَعِ'], 
   'اهتدى': [
           'اهْتَدَى'], 
   'نضيد': [
          'نَضِيدٌ'], 
   'انتصر': [
           'انْتَصَرَ'], 
   'شاكر': [
          'شَاكِرٌ'], 
   'بشق': [
         'بِشِقِّ'], 
   'بحاملين': [
             'بِحَامِلِينَ'], 
   'مقطوعة': [
            'مَقْطُوعَةٍ'], 
   'شيطانا': [
            'شَيْطَانًا'], 
   'الراكعين': [
              'الرَّاكِعِينَ'], 
   'قريتنا': [
            'قَرْيَتِنَا'], 
   'فأضلونا': [
             'فَأَضَلُّونَا'], 
   'وتنزع': [
           'وَتَنْزِعُ'], 
   'المكذبون': [
              'الْمُكَذِّبُونَ'], 
   'أساطير': [
            'أَسَاطِيرُ'], 
   'يسقون': [
           'يُسْقَوْنَ',
           'يَسْقُونَ'], 
   'الجاهلين': [
              'الْجَاهِلِينَ'], 
   'ليحزنك': [
            'لَيَحْزُنُكَ'], 
   'بازغا': [
           'بَازِغًا'], 
   'شكله': [
          'شَكْلِهِ'], 
   'بازغة': [
           'بَازِغَةً'], 
   'فكاتبوهم': [
              'فَكَاتِبُوهُمْ'], 
   'مخرجون': [
            'مُخْرَجُونَ'], 
   'بمصيطر': [
            'بِمُصَيْطِرٍ'], 
   'بشر': [
         'بَشَرٌ',
         'بُشِّرَ',
         'بِشَرٍّ',
         'بَشِّرِ',
         'بَشَرٍ'], 
   'ونري': [
          'وَنُرِيَ'], 
   'والأنف': [
            'وَالْأَنْفَ'], 
   'بلغني': [
           'بَلَغَنِيَ'], 
   'لأغوينهم': [
              'لَأُغْوِيَنَّهُمْ'], 
   'السكينة': [
             'السَّكِينَةَ'], 
   'سبلا': [
          'سُبُلًا'], 
   'يميتني': [
            'يُمِيتُنِي'], 
   'يركبون': [
            'يَرْكَبُونَ'], 
   'تحدث': [
          'تُحَدِّثُ'], 
   'أماناتكم': [
              'أَمَانَاتِكُمْ'], 
   'بمصر': [
          'بِمِصْرَ'], 
   'نؤتيه': [
           'نُؤْتِيهِ'], 
   'فسبحان': [
            'فَسُبْحَانَ'], 
   'أعصر': [
          'أَعْصِرُ'], 
   'منشور': [
           'مَنْشُورٍ'], 
   'فيمسك': [
           'فَيُمْسِكُ'], 
   'وبالليل': [
             'وَبِاللَّيْلِ'], 
   'عذابها': [
            'عَذَابِهَا',
            'عَذَابَهَا'], 
   'نقر': [
         'نُقِرَ'], 
   'دكة': [
         'دَكَّةً'], 
   'لدني': [
          'لَدُنِّي'], 
   'يتلو': [
          'يَتْلُو'], 
   'بأسا': [
          'بَأْسًا'], 
   'فأغرينا': [
             'فَأَغْرَيْنَا'], 
   'لدنك': [
          'لَدُنْكَ'], 
   'فسواك': [
           'فَسَوَّاكَ'], 
   'لدنه': [
          'لَدُنْهُ'], 
   'أنذرهم': [
            'أَنْذَرَهُمْ'], 
   'زادته': [
           'زَادَتْهُ'], 
   'فلنذيقن': [
             'فَلَنُذِيقَنَّ'], 
   'رحمتك': [
           'رَحْمَتِكَ'], 
   'رجالكم': [
            'رِجَالِكُمْ'], 
   'يتيهون': [
            'يَتِيهُونَ'], 
   'بريء': [
          'بَرِيءٌ'], 
   'أخزيته': [
            'أَخْزَيْتَهُ'], 
   'بريح': [
          'بِرِيحٍ'], 
   'إيمانه': [
            'إِيمَانِهِ',
            'إِيمَانَهُ'], 
   'خفتم': [
          'خِفْتُمْ'], 
   'فتهجد': [
           'فَتَهَجَّدْ'], 
   'طلقكن': [
           'طَلَّقَكُنَّ'], 
   'مخذولا': [
            'مَخْذُولًا'], 
   'النبإ': [
           'النَّبَإِ'], 
   'جذع': [
         'جِذْعِ'], 
   'رحمته': [
           'رَحْمَتِهِ',
           'رَحْمَتَهُ',
           'رَحِمْتَهُ'], 
   'بالمفسدين': [
               'بِالْمُفْسِدِينَ'], 
   'فجعلناهم': [
              'فَجَعَلْنَاهُمْ',
              'فَجَعَلْنَاهُمُ'], 
   'فجعلناهن': [
              'فَجَعَلْنَاهُنَّ'], 
   'ومشهود': [
            'وَمَشْهُودٍ'], 
   'عصاك': [
          'عَصَاكَ'], 
   'ونصرناهم': [
              'وَنَصَرْنَاهُمْ'], 
   'معقبات': [
            'مُعَقِّبَاتٌ'], 
   'عصاه': [
          'عَصَاهُ'], 
   'يرونها': [
            'يَرَوْنَهَا'], 
   'فللوالدين': [
               'فَلِلْوَالِدَيْنِ'], 
   'عصاي': [
          'عَصَايَ'], 
   'فأذن': [
          'فَأْذَنْ',
          'فَأَذَّنَ'], 
   'ليفتنونك': [
              'لَيَفْتِنُونَكَ'], 
   'رسلهم': [
           'رُسُلُهُمْ'], 
   'مهطعين': [
            'مُهْطِعِينَ'], 
   'أموالا': [
            'أَمْوَالًا'], 
   'أيطمع': [
           'أَيَطْمَعُ'], 
   'وتصلية': [
            'وَتَصْلِيَةُ'], 
   'الراشدون': [
              'الرَّاشِدُونَ'], 
   'النبي': [
           'النَّبِيُّ',
           'النَّبِيِّ',
           'النَّبِيَّ'], 
   'فاعبدوه': [
             'فَاعْبُدُوهُ'], 
   'فجعلناها': [
              'فَجَعَلْنَاهَا'], 
   'ووحينا': [
            'وَوَحْيِنَا'], 
   'المرفوع': [
             'الْمَرْفُوعِ'], 
   'أتل': [
         'أَتْلُ'], 
   'التقوى': [
            'التَّقْوَى'], 
   'يرونهم': [
            'يَرَوْنَهُمْ'], 
   'علينا': [
           'عَلَيْنَا'], 
   'ترضى': [
          'تَرْضَى'], 
   'يومين': [
           'يَوْمَيْنِ'], 
   'سبعين': [
           'سَبْعِينَ'], 
   'أنعمت': [
           'أَنْعَمْتَ',
           'أَنْعَمْتُ'], 
   'بأسه': [
          'بَأْسُهُ'], 
   'وأنابوا': [
             'وَأَنَابُوا'], 
   'مرجوا': [
           'مَرْجُوًّا'], 
   'بسطت': [
          'بَسَطْتَ'], 
   'لحبط': [
          'لَحَبِطَ'], 
   'لدنا': [
          'لَدُنَّا'], 
   'بسطة': [
          'بَسْطَةً'], 
   'غيبه': [
          'غَيْبِهِ'], 
   'والبنين': [
             'وَالْبَنِينَ'], 
   'دعيتم': [
           'دُعِيتُمْ'], 
   'موتكم': [
           'مَوْتِكُمْ'], 
   'محسن': [
          'مُحْسِنٌ'], 
   'ويجعلون': [
             'وَيَجْعَلُونَ'], 
   'تقديرا': [
            'تَقْدِيرًا'], 
   'ويكشف': [
           'وَيَكْشِفُ'], 
   'كادح': [
          'كَادِحٌ'], 
   'وجهاد': [
           'وَجِهَادٍ'], 
   'لكاذبون': [
             'لَكَاذِبُونَ'], 
   'سعدوا': [
           'سُعِدُوا'], 
   'بربكم': [
           'بِرَبِّكُمْ'], 
   'لأكفرن': [
            'لَأُكَفِّرَنَّ'], 
   'ودعك': [
          'وَدَّعَكَ'], 
   'الجمع': [
           'الْجَمْعِ',
           'الْجَمْعُ'], 
   'تأكلوها': [
             'تَأْكُلُوهَا'], 
   'اعتزلوكم': [
              'اعْتَزَلُوكُمْ'], 
   'فدلاهما': [
             'فَدَلَّاهُمَا'], 
   'وزكاة': [
           'وَزَكَاةً'], 
   'أسمائه': [
            'أَسْمَائِهِ'], 
   'سم': [
        'سَمِّ'], 
   'سل': [
        'سَلْ'], 
   'آباءكم': [
            'آبَاءَكُمْ'], 
   'وأتيناك': [
             'وَأَتَيْنَاكَ'], 
   'وذلكم': [
           'وَذَلِكُمْ'], 
   'وأدخلناهم': [
               'وَأَدْخَلْنَاهُمْ'], 
   'الوارثون': [
              'الْوَارِثُونَ'], 
   'سيكفرون': [
             'سَيَكْفُرُونَ'], 
   'أصدقت': [
           'أَصَدَقْتَ'], 
   'فأثابهم': [
             'فَأَثَابَهُمُ'], 
   'فاغفر': [
           'فَاغْفِرْ'], 
   'يترك': [
          'يُتْرَكَ'], 
   'أتخذ': [
          'أَتَّخِذْ',
          'أَتَّخِذُ'], 
   'وعادا': [
           'وَعَادًا'], 
   'اذكروا': [
            'اذْكُرُوا'], 
   'ثالث': [
          'ثَالِثُ'], 
   'ادفع': [
          'ادْفَعْ'], 
   'سبحان': [
           'سُبْحَانَ'], 
   'بالقرآن': [
             'بِالْقُرْآنِ'], 
   'ويصبر': [
           'وَيَصْبِرْ'], 
   'فابعثوا': [
             'فَابْعَثُوا'], 
   'خافضة': [
           'خَافِضَةٌ'], 
   'واهجرهم': [
             'وَاهْجُرْهُمْ'], 
   'الجمل': [
           'الْجَمَلُ'], 
   'أباه': [
          'أَبَاهُ'], 
   'وحور': [
          'وَحُورٌ'], 
   'سبحوا': [
           'سَبِّحُوا'], 
   'ونورهم': [
            'وَنُورُهُمْ'], 
   'تؤثرون': [
            'تُؤْثِرُونَ'], 
   'واردون': [
            'وَارِدُونَ'], 
   'ويجعلكم': [
             'وَيَجْعَلُكُمْ'], 
   'والسابحات': [
               'وَالسَّابِحَاتِ'], 
   'دعوتك': [
           'دَعْوَتَكَ'], 
   'ولأبين': [
            'وَلِأُبَيِّنَ'], 
   'وجاءته': [
            'وَجَاءَتْهُ'], 
   'ملومين': [
            'مَلُومِينَ'], 
   'وتولى': [
           'وَتَوَلَّى'], 
   'تسعى': [
          'تَسْعَى'], 
   'ثلاثين': [
            'ثَلَاثِينَ'], 
   'تعدنا': [
           'تَعِدُنَا'], 
   'أوتوا': [
           'أُوتُوا'], 
   'توفيتني': [
             'تَوَفَّيْتَنِي'], 
   'وارجعوا': [
             'وَارْجِعُوا'], 
   'منوعا': [
           'مَنُوعًا'], 
   'كاد': [
         'كَادَ'], 
   'ينكحن': [
           'يَنْكِحْنَ'], 
   'فكبكبوا': [
             'فَكُبْكِبُوا'], 
   'اهتدوا': [
            'اهْتَدَوْا'], 
   'وأتمروا': [
             'وَأْتَمِرُوا'], 
   'سراحا': [
           'سَرَاحًا'], 
   'خزائنه': [
            'خَزَائِنُهُ'], 
   'أمنا': [
          'أَمْنًا'], 
   'وأطغى': [
           'وَأَطْغَى'], 
   'بالصدق': [
            'بِالصِّدْقِ'], 
   'خافت': [
          'خَافَتْ'], 
   'وأهلنا': [
            'وَأَهْلَنَا'], 
   'خلقك': [
          'خَلَقَكَ'], 
   'نظرة': [
          'نَظْرَةً'], 
   'والذكر': [
            'وَالذِّكْرِ'], 
   'سيصيبهم': [
             'سَيُصِيبُهُمْ'], 
   'جاثمين': [
            'جَاثِمِينَ'], 
   'إثم': [
         'إِثْمَ',
         'إِثْمٌ'], 
   'السامري': [
             'السَّامِرِيُّ'], 
   'كان': [
         'كَانَ'], 
   'أجرمنا': [
            'أَجْرَمْنَا'], 
   'أعمى': [
          'أَعْمَى'], 
   'كالمفسدين': [
               'كَالْمُفْسِدِينَ'], 
   'خلقت': [
          'خَلَقْتُ',
          'خَلَقْتَ',
          'خُلِقَتْ'], 
   'اكتسبوا': [
             'اكْتَسَبُوا'], 
   'لفسدتا': [
            'لَفَسَدَتَا'], 
   'بعثه': [
          'بَعَثَهُ'], 
   'الضالين': [
             'الضَّالِّينَ'], 
   'تبصرون': [
            'تُبْصِرُونَ'], 
   'أعمل': [
          'أَعْمَلُ',
          'أَعْمَلَ'], 
   'وأخذنا': [
            'وَأَخَذْنَا'], 
   'نجعلهم': [
            'نَجْعَلَهُمْ'], 
   'تجهر': [
          'تَجْهَرْ'], 
   'التهلكة': [
             'التَّهْلُكَةِ'], 
   'لنبي': [
          'لِنَبِيٍّ'], 
   'يدعونه': [
            'يَدْعُونَهُ'], 
   'أياما': [
           'أَيَّامًا'], 
   'وقاسمهما': [
              'وَقَاسَمَهُمَا'], 
   'ونجيناهما': [
               'وَنَجَّيْنَاهُمَا'], 
   'بالعرف': [
            'بِالْعُرْفِ'], 
   'وتولج': [
           'وَتُولِجُ'], 
   'سيل': [
         'سَيْلَ'], 
   'فقراء': [
           'فُقَرَاءَ'], 
   'تخاطبني': [
             'تُخَاطِبْنِي'], 
   'يذبحون': [
            'يُذَبِّحُونَ'], 
   'بلوناهم': [
             'بَلَوْنَاهُمْ'], 
   'قمتم': [
          'قُمْتُمْ'], 
   'يستعجلون': [
              'يَسْتَعْجِلُونَ',
              'يَسْتَعْجِلُونِ'], 
   'وظهر': [
          'وَظَهَرَ'], 
   'وقارون': [
            'وَقَارُونَ'], 
   'حملتم': [
           'حُمِّلْتُمْ'], 
   'حملته': [
           'حَمَلَتْهُ',
           'حَمَلْتَهُ'], 
   'دائرة': [
           'دَائِرَةُ',
           'دَائِرَةٌ'], 
   'تضاروهن': [
             'تُضَارُّوهُنَّ'], 
   'المقتر': [
            'الْمُقْتِرِ'], 
   'سفه': [
         'سَفِهَ'], 
   'شفعاءكم': [
             'شُفَعَاءَكُمُ'], 
   'مملوكا': [
            'مَمْلُوكًا'], 
   'لواحد': [
           'لَوَاحِدٌ'], 
   'وشقاق': [
           'وَشِقَاقٍ'], 
   'سوآتكم': [
            'سَوْآتِكُمْ'], 
   'لعذبنا': [
            'لَعَذَّبْنَا'], 
   'قولوا': [
           'قُولُوا'], 
   'وأموالهم': [
              'وَأَمْوَالَهُمْ',
              'وَأَمْوَالِهِمْ'], 
   'انظرنا': [
            'انْظُرْنَا'], 
   'وحمله': [
           'وَحَمْلُهُ'], 
   'أخبارها': [
             'أَخْبَارَهَا'], 
   'نعبدهم': [
            'نَعْبُدُهُمْ'], 
   'نعذبه': [
           'نُعَذِّبُهُ'], 
   'تلهى': [
          'تَلَهَّى'], 
   'لتؤمنن': [
            'لَتُؤْمِنُنَّ'], 
   'ائتيا': [
           'ائْتِيَا'], 
   'أيكم': [
          'أَيُّكُمْ'], 
   'تمر': [
         'تَمُرُّ'], 
   'يسألونك': [
             'يَسْأَلُونَكَ'], 
   'فإلهكم': [
            'فَإِلَهُكُمْ'], 
   'يعقب': [
          'يُعَقِّبْ'], 
   'صرفناه': [
            'صَرَّفْنَاهُ'], 
   'أحسب': [
          'أَحَسِبَ'], 
   'ذكروا': [
           'ذُكِّرُوا',
           'ذَكَرُوا'], 
   'تمت': [
         'تَمُتْ'], 
   'شهيقا': [
           'شَهِيقًا'], 
   'قبس': [
         'قَبَسٍ'], 
   'لرسلهم': [
            'لِرُسُلِهِمْ'], 
   'أألد': [
          'أَأَلِدُ'], 
   'زوجه': [
          'زَوْجَهُ'], 
   'أهلي': [
          'أَهْلِي'], 
   'ولتعلموا': [
              'وَلِتَعْلَمُوا'], 
   'ونذير': [
           'وَنَذِيرٌ'], 
   'أهله': [
          'أَهْلِهِ',
          'أَهْلَهُ',
          'أَهْلُهُ'], 
   'بسحرهما': [
             'بِسِحْرِهِمَا'], 
   'أهلك': [
          'أَهْلَكَ',
          'أَهْلِكَ'], 
   'نقيبا': [
           'نَقِيبًا'], 
   'كفرتم': [
           'كَفَرْتُمْ'], 
   'مهانا': [
           'مُهَانًا'], 
   'سفر': [
         'سَفَرٍ'], 
   'إفكا': [
          'إِفْكًا'], 
   'فاحذرهم': [
             'فَاحْذَرْهُمْ'], 
   'بغم': [
         'بِغَمٍّ'], 
   'ميتة': [
          'مَيْتَةً'], 
   'أصناما': [
            'أَصْنَامًا'], 
   'ثيابكم': [
            'ثِيَابَكُمْ'], 
   'يجأرون': [
            'يَجْأَرُونَ'], 
   'توصية': [
           'تَوْصِيَةً'], 
   'وأعرض': [
           'وَأَعْرِضْ',
           'وَأَعْرَضَ'], 
   'لنسلم': [
           'لِنُسْلِمَ'], 
   'أحدهم': [
           'أَحَدُهُمْ',
           'أَحَدِهِمْ',
           'أَحَدَهُمُ'], 
   'فالتقمه': [
             'فَالْتَقَمَهُ'], 
   'ميتا': [
          'مَيْتًا'], 
   'الذباب': [
            'الذُّبَابُ'], 
   'وسيحلفون': [
              'وَسَيَحْلِفُونَ'], 
   'شهيدين': [
            'شَهِيدَيْنِ'], 
   'تصيبنا': [
            'تُصِيبَنَا'], 
   'يناله': [
           'يَنَالُهُ'], 
   'المساق': [
            'الْمَسَاقُ'], 
   'فوقاهم': [
            'فَوَقَاهُمُ'], 
   'ميقات': [
           'مِيقَاتِ',
           'مِيقَاتُ'], 
   'يسلكه': [
           'يَسْلُكْهُ'], 
   'خسارا': [
           'خَسَارًا'], 
   'الساحر': [
            'السَّاحِرُ'], 
   'آتيتم': [
           'آتَيْتُمْ'], 
   'خطوات': [
           'خُطُوَاتِ'], 
   'ليرزقنهم': [
              'لَيَرْزُقَنَّهُمُ'], 
   'يظهرون': [
            'يَظْهَرُونَ'], 
   'فاستمعوا': [
              'فَاسْتَمِعُوا'], 
   'ساجدين': [
            'سَاجِدِينَ'], 
   'طغوا': [
          'طَغَوْا'], 
   'بارئكم': [
            'بَارِئِكُمْ'], 
   'متابا': [
           'مَتَابًا'], 
   'كافرين': [
            'كَافِرِينَ'], 
   'وعلمناه': [
             'وَعَلَّمْنَاهُ'], 
   'لمدينون': [
             'لَمَدِينُونَ'], 
   'فاصطادوا': [
              'فَاصْطَادُوا'], 
   'عمره': [
          'عُمُرِهِ'], 
   'احشروا': [
            'احْشُرُوا'], 
   'وأتممناها': [
               'وَأَتْمَمْنَاهَا'], 
   'كعذاب': [
           'كَعَذَابِ'], 
   'إذا': [
         'إِذَا',
         'إِذًا'], 
   'ويقولوا': [
             'وَيَقُولُوا'], 
   'وليؤمنوا': [
              'وَلْيُؤْمِنُوا'], 
   'ياسين': [
           'يَاسِينَ'], 
   'مقضيا': [
           'مَقْضِيًّا'], 
   'ويقللكم': [
             'وَيُقَلِّلُكُمْ'], 
   'أنشأ': [
          'أَنْشَأَ'], 
   'لباسهما': [
             'لِبَاسَهُمَا'], 
   'يرضونكم': [
             'يُرْضُونَكُمْ'], 
   'أفاء': [
          'أَفَاءَ'], 
   'عمرا': [
          'عُمُرًا'], 
   'حشرت': [
          'حُشِرَتْ'], 
   'إحداهن': [
            'إِحْدَاهُنَّ'], 
   'ويريكم': [
            'وَيُرِيكُمْ'], 
   'الحساب': [
            'الْحِسَابِ',
            'الْحِسَابُ'], 
   'بغي': [
         'بُغِيَ'], 
   'سيهديهم': [
             'سَيَهْدِيهِمْ'], 
   'بنميم': [
           'بِنَمِيمٍ'], 
   'أئنا': [
          'أَئِنَّا'], 
   'شهر': [
         'شَهْرٌ',
         'شَهْرُ',
         'شَهْرٍ'], 
   'إقامتكم': [
             'إِقَامَتِكُمْ'], 
   'وحكما': [
           'وَحَكَمًا'], 
   'ويعوق': [
           'وَيَعُوقَ'], 
   'يوفيهم': [
            'يُوَفِّيهِمُ'], 
   'فجزاء': [
           'فَجَزَاءٌ'], 
   'ويقتلون': [
             'وَيَقْتُلُونَ',
             'وَيُقْتَلُونَ'], 
   'الفتاح': [
            'الْفَتَّاحُ'], 
   'يغتب': [
          'يَغْتَبْ'], 
   'يسألك': [
           'يَسْأَلُكَ'], 
   'مطلع': [
          'مَطْلِعَ',
          'مَطْلَعِ'], 
   'وآتيناهما': [
               'وَآتَيْنَاهُمَا'], 
   'شهد': [
         'شَهِدَ'], 
   'فسيروا': [
            'فَسِيرُوا'], 
   'والنبي': [
            'وَالنَّبِيِّ'], 
   'يسرفوا': [
            'يُسْرِفُوا'], 
   'الله': [
          'اللَّهِ',
          'اللَّهُ',
          'اللَّهَ'], 
   'عدو': [
         'عَدُوٌّ',
         'عَدُوٍّ',
         'عَدُوَّ'], 
   'عدن': [
         'عَدْنٍ'], 
   'تنقذ': [
          'تُنْقِذُ'], 
   'عدل': [
         'عَدْلٍ',
         'عَدْلٌ',
         'عَدْلُ'], 
   'فانصب': [
           'فَانْصَبْ'], 
   'فتقطعوا': [
             'فَتَقَطَّعُوا'], 
   'تنقص': [
          'تَنْقُصُ'], 
   'علمكم': [
           'عَلَّمَكُمُ',
           'عَلَّمَكُمْ'], 
   'وبه': [
         'وَبِهِ'], 
   'اليتامى': [
             'الْيَتَامَى'], 
   'فليستعفف': [
              'فَلْيَسْتَعْفِفْ'], 
   'فخذوه': [
           'فَخُذُوهُ'], 
   'وعدتهم': [
            'وَعَدْتَهُمْ'], 
   'الصالح': [
            'الصَّالِحُ'], 
   'وبالزبر': [
             'وَبِالزُّبُرِ'], 
   'ويشهد': [
           'وَيُشْهِدُ'], 
   'القرون': [
            'الْقُرُونِ',
            'الْقُرُونَ',
            'الْقُرُونُ'], 
   'تميز': [
          'تَمَيَّزُ'], 
   'وليجدوا': [
             'وَلْيَجِدُوا'], 
   'للسمع': [
           'لِلسَّمْعِ'], 
   'يشقق': [
          'يَشَّقَّقُ'], 
   'لبثوا': [
           'لَبِثُوا'], 
   'ألقوا': [
           'أَلْقُوا',
           'أُلْقُوا',
           'أَلْقَوْا'], 
   'يشقى': [
          'يَشْقَى'], 
   'أصنامكم': [
             'أَصْنَامَكُمْ'], 
   'عبدنا': [
           'عَبْدَنَا',
           'عَبْدِنَا',
           'عَبَدْنَا'], 
   'بردا': [
          'بَرْدًا'], 
   'فبصرت': [
           'فَبَصُرَتْ'], 
   'مشيد': [
          'مَشِيدٍ'], 
   'دعائي': [
           'دُعَائِي'], 
   'يأكلان': [
            'يَأْكُلَانِ'], 
   'للساعة': [
            'لِلسَّاعَةِ'], 
   'منزلها': [
            'مُنَزِّلُهَا'], 
   'ديارنا': [
            'دِيَارِنَا'], 
   'وكف': [
         'وَكَفَّ'], 
   'وكن': [
         'وَكُنْ'], 
   'فيهم': [
          'فِيهِمْ'], 
   'وكل': [
         'وَكُلٌّ',
         'وَكُلُّ',
         'وَكُلَّ',
         'وُكِّلَ'], 
   'وكم': [
         'وَكَمْ'], 
   'بنيناها': [
             'بَنَيْنَاهَا'], 
   'ارجع': [
          'ارْجِعْ',
          'ارْجِعِ'], 
   'لافتدت': [
            'لَافْتَدَتْ'], 
   'عدد': [
         'عَدَدَ'], 
   'يلدوا': [
           'يَلِدُوا'], 
   'عدة': [
         'عِدَّةَ',
         'عِدَّةٍ',
         'عُدَّةً'], 
   'والمغفرة': [
              'وَالْمَغْفِرَةِ'], 
   'عدا': [
         'عَدًّا'], 
   'ظننتم': [
           'ظَنَنْتُمْ'], 
   'وأطراف': [
            'وَأَطْرَافَ'], 
   'ليحزن': [
           'لِيَحْزُنَ'], 
   'والفرقان': [
              'وَالْفُرْقَانِ',
              'وَالْفُرْقَانَ'], 
   'تفيضون': [
            'تُفِيضُونَ'], 
   'ووضعنا': [
            'وَوَضَعْنَا'], 
   'الفيل': [
           'الْفِيلِ'], 
   'وعنبا': [
           'وَعِنَبًا'], 
   'وبث': [
         'وَبَثَّ'], 
   'زينتهن': [
            'زِينَتَهُنَّ',
            'زِينَتِهِنَّ'], 
   'الأسفل': [
            'الْأَسْفَلِ'], 
   'تلهيهم': [
            'تُلْهِيهِمْ'], 
   'تنقم': [
          'تَنْقِمُ'], 
   'حطاما': [
           'حُطَامًا'], 
   'تظلم': [
          'تُظْلَمُ',
          'تَظْلِمْ'], 
   'وبشير': [
           'وَبَشِيرٌ'], 
   'فنادى': [
           'فَنَادَى'], 
   'لأمارة': [
            'لَأَمَّارَةٌ'], 
   'العشاء': [
            'الْعِشَاءِ'], 
   'مسافحين': [
             'مُسَافِحِينَ'], 
   'بحور': [
          'بِحُورٍ'], 
   'خوله': [
          'خَوَّلَهُ'], 
   'يمارون': [
            'يُمَارُونَ'], 
   'بعثكم': [
           'بَعْثُكُمْ'], 
   'ولأدخلناهم': [
                'وَلَأَدْخَلْنَاهُمْ'], 
   'العشار': [
            'الْعِشَارُ'], 
   'أفاك': [
          'أَفَّاكٍ'], 
   'المفتون': [
             'الْمَفْتُونُ'], 
   'غراما': [
           'غَرَامًا'], 
   'العزم': [
           'الْعَزْمِ'], 
   'عمروها': [
            'عَمَرُوهَا'], 
   'أقمتم': [
           'أَقَمْتُمُ'], 
   'تبت': [
         'تُبْتُ',
         'تَبَّتْ'], 
   'تبد': [
         'تُبْدَ'], 
   'ويسبح': [
           'وَيُسَبِّحُ'], 
   'ولنكونن': [
             'وَلَنَكُونَنَّ'], 
   'وتنذر': [
           'وَتُنْذِرَ'], 
   'يجادلون': [
             'يُجَادِلُونَ'], 
   'تبع': [
         'تُبَّعٍ',
         'تَبِعَ'], 
   'رغدا': [
          'رَغَدًا'], 
   'ميثاقكم': [
             'مِيثَاقَكُمْ'], 
   'عجلنا': [
           'عَجَّلْنَا'], 
   'تعفوا': [
           'تَعْفُوا'], 
   'والفتنة': [
             'وَالْفِتْنَةُ'], 
   'الناصحين': [
              'النَّاصِحِينَ'], 
   'بدلوا': [
           'بَدَّلُوا'], 
   'ونلعب': [
           'وَنَلْعَبُ'], 
   'لتكونن': [
            'لَتَكُونَنَّ'], 
   'نصيرا': [
           'نَصِيرًا'], 
   'العزة': [
           'الْعِزَّةَ',
           'الْعِزَّةُ',
           'الْعِزَّةِ'], 
   'شأنهم': [
           'شَأْنِهِمْ'], 
   'قائم': [
          'قَائِمٌ'], 
   'قائل': [
          'قَائِلٌ'], 
   'يرثني': [
           'يَرِثُنِي'], 
   'يسمعونكم': [
              'يَسْمَعُونَكُمْ'], 
   'يفرحون': [
            'يَفْرَحُونَ'], 
   'منتهون': [
            'مُنْتَهُونَ'], 
   'هلوعا': [
           'هَلُوعًا'], 
   'لواقح': [
           'لَوَاقِحَ'], 
   'تأويلا': [
            'تَأْوِيلًا'], 
   'تضرعا': [
           'تَضَرُّعًا'], 
   'شكرا': [
          'شُكْرًا'], 
   'تجرمون': [
            'تُجْرِمُونَ'], 
   'فليكونوا': [
              'فَلْيَكُونُوا'], 
   'يبسطوا': [
            'يَبْسُطُوا'], 
   'استعجلتم': [
              'اسْتَعْجَلْتُمْ'], 
   'استنكفوا': [
              'اسْتَنْكَفُوا'], 
   'أحصنت': [
           'أَحْصَنَتْ'], 
   'ولبثت': [
           'وَلَبِثْتَ'], 
   'لواقع': [
           'لَوَاقِعٌ'], 
   'فنقبوا': [
            'فَنَقَّبُوا'], 
   'الرضاعة': [
             'الرَّضَاعَةِ',
             'الرَّضَاعَةَ'], 
   'ذهبنا': [
           'ذَهَبْنَا'], 
   'أخواتكم': [
             'أَخَوَاتِكُمْ'], 
   'وأكثرهم': [
             'وَأَكْثَرُهُمْ',
             'وَأَكْثَرُهُمُ'], 
   'غاسق': [
          'غَاسِقٍ'], 
   'العابدون': [
              'الْعَابِدُونَ'], 
   'وافعلوا': [
             'وَافْعَلُوا'], 
   'عيدا': [
          'عِيدًا'], 
   'يمنى': [
          'يُمْنَى'], 
   'لجنبه': [
           'لِجَنْبِهِ'], 
   'نفعهما': [
            'نَفْعِهِمَا'], 
   'فعند': [
          'فَعِنْدَ'], 
   'تقاته': [
           'تُقَاتِهِ'], 
   'رأيتموه': [
             'رَأَيْتُمُوهُ'], 
   'وأذان': [
           'وَأَذَانٌ'], 
   'قومهم': [
           'قَوْمَهُمْ',
           'قَوْمِهِمْ'], 
   'بثي': [
         'بَثِّي'], 
   'واركعي': [
            'وَارْكَعِي'], 
   'أسلموا': [
            'أَسْلَمُوا',
            'أَسْلِمُوا'], 
   'فمرت': [
          'فَمَرَّتْ'], 
   'الأخسرون': [
              'الْأَخْسَرُونَ'], 
   'نودي': [
          'نُودِيَ'], 
   'حقيق': [
          'حَقِيقٌ'], 
   'وأخرجوا': [
             'وَأُخْرِجُوا'], 
   'أحضرت': [
           'أَحْضَرَتْ'], 
   'آثار': [
          'آثَارِ'], 
   'مرفقا': [
           'مِرْفَقًا'], 
   'كف': [
        'كَفَّ'], 
   'ولكم': [
          'وَلَكُمْ',
          'وَلَكُمُ'], 
   'ولكل': [
          'وَلِكُلِّ',
          'وَلِكُلٍّ'], 
   'ولكن': [
          'وَلَكِنْ',
          'وَلَكِنَّ',
          'وَلَكِنِ'], 
   'لآتينا': [
            'لَآتَيْنَا'], 
   'الجارية': [
             'الْجَارِيَةِ'], 
   'وحرموا': [
            'وَحَرَّمُوا'], 
   'كن': [
        'كُنْ',
        'كُنَّ'], 
   'بمنشرين': [
             'بِمُنْشَرِينَ'], 
   'فرجعناك': [
             'فَرَجَعْنَاكَ'], 
   'مثبورا': [
            'مَثْبُورًا'], 
   'وأزواجهم': [
              'وَأَزْوَاجِهِمْ',
              'وَأَزْوَاجُهُمْ',
              'وَأَزْوَاجَهُمْ'], 
   'والكتاب': [
             'وَالْكِتَابِ',
             'وَالْكِتَابَ'], 
   'كاتبا': [
           'كَاتِبًا'], 
   'المقابر': [
             'الْمَقَابِرَ'], 
   'سقناه': [
           'سُقْنَاهُ'], 
   'فعل': [
         'فَعَلَ',
         'فِعْلَ',
         'فُعِلَ'], 
   'فأتنا': [
           'فَأْتِنَا'], 
   'كألف': [
          'كَأَلْفِ'], 
   'أختها': [
           'أُخْتِهَا',
           'أُخْتَهَا'], 
   'اقضوا': [
           'اقْضُوا'], 
   'كثيرة': [
           'كَثِيرَةٌ',
           'كَثِيرَةً',
           'كَثِيرَةٍ'], 
   'ولنخرجنهم': [
               'وَلَنُخْرِجَنَّهُمْ'], 
   'وهبنا': [
           'وَهَبْنَا'], 
   'والسميع': [
             'وَالسَّمِيعِ'], 
   'قومها': [
           'قَوْمَهَا'], 
   'كثيرا': [
           'كَثِيرًا'], 
   'وتقطعون': [
             'وَتَقْطَعُونَ'], 
   'أتين': [
          'أَتَيْنَ'], 
   'ونزع': [
          'وَنَزَعَ'], 
   'فأهلكوا': [
             'فَأُهْلِكُوا'], 
   'تدعهم': [
           'تَدْعُهُمْ'], 
   'فئتين': [
           'فِئَتَيْنِ'], 
   'مكناهم': [
            'مَكَّنَّاهُمْ'], 
   'دعاكم': [
           'دَعَاكُمْ'], 
   'أرحام': [
           'أَرْحَامُ'], 
   'ليدبروا': [
             'لِيَدَّبَّرُوا'], 
   'اختلف': [
           'اخْتَلَفَ'], 
   'فورب': [
          'فَوَرَبِّ'], 
   'بأحسنها': [
             'بِأَحْسَنِهَا'], 
   'ماؤكم': [
           'مَاؤُكُمْ'], 
   'آتيت': [
          'آتَيْتَ'], 
   'ومغفرة': [
            'وَمَغْفِرَةٌ',
            'وَمَغْفِرَةً'], 
   'آتية': [
          'آتِيَةٌ'], 
   'يصب': [
         'يُصَبُّ'], 
   'ولأصلبنكم': [
               'وَلَأُصَلِّبَنَّكُمْ'], 
   'وعليهم': [
            'وَعَلَيْهِمْ'], 
   'والظالمون': [
               'وَالظَّالِمُونَ'], 
   'تدخلوا': [
            'تَدْخُلُوا'], 
   'يصر': [
         'يُصِرُّ'], 
   'علمناه': [
            'عَلَّمْنَاهُ'], 
   'ولينصرن': [
             'وَلَيَنْصُرَنَّ'], 
   'بسحره': [
           'بِسِحْرِهِ'], 
   'كالأنثى': [
             'كَالْأُنْثَى'], 
   'ملاقو': [
           'مُلَاقُو'], 
   'يلبسكم': [
            'يَلْبِسَكُمْ'], 
   'يصل': [
         'يَصِلُ'], 
   'للآكلين': [
             'لِلْآكِلِينَ'], 
   'آتيه': [
          'آتِيهِ'], 
   'ولنصبرن': [
             'وَلَنَصْبِرَنَّ'], 
   'آتيك': [
          'آتِيكَ'], 
   'وعليها': [
            'وَعَلَيْهَا'], 
   'وخر': [
         'وَخَرَّ'], 
   'وخذ': [
         'وَخُذْ'], 
   'عجبا': [
          'عَجَبًا'], 
   'النجم': [
           'النَّجْمُ'], 
   'عجبت': [
          'عَجِبْتَ'], 
   'زادوهم': [
            'زَادُوهُمْ'], 
   'انظروا': [
            'انْظُرُوا'], 
   'واسمعوا': [
             'وَاسْمَعُوا'], 
   'وتقطعوا': [
             'وَتُقَطِّعُوا',
             'وَتَقَطَّعُوا'], 
   'يتامى': [
           'يَتَامَى'], 
   'متجانف': [
            'مُتَجَانِفٍ'], 
   'افتدى': [
           'افْتَدَى'], 
   'اختلط': [
           'اخْتَلَطَ'], 
   'أرساها': [
            'أَرْسَاهَا'], 
   'تميلوا': [
            'تَمِيلُوا'], 
   'لتهتدوا': [
             'لِتَهْتَدُوا'], 
   'وبيع': [
          'وَبِيَعٌ'], 
   'تنتشرون': [
             'تَنْتَشِرُونَ'], 
   'يجليها': [
            'يُجَلِّيهَا'], 
   'يكلف': [
          'يُكَلِّفُ'], 
   'ولدينا': [
            'وَلَدَيْنَا'], 
   'أشر': [
         'أَشِرٌ',
         'أَشَرٌّ'], 
   'شاهد': [
          'شَاهِدٌ'], 
   'وبكلامي': [
             'وَبِكَلَامِي'], 
   'بذات': [
          'بِذَاتِ'], 
   'بغت': [
         'بَغَتْ'], 
   'ليأكلوا': [
             'لِيَأْكُلُوا'], 
   'يعتدون': [
            'يَعْتَدُونَ'], 
   'ليطهركم': [
             'لِيُطَهِّرَكُمْ'], 
   'مصفوفة': [
            'مَصْفُوفَةٍ',
            'مَصْفُوفَةٌ'], 
   'يبغيان': [
            'يَبْغِيَانِ'], 
   'لننظر': [
           'لِنَنْظُرَ'], 
   'ادعوا': [
           'ادْعُوا'], 
   'المنشآت': [
             'الْمُنْشَآتُ'], 
   'كدعاء': [
           'كَدُعَاءِ'], 
   'فاحشة': [
           'فَاحِشَةً'], 
   'ينفعونكم': [
              'يَنْفَعُونَكُمْ'], 
   'تستغيثون': [
              'تَسْتَغِيثُونَ'], 
   'البلاد': [
            'الْبِلَادِ'], 
   'فدمدم': [
           'فَدَمْدَمَ'], 
   'استسقى': [
            'اسْتَسْقَى'], 
   'تزداد': [
           'تَزْدَادُ'], 
   'توفته': [
           'تَوَفَّتْهُ'], 
   'بظلم': [
          'بِظُلْمٍ'], 
   'وأوبارها': [
              'وَأَوْبَارِهَا'], 
   'المساجد': [
             'الْمَسَاجِدِ',
             'الْمَسَاجِدَ'], 
   'يرجعون': [
            'يَرْجِعُونَ',
            'يُرْجَعُونَ'], 
   'البلاغ': [
            'الْبَلَاغُ'], 
   'استوقد': [
            'اسْتَوْقَدَ'], 
   'يجار': [
          'يُجَارُ'], 
   'ناسكوه': [
            'نَاسِكُوهُ'], 
   'ليخرجوك': [
             'لِيُخْرِجُوكَ'], 
   'اتخذوه': [
            'اتَّخَذُوهُ'], 
   'يرثون': [
           'يَرِثُونَ'], 
   'يستأذنك': [
             'يَسْتَأْذِنُكَ'], 
   'وزيادة': [
            'وَزِيَادَةٌ'], 
   'أصابتكم': [
             'أَصَابَتْكُمْ'], 
   'وأفوض': [
           'وَأُفَوِّضُ'], 
   'قبره': [
          'قَبْرِهِ'], 
   'ليأكلون': [
             'لَيَأْكُلُونَ'], 
   'فآتينا': [
            'فَآتَيْنَا'], 
   'فكف': [
         'فَكَفَّ'], 
   'وجزاهم': [
            'وَجَزَاهُمْ'], 
   'توفون': [
           'تُوَفَّوْنَ'], 
   'تحصوه': [
           'تُحْصُوهُ'], 
   'فصعق': [
          'فَصَعِقَ'], 
   'تتذكرون': [
             'تَتَذَكَّرُونَ'], 
   'تطئوها': [
            'تَطَئُوهَا'], 
   'والذاكرات': [
               'وَالذَّاكِرَاتِ'], 
   'كعرض': [
          'كَعَرْضِ'], 
   'ولئن': [
          'وَلَئِنْ',
          'وَلَئِنِ'], 
   'وقتلت': [
           'وَقَتَلْتَ'], 
   'ويضيق': [
           'وَيَضِيقُ'], 
   'اشتهت': [
           'اشْتَهَتْ'], 
   'فحبطت': [
           'فَحَبِطَتْ'], 
   'لينفق': [
           'لِيُنْفِقْ'], 
   'يحادون': [
            'يُحَادُّونَ'], 
   'يؤاخذكم': [
             'يُؤَاخِذُكُمْ',
             'يُؤَاخِذُكُمُ'], 
   'فينسخ': [
           'فَيَنْسَخُ'], 
   'الريح': [
           'الرِّيحَ',
           'الرِّيحُ',
           'الرِّيحِ'], 
   'يبعثون': [
            'يُبْعَثُونَ'], 
   'يصدعون': [
            'يُصَدَّعُونَ',
            'يَصَّدَّعُونَ'], 
   'خبالا': [
           'خَبَالًا'], 
   'يبدون': [
           'يُبْدُونَ'], 
   'أمثالهم': [
             'أَمْثَالَهُمْ'], 
   'لبسبيل': [
            'لَبِسَبِيلٍ'], 
   'الخلاق': [
            'الْخَلَّاقُ'], 
   'خصيما': [
           'خَصِيمًا'], 
   'تعدلوا': [
            'تَعْدِلُوا'], 
   'وقبيله': [
            'وَقَبِيلُهُ'], 
   'بغيظكم': [
            'بِغَيْظِكُمْ'], 
   'سينالهم': [
             'سَيَنَالُهُمْ'], 
   'ليقربونا': [
              'لِيُقَرِّبُونَا'], 
   'وتفريقا': [
             'وَتَفْرِيقًا'], 
   'أسألك': [
           'أَسْأَلَكَ'], 
   'يستعففن': [
             'يَسْتَعْفِفْنَ'], 
   'عهدهم': [
           'عَهْدَهُمْ',
           'عَهْدِهِمْ'], 
   'يبعثوا': [
            'يُبْعَثُوا'], 
   'أمركم': [
           'أَمْرِكُمْ',
           'أَمْرُكُمْ',
           'أَمْرَكُمْ',
           'أَمَرَكُمُ'], 
   'غليظا': [
           'غَلِيظًا'], 
   'مقترفون': [
             'مُقْتَرِفُونَ'], 
   'أيوب': [
          'أَيُّوبَ'], 
   'يجتبيك': [
            'يَجْتَبِيكَ'], 
   'أقدامنا': [
             'أَقْدَامَنَا',
             'أَقْدَامِنَا'], 
   'يأتل': [
          'يَأْتَلِ'], 
   'ووفيت': [
           'وَوُفِّيَتْ'], 
   'منهما': [
           'مِنْهُمَا'], 
   'تلهكم': [
           'تُلْهِكُمْ'], 
   'الرجال': [
            'الرِّجَالِ',
            'الرِّجَالَ',
            'الرِّجَالُ'], 
   'يلج': [
         'يَلِجُ',
         'يَلِجَ'], 
   'تطئوهم': [
            'تَطَئُوهُمْ'], 
   'الإنسان': [
             'الْإِنْسَانُ',
             'الْإِنْسَانَ',
             'الْإِنْسَانِ'], 
   'ويستفتونك': [
               'وَيَسْتَفْتُونَكَ'], 
   'فكر': [
         'فَكَّرَ'], 
   'قاتلوكم': [
             'قَاتَلُوكُمْ'], 
   'يتمطى': [
           'يَتَمَطَّى'], 
   'نطوي': [
          'نَطْوِي'], 
   'زاغ': [
         'زَاغَ'], 
   'صبرتم': [
           'صَبَرْتُمْ'], 
   'الواحد': [
            'الْوَاحِدُ',
            'الْوَاحِدِ'], 
   'مرد': [
         'مَرَدَّ',
         'مَرَدٍّ'], 
   'بزعمهم': [
            'بِزَعْمِهِمْ'], 
   'وشهبا': [
           'وَشُهُبًا'], 
   'وقائما': [
            'وَقَائِمًا'], 
   'وصدقت': [
           'وَصَدَّقَتْ'], 
   'جمعا': [
          'جَمْعًا'], 
   'خطيئاتكم': [
              'خَطِيئَاتِكُمْ'], 
   'تنسى': [
          'تُنْسَى',
          'تَنْسَى'], 
   'يتقي': [
          'يَتَّقِي'], 
   'أكمامها': [
             'أَكْمَامِهَا'], 
   'روحا': [
          'رُوحًا'], 
   'أنذرتكم': [
             'أَنْذَرْتُكُمْ'], 
   'الضر': [
          'الضُّرُّ',
          'الضُّرِّ',
          'الضُّرَّ'], 
   'يرتاب': [
           'يَرْتَابَ'], 
   'وحرمنا': [
            'وَحَرَّمْنَا'], 
   'لننصرنكم': [
              'لَنَنْصُرَنَّكُمْ'], 
   'حملنا': [
           'حَمَلْنَا',
           'حُمِّلْنَا'], 
   'أوحي': [
          'أُوحِيَ'], 
   'فنادوا': [
            'فَنَادَوْا'], 
   'يقرءون': [
            'يَقْرَءُونَ'], 
   'أوحى': [
          'أَوْحَى'], 
   'وكلهم': [
           'وَكُلُّهُمْ'], 
   'تبتئس': [
           'تَبْتَئِسْ'], 
   'مستمعون': [
             'مُسْتَمِعُونَ'], 
   'الجنات': [
            'الْجَنَّاتِ'], 
   'عبدتم': [
           'عَبَدْتُمْ'], 
   'جلاها': [
           'جَلَّاهَا'], 
   'فبصرك': [
           'فَبَصَرُكَ'], 
   'ضلالك': [
           'ضَلَالِكَ'], 
   'قدموا': [
           'قَدَّمُوا'], 
   'وأعتزلكم': [
              'وَأَعْتَزِلُكُمْ'], 
   'المقربين': [
              'الْمُقَرَّبِينَ'], 
   'يؤده': [
          'يُؤَدِّهِ'], 
   'فرش': [
         'فُرُشٍ'], 
   'أذهب': [
          'أَذْهَبَ'], 
   'نصليه': [
           'نُصْلِيهِ'], 
   'وتبين': [
           'وَتَبَيَّنَ'], 
   'ومساجد': [
            'وَمَسَاجِدُ'], 
   'توفيقي': [
            'تَوْفِيقِي'], 
   'الفراق': [
            'الْفِرَاقُ'], 
   'منسكا': [
           'مَنْسَكًا'], 
   'بعلها': [
           'بَعْلِهَا'], 
   'فشهادة': [
            'فَشَهَادَةُ'], 
   'للصابرين': [
              'لِلصَّابِرِينَ'], 
   'تقربا': [
           'تَقْرَبَا'], 
   'سيرحمهم': [
             'سَيَرْحَمُهُمُ'], 
   'والمسكنة': [
              'وَالْمَسْكَنَةُ'], 
   'وأوحي': [
           'وَأُوحِيَ'], 
   'وأوحى': [
           'وَأَوْحَى'], 
   'الغفار': [
            'الْغَفَّارُ',
            'الْغَفَّارِ'], 
   'وانحر': [
           'وَانْحَرْ'], 
   'فتفشلوا': [
             'فَتَفْشَلُوا'], 
   'أشهدتهم': [
             'أَشْهَدْتُهُمْ'], 
   'عوان': [
          'عَوَانٌ'], 
   'جمعه': [
          'جَمْعَهُ'], 
   'سفاهة': [
           'سَفَاهَةٍ',
           'سَفَاهَةٌ'], 
   'آنية': [
          'آنِيَةٍ'], 
   'فاحذروا': [
             'فَاحْذَرُوا'], 
   'وليست': [
           'وَلَيْسَتِ'], 
   'روحي': [
          'رُوحِي'], 
   'طير': [
         'طَيْرٍ'], 
   'بعزة': [
          'بِعِزَّةِ'], 
   'تنتهوا': [
            'تَنْتَهُوا'], 
   'بفاتنين': [
             'بِفَاتِنِينَ'], 
   'توليتم': [
            'تَوَلَّيْتُمْ'], 
   'فأوفوا': [
            'فَأَوْفُوا'], 
   'نريهم': [
           'نُرِيهِمْ'], 
   'يحدث': [
          'يُحْدِثُ'], 
   'والخامسة': [
              'وَالْخَامِسَةُ',
              'وَالْخَامِسَةَ'], 
   'يعصرون': [
            'يَعْصِرُونَ'], 
   'أطفأها': [
            'أَطْفَأَهَا'], 
   'تملكون': [
            'تَمْلِكُونَ'], 
   'اصرف': [
          'اصْرِفْ'], 
   'استكثرتم': [
              'اسْتَكْثَرْتُمْ'], 
   'ذكيتم': [
           'ذَكَّيْتُمْ'], 
   'لقرآن': [
           'لَقُرْآنٌ'], 
   'الباطل': [
            'الْبَاطِلُ',
            'الْبَاطِلَ',
            'الْبَاطِلِ'], 
   'أفواههم': [
             'أَفْوَاهِهِمْ'], 
   'بيدي': [
          'بِيَدَيَّ'], 
   'أهكذا': [
           'أَهَكَذَا'], 
   'ونتجاوز': [
             'وَنَتَجَاوَزُ'], 
   'سلهم': [
          'سَلْهُمْ'], 
   'مفصلات': [
            'مُفَصَّلَاتٍ'], 
   'زرتم': [
          'زُرْتُمُ'], 
   'قربى': [
          'قُرْبَى'], 
   'ابتغيت': [
            'ابْتَغَيْتَ'], 
   'يتركوا': [
            'يُتْرَكُوا'], 
   'كأنها': [
           'كَأَنَّهَا'], 
   'فسلموا': [
            'فَسَلِّمُوا'], 
   'أجري': [
          'أَجْرِيَ'], 
   'وآمنوا': [
            'وَآمَنُوا',
            'وَآمِنُوا'], 
   'أجره': [
          'أَجْرُهُ',
          'أَجْرَهُ'], 
   'إسلامكم': [
             'إِسْلَامَكُمْ'], 
   'للأوابين': [
              'لِلْأَوَّابِينَ'], 
   'فأثابكم': [
             'فَأَثَابَكُمْ'], 
   'وارتبتم': [
             'وَارْتَبْتُمْ'], 
   'تفعل': [
          'تَفْعَلْ'], 
   'قربة': [
          'قُرْبَةٌ'], 
   'طعمتم': [
           'طَعِمْتُمْ'], 
   'خاسئا': [
           'خَاسِئًا'], 
   'كأنهم': [
           'كَأَنَّهُمْ'], 
   'كأنهن': [
           'كَأَنَّهُنَّ'], 
   'آخذ': [
         'آخِذٌ'], 
   'إصلاح': [
           'إِصْلَاحٍ',
           'إِصْلَاحٌ'], 
   'أجرا': [
          'أَجْرًا'], 
   'أنزلناها': [
              'أَنْزَلْنَاهَا'], 
   'إطعام': [
           'إِطْعَامُ',
           'إِطْعَامٌ'], 
   'يحلون': [
           'يُحَلَّوْنَ',
           'يَحِلُّونَ'], 
   'بورك': [
          'بُورِكَ'], 
   'وألنا': [
           'وَأَلَنَّا'], 
   'إنهن': [
          'إِنَّهُنَّ'], 
   'الشراب': [
            'الشَّرَابُ'], 
   'واستمتعتم': [
               'وَاسْتَمْتَعْتُمْ'], 
   'المضطر': [
            'الْمُضْطَرَّ'], 
   'الميت': [
           'الْمَيِّتِ',
           'الْمَيِّتَ'], 
   'فصرهن': [
           'فَصُرْهُنَّ'], 
   'للمؤمنين': [
              'لِلْمُؤْمِنِينَ'], 
   'متراكبا': [
             'مُتَرَاكِبًا'], 
   'تغتسلوا': [
             'تَغْتَسِلُوا'], 
   'عاهد': [
          'عَاهَدَ'], 
   'عنه': [
         'عَنْهُ'], 
   'تفتني': [
           'تَفْتِنِّي'], 
   'عنك': [
         'عَنْكَ'], 
   'يخدعوك': [
            'يَخْدَعُوكَ'], 
   'ستدعون': [
            'سَتُدْعَوْنَ'], 
   'يخدعون': [
            'يَخْدَعُونَ'], 
   'سيئاته': [
            'سَيِّئَاتِهِ'], 
   'رجال': [
          'رِجَالٌ'], 
   'فاصدع': [
           'فَاصْدَعْ'], 
   'وألقينا': [
             'وَأَلْقَيْنَا'], 
   'فسخرنا': [
            'فَسَخَّرْنَا'], 
   'زيتها': [
           'زَيْتُهَا'], 
   'إخوانهم': [
             'إِخْوَانَهُمْ'], 
   'بادون': [
           'بَادُونَ'], 
   'سعوا': [
          'سَعَوْا'], 
   'أإذا': [
          'أَإِذَا'], 
   'بالخاطئة': [
              'بِالْخَاطِئَةِ'], 
   'أوف': [
         'أُوفِ'], 
   'أول': [
         'أَوَّلَ',
         'أَوَّلُ',
         'أَوَّلِ'], 
   'الشديد': [
            'الشَّدِيدِ',
            'الشَّدِيدَ'], 
   'طبتم': [
          'طِبْتُمْ'], 
   'مغيرا': [
           'مُغَيِّرًا'], 
   'أوى': [
         'أَوَى'], 
   'يتحاكموا': [
              'يَتَحَاكَمُوا'], 
   'غيابت': [
           'غَيَابَتِ'], 
   'فريا': [
          'فَرِيًّا'], 
   'إنني': [
          'إِنَّنِي'], 
   'مبتليكم': [
             'مُبْتَلِيكُمْ'], 
   'أبويكم': [
            'أَبَوَيْكُمْ'], 
   'وإنهما': [
            'وَإِنَّهُمَا'], 
   'فليعبدوا': [
              'فَلْيَعْبُدُوا'], 
   'فليقاتل': [
             'فَلْيُقَاتِلْ'], 
   'بالغوه': [
            'بَالِغُوهُ'], 
   'فريق': [
          'فَرِيقٌ',
          'فَرِيقٍ'], 
   'إننا': [
          'إِنَّنَا'], 
   'وليجة': [
           'وَلِيجَةً'], 
   'أرضي': [
          'أَرْضِي'], 
   'تبرأنا': [
            'تَبَرَّأْنَا'], 
   'واتل': [
          'وَاتْلُ'], 
   'ربحت': [
          'رَبِحَتْ'], 
   'قددا': [
          'قِدَدًا'], 
   'نهاكم': [
           'نَهَاكُمْ'], 
   'عنا': [
         'عَنَّا'], 
   'تتلو': [
          'تَتْلُو'], 
   'تتلى': [
          'تُتْلَى'], 
   'أكالون': [
            'أَكَّالُونَ'], 
   'يلقى': [
          'يُلْقَى'], 
   'يلقي': [
          'يُلْقِي'], 
   'عند': [
         'عِنْدَ',
         'عِنْدِ'], 
   'تلمزوا': [
            'تَلْمِزُوا'], 
   'سمع': [
         'سَمِعَ'], 
   'الجرز': [
           'الْجُرُزِ'], 
   'منذر': [
          'مُنْذِرٌ',
          'مُنْذِرُ'], 
   'ودمرنا': [
            'وَدَمَّرْنَا'], 
   'تمسكوهن': [
             'تُمْسِكُوهُنَّ'], 
   'يقتلن': [
           'يَقْتُلْنَ'], 
   'وورثه': [
           'وَوَرِثَهُ'], 
   'شاكرين': [
            'شَاكِرِينَ'], 
   'فاحكم': [
           'فَاحْكُمْ'], 
   'ونحشرهم': [
             'وَنَحْشُرُهُمْ'], 
   'ملء': [
         'مِلْءُ'], 
   'يقدر': [
          'يَقْدِرُ',
          'يُقَدِّرُ',
          'يَقْدِرَ'], 
   'فأمكن': [
           'فَأَمْكَنَ'], 
   'ملة': [
         'مِلَّةَ',
         'مِلَّةِ'], 
   'ملح': [
         'مِلْحٌ'], 
   'يستحسرون': [
              'يَسْتَحْسِرُونَ'], 
   'رق': [
        'رَقٍّ'], 
   'حذر': [
         'حَذَرَ'], 
   'سبحا': [
          'سَبْحًا'], 
   'نبأتكما': [
             'نَبَّأْتُكُمَا'], 
   'يبصروا': [
            'يَبْصُرُوا'], 
   'ويقبضون': [
             'وَيَقْبِضُونَ'], 
   'يبخل': [
          'يَبْخَلُ',
          'يَبْخَلْ'], 
   'أيها': [
          'أَيُّهَا'], 
   'أغوينا': [
            'أَغْوَيْنَا'], 
   'الأخرى': [
            'الْأُخْرَى'], 
   'كهشيم': [
           'كَهَشِيمِ'], 
   'كالتي': [
           'كَالَّتِي'], 
   'والقرآن': [
             'وَالْقُرْآنِ',
             'وَالْقُرْآنَ'], 
   'أردن': [
          'أَرَدْنَ'], 
   'لخسف': [
          'لَخَسَفَ'], 
   'سبح': [
         'سَبَّحَ',
         'سَبِّحِ'], 
   'فوقكم': [
           'فَوْقِكُمْ',
           'فَوْقَكُمْ',
           'فَوْقَكُمُ'], 
   'يعلموا': [
            'يَعْلَمُوا'], 
   'وبنات': [
           'وَبَنَاتِ',
           'وَبَنَاتُ',
           'وَبَنَاتٍ'], 
   'كلام': [
          'كَلَامَ'], 
   'أنفسهم': [
            'أَنْفُسَهُمْ',
            'أَنْفُسِهِمْ',
            'أَنْفُسُهُمْ'], 
   'أنفسهن': [
            'أَنْفُسِهِنَّ'], 
   'الطوفان': [
             'الطُّوفَانُ',
             'الطُّوفَانَ'], 
   'أيهم': [
          'أَيُّهُمْ'], 
   'يكسبون': [
            'يَكْسِبُونَ'], 
   'درجات': [
           'دَرَجَاتٍ',
           'دَرَجَاتٌ'], 
   'مستكبرون': [
              'مُسْتَكْبِرُونَ'], 
   'وأضلوا': [
            'وَأَضَلُّوا'], 
   'ويأت': [
          'وَيَأْتِ'], 
   'سبق': [
         'سَبَقَ'], 
   'يبخس': [
          'يَبْخَسْ'], 
   'سبل': [
         'سُبُلَ'], 
   'بملكنا': [
            'بِمَلْكِنَا'], 
   'السفينة': [
             'السَّفِينَةِ',
             'السَّفِينَةُ'], 
   'ينتظرون': [
             'يَنْتَظِرُونَ'], 
   'بالتقوى': [
             'بِالتَّقْوَى'], 
   'يعلمون': [
            'يَعْلَمُونَ',
            'يُعَلِّمُونَ'], 
   'ملك': [
         'مُلْكُ',
         'مَلَكٌ',
         'مُلْكِ',
         'مَلِكِ',
         'مَلِكٌ',
         'مَلَكُ',
         'مَلَكٍ'], 
   'وأصلحوا': [
             'وَأَصْلَحُوا',
             'وَأَصْلِحُوا'], 
   'يعدكم': [
           'يَعِدُكُمْ',
           'يَعِدُكُمُ',
           'يَعِدْكُمْ'], 
   'يوعون': [
           'يُوعُونَ'], 
   'أماذا': [
           'أَمَّاذَا'], 
   'أقطارها': [
             'أَقْطَارِهَا'], 
   'وعمروها': [
             'وَعَمَرُوهَا'], 
   'معدودات': [
             'مَعْدُودَاتٍ'], 
   'يقدم': [
          'يَقْدُمُ'], 
   'لارتاب': [
            'لَارْتَابَ'], 
   'يزجي': [
          'يُزْجِي'], 
   'رب': [
        'رَبِّ',
        'رَبُّ',
        'رَبَّ',
        'رَبٍّ'], 
   'أقبل': [
          'أَقْبِلْ'], 
   'يبصرون': [
            'يُبْصِرُونَ'], 
   'يوف': [
         'يُوَفَّ'], 
   'وأعطى': [
           'وَأَعْطَى'], 
   'يوق': [
         'يُوقَ'], 
   'يوم': [
         'يَوْمَ',
         'يَوْمِ',
         'يَوْمٍ',
         'يَوْمُ',
         'يَوْمٌ'], 
   'العباد': [
            'الْعِبَادِ'], 
   'كنا': [
         'كُنَّا'], 
   'يتدبرون': [
             'يَتَدَبَّرُونَ'], 
   'يتلاومون': [
              'يَتَلَاوَمُونَ'], 
   'بصيرة': [
           'بَصِيرَةٍ',
           'بَصِيرَةٌ'], 
   'المحضرين': [
              'الْمُحْضَرِينَ'], 
   'اذكر': [
          'اذْكُرْ'], 
   'وأجلب': [
           'وَأَجْلِبْ'], 
   'الفاصلين': [
              'الْفَاصِلِينَ'], 
   'يمرون': [
           'يَمُرُّونَ'], 
   'لأولاهم': [
             'لِأُولَاهُمْ'], 
   'كنز': [
         'كَنْزٌ'], 
   'أكاد': [
          'أَكَادُ'], 
   'محسنين': [
            'مُحْسِنِينَ'], 
   'بمصرخكم': [
             'بِمُصْرِخِكُمْ'], 
   'بالقعود': [
             'بِالْقُعُودِ'], 
   'ميثاقه': [
            'مِيثَاقِهِ'], 
   'يأخذوه': [
            'يَأْخُذُوهُ'], 
   'يأخذون': [
            'يَأْخُذُونَ'], 
   'عربا': [
          'عُرُبًا'], 
   'الواد': [
           'الْوَادِ'], 
   'كالعرجون': [
              'كَالْعُرْجُونِ'], 
   'وطعنوا': [
            'وَطَعَنُوا'], 
   'وخلق': [
          'وَخَلَقَ',
          'وَخُلِقَ'], 
   'اعتزلهم': [
             'اعْتَزَلَهُمْ'], 
   'لأقتلك': [
            'لِأَقْتُلَكَ'], 
   'العقيم': [
            'الْعَقِيمَ'], 
   'تذبحوا': [
            'تَذْبَحُوا'], 
   'يسبقونه': [
             'يَسْبِقُونَهُ'], 
   'أنزل': [
          'أُنْزِلَ',
          'أَنْزَلَ',
          'أَنْزِلْ'], 
   'الجنود': [
            'الْجُنُودِ'], 
   'تخشاه': [
           'تَخْشَاهُ'], 
   'أدلك': [
          'أَدُلُّكَ'], 
   'يؤيد': [
          'يُؤَيِّدُ'], 
   'ميثاقا': [
            'مِيثَاقًا'], 
   'أكان': [
          'أَكَانَ'], 
   'يأخذوا': [
            'يَأْخُذُوا'], 
   'يولون': [
           'يُوَلُّونَ'], 
   'ويحلفون': [
             'وَيَحْلِفُونَ'], 
   'يسبقونا': [
             'يَسْبِقُونَا'], 
   'لمبعوثون': [
              'لَمَبْعُوثُونَ'], 
   'هنيئا': [
           'هَنِيئًا'], 
   'قطعت': [
          'قُطِّعَتْ'], 
   'يوح': [
         'يُوحَ'], 
   'اجتثت': [
           'اجْتُثَّتْ'], 
   'يود': [
         'يَوَدُّ'], 
   'يئوده': [
           'يَئُودُهُ'], 
   'جلود': [
          'جُلُودِ',
          'جُلُودُ'], 
   'يحيى': [
          'يَحْيَى'], 
   'يحيي': [
          'يُحْيِي',
          'يُحْيِيَ'], 
   'برأسي': [
           'بِرَأْسِي'], 
   'للحواريين': [
               'لِلْحَوَارِيِّينَ'], 
   'يحيف': [
          'يَحِيفَ'], 
   'يحيك': [
          'يُحَيِّكَ'], 
   'بطونها': [
            'بُطُونِهَا'], 
   'منجوك': [
           'مُنَجُّوكَ'], 
   'الرياح': [
            'الرِّيَاحَ',
            'الرِّيَاحِ',
            'الرِّيَاحُ'], 
   'واستقم': [
            'وَاسْتَقِمْ'], 
   'يزرون': [
           'يَزِرُونَ'], 
   'مكاء': [
          'مُكَاءً'], 
   'سبيل': [
          'سَبِيلِ',
          'سَبِيلَ',
          'سَبِيلٍ',
          'سَبِيلُ',
          'سَبِيلٌ'], 
   'فيقولون': [
             'فَيَقُولُونَ'], 
   'منذرين': [
            'مُنْذِرِينَ'], 
   'تخافت': [
           'تُخَافِتْ'], 
   'نسخر': [
          'نَسْخَرُ'], 
   'خسرانا': [
            'خُسْرَانًا'], 
   'أعطى': [
          'أَعْطَى'], 
   'الأشهاد': [
             'الْأَشْهَادُ'], 
   'عقبيه': [
           'عَقِبَيْهِ'], 
   'نخلقكم': [
            'نَخْلُقْكُمْ'], 
   'وأخرجني': [
             'وَأَخْرِجْنِي'], 
   'يترددون': [
             'يَتَرَدَّدُونَ'], 
   'الراكعون': [
              'الرَّاكِعُونَ'], 
   'يفتننكم': [
             'يَفْتِنَنَّكُمُ'], 
   'ويسقى': [
           'وَيُسْقَى'], 
   'دعوتكما': [
             'دَعْوَتُكُمَا'], 
   'يأخذونها': [
              'يَأْخُذُونَهَا'], 
   'صنعوا': [
           'صَنَعُوا'], 
   'تصاحبني': [
             'تُصَاحِبْنِي'], 
   'ارتدوا': [
            'ارْتَدُّوا'], 
   'أجئتنا': [
            'أَجِئْتَنَا'], 
   'للطيبين': [
             'لِلطَّيِّبِينَ'], 
   'آلذكرين': [
             'آلذَّكَرَيْنِ'], 
   'يكيدون': [
            'يَكِيدُونَ'], 
   'وحفظا': [
           'وَحِفْظًا'], 
   'الأمانات': [
              'الْأَمَانَاتِ'], 
   'عدوهم': [
           'عَدُوِّهِمْ'], 
   'وتنشق': [
           'وَتَنْشَقُّ'], 
   'والغوا': [
            'وَالْغَوْا'], 
   'انتقمنا': [
             'انْتَقَمْنَا'], 
   'الأصنام': [
             'الْأَصْنَامَ'], 
   'بضر': [
         'بِضُرٍّ'], 
   'قاتل': [
          'قَاتَلَ'], 
   'للقتال': [
            'لِلْقِتَالِ'], 
   'تمسون': [
           'تُمْسُونَ'], 
   'يدافع': [
           'يُدَافِعُ'], 
   'فيقولوا': [
             'فَيَقُولُوا'], 
   'فادعوهم': [
             'فَادْعُوهُمْ'], 
   'مقعد': [
          'مَقْعَدِ'], 
   'يتبعون': [
            'يَتَّبِعُونَ',
            'يُتْبِعُونَ'], 
   'وامرأته': [
             'وَامْرَأَتُهُ'], 
   'وليبلي': [
            'وَلِيُبْلِيَ'], 
   'وامرأتي': [
             'وَامْرَأَتِي'], 
   'تنبتوا': [
            'تُنْبِتُوا'], 
   'ابني': [
          'ابْنِي',
          'ابْنَيْ'], 
   'وسيرت': [
           'وَسُيِّرَتِ'], 
   'كخيفتكم': [
             'كَخِيفَتِكُمْ'], 
   'بشرر': [
          'بِشَرَرٍ'], 
   'يشهدون': [
            'يَشْهَدُونَ'], 
   'مسرورا': [
            'مَسْرُورًا'], 
   'يستعتبون': [
              'يُسْتَعْتَبُونَ'], 
   'لأكيدن': [
            'لَأَكِيدَنَّ'], 
   'نطيع': [
          'نُطِيعُ'], 
   'مبينا': [
           'مُبِينًا'], 
   'أجنحة': [
           'أَجْنِحَةٍ'], 
   'ذاقا': [
          'ذَاقَا'], 
   'ألحقتم': [
            'أَلْحَقْتُمْ'], 
   'وأقسطوا': [
             'وَأَقْسِطُوا'], 
   'المنتظرين': [
               'الْمُنْتَظِرِينَ'], 
   'إياه': [
          'إِيَّاهُ'], 
   'بشرا': [
          'بَشَرًا',
          'بُشْرًا'], 
   'مبينة': [
           'مُبَيِّنَةٍ'], 
   'وتتقوا': [
            'وَتَتَّقُوا'], 
   'فتركه': [
           'فَتَرَكَهُ'], 
   'جنوبها': [
            'جُنُوبُهَا'], 
   'فملاقيه': [
             'فَمُلَاقِيهِ'], 
   'هضيم': [
          'هَضِيمٌ'], 
   'يهيج': [
          'يَهِيجُ'], 
   'لربها': [
           'لِرَبِّهَا'], 
   'فأصبح': [
           'فَأَصْبَحَ'], 
   'نقيم': [
          'نُقِيمُ'], 
   'لمبلسين': [
             'لَمُبْلِسِينَ'], 
   'شهدوا': [
           'شَهِدُوا'], 
   'نبات': [
          'نَبَاتُ',
          'نَبَاتَ',
          'نَبَاتٍ'], 
   'الأول': [
           'الْأَوَّلِ',
           'الْأَوَّلُ'], 
   'شركائي': [
            'شُرَكَائِيَ',
            'شُرَكَائِي'], 
   'نبأها': [
           'نَبَّأَهَا'], 
   'جنوبهم': [
            'جُنُوبِهِمْ',
            'جُنُوبُهُمْ'], 
   'أهواءهم': [
             'أَهْوَاءَهُمْ'], 
   'أخذتم': [
           'أَخَذْتُمْ'], 
   'ولأدخلنكم': [
               'وَلَأُدْخِلَنَّكُمْ'], 
   'فاستعصم': [
             'فَاسْتَعْصَمَ'], 
   'ميثاقهم': [
             'مِيثَاقَهُمْ'], 
   'عينا': [
          'عَيْنًا'], 
   'يعصينك': [
            'يَعْصِينَكَ'], 
   'لربهم': [
           'لِرَبِّهِمْ',
           'لِرَبِّهِمُ'], 
   'لأول': [
          'لِأَوَّلِ'], 
   'تخويفا': [
            'تَخْوِيفًا'], 
   'طردتهم': [
            'طَرَدْتُهُمْ'], 
   'حرثه': [
          'حَرْثِهِ'], 
   'فتثير': [
           'فَتُثِيرُ'], 
   'نقيض': [
          'نُقَيِّضْ'], 
   'تديرونها': [
              'تُدِيرُونَهَا'], 
   'ليغفر': [
           'لِيَغْفِرَ'], 
   'وفرحوا': [
            'وَفَرِحُوا'], 
   'فتصبحوا': [
             'فَتُصْبِحُوا'], 
   'يميز': [
          'يَمِيزَ'], 
   'الطامة': [
            'الطَّامَّةُ'], 
   'والنذر': [
            'وَالنُّذُرُ'], 
   'يستعتبوا': [
              'يَسْتَعْتِبُوا'], 
   'فعقر': [
          'فَعَقَرَ'], 
   'بشرى': [
          'بُشْرَى'], 
   'كأمثال': [
            'كَأَمْثَالِ'], 
   'بصاحبكم': [
             'بِصَاحِبِكُمْ'], 
   'عيسى': [
          'عِيسَى'], 
   'واقتلوهم': [
              'وَاقْتُلُوهُمْ'], 
   'لغائظون': [
             'لَغَائِظُونَ'], 
   'شهرا': [
          'شَهْرًا'], 
   'ويستخرجا': [
              'وَيَسْتَخْرِجَا'], 
   'زدني': [
          'زِدْنِي'], 
   'حقه': [
         'حَقَّهُ'], 
   'بعجل': [
          'بِعِجْلٍ'], 
   'وأدنى': [
           'وَأَدْنَى'], 
   'فتزل': [
          'فَتَزِلَّ'], 
   'فاذكروا': [
             'فَاذْكُرُوا'], 
   'رحيما': [
           'رَحِيمًا'], 
   'تفرق': [
          'تَفَرَّقَ'], 
   'يتذكر': [
           'يَتَذَكَّرُ'], 
   'المقربون': [
              'الْمُقَرَّبُونَ'], 
   'فاتبعها': [
             'فَاتَّبِعْهَا'], 
   'فتقول': [
           'فَتَقُولُ'], 
   'وأخرت': [
           'وَأَخَّرَتْ'], 
   'وأخرج': [
           'وَأَخْرَجَ'], 
   'بعلمه': [
           'بِعِلْمِهِ'], 
   'والأذى': [
            'وَالْأَذَى'], 
   'وازرة': [
           'وَازِرَةٌ'], 
   'فنسيهم': [
            'فَنَسِيَهُمْ'], 
   'يفعله': [
           'يَفْعَلْهُ'], 
   'تقشعر': [
           'تَقْشَعِرُّ'], 
   'المستعان': [
              'الْمُسْتَعَانُ'], 
   'عظاما': [
           'عِظَامًا'], 
   'يستعجل': [
            'يَسْتَعْجِلُ'], 
   'يستهزئ': [
            'يَسْتَهْزِئُ'], 
   'وأخرى': [
           'وَأُخْرَى'], 
   'فبشرناه': [
             'فَبَشَّرْنَاهُ'], 
   'المدثر': [
            'الْمُدَّثِّرُ'], 
   'رسلكم': [
           'رُسُلُكُمْ'], 
   'طلقها': [
           'طَلَّقَهَا'], 
   'بناها': [
           'بَنَاهَا'], 
   'وتهدي': [
           'وَتَهْدِي'], 
   'عظامه': [
           'عِظَامَهُ'], 
   'تطهيرا': [
            'تَطْهِيرًا'], 
   'مظلما': [
           'مُظْلِمًا'], 
   'وادخلوا': [
             'وَادْخُلُوا'], 
   'حقت': [
         'حَقَّتْ'], 
   'الذي': [
          'الَّذِي'], 
   'الذل': [
          'الذُّلِّ'], 
   'اشتراه': [
            'اشْتَرَاهُ'], 
   'حقا': [
         'حَقًّا'], 
   'للسلم': [
           'لِلسَّلْمِ'], 
   'كتبنا': [
           'كَتَبْنَا'], 
   'إخوتي': [
           'إِخْوَتِي'], 
   'لجلودهم': [
             'لِجُلُودِهِمْ'], 
   'منبثا': [
           'مُنْبَثًّا'], 
   'جيدها': [
           'جِيدِهَا'], 
   'نعجة': [
          'نَعْجَةٌ',
          'نَعْجَةً'], 
   'سباتا': [
           'سُبَاتًا'], 
   'تنذرهم': [
            'تُنْذِرْهُمْ'], 
   'صدقا': [
          'صِدْقًا'], 
   'الأمر': [
           'الْأَمْرِ',
           'الْأَمْرُ',
           'الْأَمْرَ'], 
   'جبال': [
          'جِبَالُ',
          'جِبَالٍ'], 
   'ورزقناهم': [
              'وَرَزَقْنَاهُمْ'], 
   'فانتظروا': [
              'فَانْتَظِرُوا'], 
   'نتقبل': [
           'نَتَقَبَّلُ'], 
   'لخبير': [
           'لَخَبِيرٌ'], 
   'الأمد': [
           'الْأَمَدُ'], 
   'تمنها': [
           'تَمُنُّهَا'], 
   'بربهم': [
           'بِرَبِّهِمْ'], 
   'أرداكم': [
            'أَرْدَاكُمْ'], 
   'ليقضي': [
           'لِيَقْضِيَ'], 
   'ليقضى': [
           'لِيُقْضَى'], 
   'رجلين': [
           'رَجُلَيْنِ',
           'رِجْلَيْنِ'], 
   'الفزع': [
           'الْفَزَعُ'], 
   'كلالة': [
           'كَلَالَةً'], 
   'غوينا': [
           'غَوَيْنَا'], 
   'مفصلا': [
           'مُفَصَّلًا'], 
   'ويصدون': [
            'وَيَصُدُّونَ'], 
   'لاستكثرت': [
              'لَاسْتَكْثَرْتُ'], 
   'قصصهم': [
           'قَصَصِهِمْ'], 
   'واستغفروه': [
               'وَاسْتَغْفِرُوهُ'], 
   'اصطفيناه': [
              'اصْطَفَيْنَاهُ'], 
   'فإنا': [
          'فَإِنَّا'], 
   'فتأكل': [
           'فَتَأْكُلُ'], 
   'فطور': [
          'فُطُورٍ'], 
   'نرفع': [
          'نَرْفَعُ'], 
   'مصباح': [
           'مِصْبَاحٌ'], 
   'فانقلبوا': [
              'فَانْقَلَبُوا'], 
   'وأسرحكن': [
             'وَأُسَرِّحْكُنَّ'], 
   'فإني': [
          'فَإِنِّي'], 
   'وجزاء': [
           'وَجَزَاءُ'], 
   'رحبت': [
          'رَحُبَتْ'], 
   'ليستخفوا': [
              'لِيَسْتَخْفُوا'], 
   'واستغفروا': [
               'وَاسْتَغْفِرُوا'], 
   'فإنك': [
          'فَإِنَّكَ'], 
   'ازدادوا': [
             'ازْدَادُوا'], 
   'فإنه': [
          'فَإِنَّهُ'], 
   'سبيلنا': [
            'سَبِيلَنَا'], 
   'رمزا': [
          'رَمْزًا'], 
   'بدين': [
          'بِدَيْنٍ'], 
   'يفترينه': [
             'يَفْتَرِينَهُ'], 
   'يذكر': [
          'يَذَّكَّرُ',
          'يَذْكُرُ',
          'يُذْكَرِ',
          'يُذْكَرُ',
          'يُذْكَرَ',
          'يَذَّكَّرَ'], 
   'اشدد': [
          'اشْدُدْ'], 
   'الأمي': [
           'الْأُمِّيِّ',
           'الْأُمِّيَّ'], 
   'لترضى': [
           'لِتَرْضَى'], 
   'يستخفون': [
             'يَسْتَخْفُونَ'], 
   'بثالث': [
           'بِثَالِثٍ'], 
   'زيد': [
         'زَيْدٌ'], 
   'الأمن': [
           'الْأَمْنِ',
           'الْأَمْنُ'], 
   'ويزدكم': [
            'وَيَزِدْكُمْ'], 
   'الأمل': [
           'الْأَمَلُ'], 
   'الأمم': [
           'الْأُمَمِ'], 
   'عاما': [
          'عَامًا'], 
   'الجدار': [
            'الْجِدَارُ'], 
   'بالملإ': [
            'بِالْمَلَإِ'], 
   'دماءكم': [
            'دِمَاءَكُمْ'], 
   'بقية': [
          'بَقِيَّةٍ'], 
   'حليم': [
          'حَلِيمٌ',
          'حَلِيمٍ'], 
   'ليشتروا': [
             'لِيَشْتَرُوا'], 
   'وعدها': [
           'وَعَدَهَا'], 
   'دار': [
         'دَارُ',
         'دَارَ',
         'دَارِ'], 
   'يتولهم': [
            'يَتَوَلَّهُمْ'], 
   'تلظى': [
          'تَلَظَّى'], 
   'فطفق': [
          'فَطَفِقَ'], 
   'الحج': [
          'الْحَجِّ',
          'الْحَجَّ',
          'الْحَجُّ'], 
   'الحب': [
          'الْحَبِّ'], 
   'عيناه': [
           'عَيْنَاهُ'], 
   'عينان': [
           'عَيْنَانِ'], 
   'عيناك': [
           'عَيْنَاكَ'], 
   'اطيرنا': [
            'اطَّيَّرْنَا'], 
   'تأمروننا': [
              'تَأْمُرُونَنَا'], 
   'أهدى': [
          'أَهْدَى'], 
   'بالغيب': [
            'بِالْغَيْبِ'], 
   'أثقالكم': [
             'أَثْقَالَكُمْ'], 
   'أهدك': [
          'أَهْدِكَ'], 
   'ولكنهم': [
            'وَلَكِنَّهُمْ'], 
   'مآبا': [
          'مَآبًا'], 
   'افترينا': [
             'افْتَرَيْنَا'], 
   'كثير': [
          'كَثِيرٍ',
          'كَثِيرٌ'], 
   'تكن': [
         'تَكُنْ',
         'تُكِنُّ'], 
   'الوسواس': [
             'الْوَسْوَاسِ'], 
   'لينذركم': [
             'لِيُنْذِرَكُمْ'], 
   'زد': [
        'زِدْ'], 
   'وكفى': [
          'وَكَفَى'], 
   'وكفر': [
          'وَكُفْرٌ',
          'وَكَفِّرْ',
          'وَكَفَرَ'], 
   'آتيناه': [
            'آتَيْنَاهُ'], 
   'بالساهرة': [
              'بِالسَّاهِرَةِ'], 
   'مغانم': [
           'مَغَانِمَ',
           'مَغَانِمُ'], 
   'بهيمة': [
           'بَهِيمَةِ',
           'بَهِيمَةُ'], 
   'يذهبوا': [
            'يَذْهَبُوا'], 
   'يفتر': [
          'يُفَتَّرُ'], 
   'فسيقولون': [
              'فَسَيَقُولُونَ'], 
   'الأنبياء': [
              'الْأَنْبِيَاءَ'], 
   'ونمارق': [
            'وَنَمَارِقُ'], 
   'والذي': [
           'وَالَّذِي'], 
   'ينبوعا': [
            'يَنْبُوعًا'], 
   'عامل': [
          'عَامِلٌ',
          'عَامِلٍ'], 
   'حلية': [
          'حِلْيَةً',
          'حِلْيَةٍ'], 
   'تسليما': [
            'تَسْلِيمًا'], 
   'جاءكم': [
           'جَاءَكُمْ',
           'جَاءَكُمُ'], 
   'وعدهم': [
           'وَعِدْهُمْ',
           'وَعَدَّهُمْ'], 
   'جزءا': [
          'جُزْءًا'], 
   'فظلت': [
          'فَظَلَّتْ'], 
   'الحي': [
          'الْحَيِّ',
          'الْحَيَّ',
          'الْحَيُّ'], 
   'تق': [
        'تَقِ'], 
   'شاكرون': [
            'شَاكِرُونَ'], 
   'إنسيا': [
           'إِنْسِيًّا'], 
   'نجني': [
          'نَجِّنِي'], 
   'منزل': [
          'مُنَزَّلٌ'], 
   'الحق': [
          'الْحَقُّ',
          'الْحَقِّ',
          'الْحَقَّ'], 
   'اقتحم': [
           'اقْتَحَمَ'], 
   'الكاذبين': [
              'الْكَاذِبِينَ'], 
   'يطبع': [
          'يَطْبَعُ'], 
   'وبوأكم': [
            'وَبَوَّأَكُمْ'], 
   'وجاوزنا': [
             'وَجَاوَزْنَا'], 
   'ينذرون': [
            'يُنْذَرُونَ'], 
   'حولا': [
          'حِوَلًا'], 
   'فكشفنا': [
            'فَكَشَفْنَا'], 
   'البالغة': [
             'الْبَالِغَةُ'], 
   'تعتدوها': [
             'تَعْتَدُوهَا'], 
   'مرقدنا': [
            'مَرْقَدِنَا'], 
   'السبل': [
           'السُّبُلَ'], 
   'الفواحش': [
             'الْفَوَاحِشَ'], 
   'منع': [
         'مَنَعَ',
         'مُنِعَ'], 
   'يهدي': [
          'يَهْدِي',
          'يَهِدِّي'], 
   'أتتكم': [
           'أَتَتْكُمُ'], 
   'والآخرة': [
             'وَالْآخِرَةِ',
             'وَالْآخِرَةُ',
             'وَالْآخِرَةَ'], 
   'أندادا': [
            'أَنْدَادًا'], 
   'أيما': [
          'أَيَّمَا'], 
   'تقولوا': [
            'تَقُولُوا'], 
   'يمسسهم': [
            'يَمْسَسْهُمْ'], 
   'ذوا': [
         'ذَوَا'], 
   'سيطوقون': [
             'سَيُطَوَّقُونَ'], 
   'أرحم': [
          'أَرْحَمُ'], 
   'لتنبئنهم': [
              'لَتُنَبِّئَنَّهُمْ'], 
   'أدنى': [
          'أَدْنَى'], 
   'الأثيم': [
            'الْأَثِيمِ'], 
   'حزب': [
         'حِزْبَ',
         'حِزْبُ',
         'حِزْبٍ'], 
   'مغاضبا': [
            'مُغَاضِبًا'], 
   'أورثوا': [
            'أُورِثُوا'], 
   'وظهورهم': [
             'وَظُهُورُهُمْ'], 
   'وينذرونكم': [
               'وَيُنْذِرُونَكُمْ'], 
   'منا': [
         'مِنَّا',
         'مَنًّا'], 
   'فانسلخ': [
            'فَانْسَلَخَ'], 
   'تؤفكون': [
            'تُؤْفَكُونَ'], 
   'تقولون': [
            'تَقُولُونَ'], 
   'مستأنسين': [
              'مُسْتَأْنِسِينَ'], 
   'لمدركون': [
             'لَمُدْرَكُونَ'], 
   'ذنوبنا': [
            'ذُنُوبَنَا'], 
   'مني': [
         'مِنِّي',
         'مَنِيٍّ'], 
   'أوسط': [
          'أَوْسَطِ'], 
   'ثاويا': [
           'ثَاوِيًا'], 
   'خردل': [
          'خَرْدَلٍ'], 
   'يزيدهم': [
            'يَزِيدُهُمْ'], 
   'تنتصران': [
             'تَنْتَصِرَانِ'], 
   'تأمرين': [
            'تَأْمُرِينَ'], 
   'وأوصاني': [
             'وَأَوْصَانِي'], 
   'منه': [
         'مِنْهُ'], 
   'السبع': [
           'السَّبْعِ',
           'السَّبْعُ',
           'السَّبُعُ'], 
   'بمغفرة': [
            'بِمَغْفِرَةٍ'], 
   'نتنزل': [
           'نَتَنَزَّلُ'], 
   'تسيمون': [
            'تُسِيمُونَ'], 
   'وقطعناهم': [
              'وَقَطَّعْنَاهُمْ',
              'وَقَطَّعْنَاهُمُ'], 
   'بقدرها': [
            'بِقَدَرِهَا'], 
   'جاءتهم': [
            'جَاءَتْهُمْ',
            'جَاءَتْهُمُ'], 
   'مهين': [
          'مُهِينٌ',
          'مَهِينٍ',
          'مَهِينٌ'], 
   'تجادلك': [
            'تُجَادِلُكَ'], 
   'السبت': [
           'السَّبْتِ',
           'السَّبْتُ'], 
   'وتبغونها': [
              'وَتَبْغُونَهَا'], 
   'تخالطوهم': [
              'تُخَالِطُوهُمْ'], 
   'يخلفون': [
            'يَخْلُفُونَ'], 
   'حصحص': [
          'حَصْحَصَ'], 
   'كلا': [
         'كَلَّا',
         'كُلًّا'], 
   'يرجموكم': [
             'يَرْجُمُوكُمْ'], 
   'يحور': [
          'يَحُورَ'], 
   'يبتغون': [
            'يَبْتَغُونَ'], 
   'أحدكما': [
            'أَحَدُكُمَا'], 
   'مخلدون': [
            'مُخَلَّدُونَ'], 
   'لأصحاب': [
            'لِأَصْحَابِ'], 
   'ويبقى': [
           'وَيَبْقَى'], 
   'وأمتعتكم': [
              'وَأَمْتِعَتِكُمْ'], 
   'عيلة': [
          'عَيْلَةً'], 
   'زمهريرا': [
             'زَمْهَرِيرًا'], 
   'بظاهر': [
           'بِظَاهِرٍ'], 
   'والحساب': [
             'وَالْحِسَابَ'], 
   'تخافونهم': [
              'تَخَافُونَهُمْ'], 
   'اجتباكم': [
             'اجْتَبَاكُمْ'], 
   'الخبيث': [
            'الْخَبِيثَ',
            'الْخَبِيثِ',
            'الْخَبِيثُ'], 
   'لعنتي': [
           'لَعْنَتِي'], 
   'يكرههن': [
            'يُكْرِهْهُنَّ'], 
   'الخبير': [
            'الْخَبِيرُ'], 
   'تأخذكم': [
            'تَأْخُذْكُمْ'], 
   'تظلموا': [
            'تَظْلِمُوا'], 
   'ولأدخلنهم': [
               'وَلَأُدْخِلَنَّهُمْ'], 
   'المثلات': [
             'الْمَثُلَاتُ'], 
   'مريئا': [
           'مَرِيئًا'], 
   'يطع': [
         'يُطِعِ'], 
   'أنذر': [
          'أُنْذِرَ',
          'أَنْذِرْ',
          'أَنْذِرِ',
          'أَنْذَرَ'], 
   'ناصرا': [
           'نَاصِرًا'], 
   'أنعمنا': [
            'أَنْعَمْنَا'], 
   'تفاوت': [
           'تَفَاوُتٍ'], 
   'ويتبع': [
           'وَيَتَّبِعْ',
           'وَيَتَّبِعُ'], 
   'مردنا': [
           'مَرَدَّنَا'], 
   'يكلمنا': [
            'يُكَلِّمُنَا'], 
   'دولة': [
          'دُولَةً'], 
   'نعلن': [
          'نُعْلِنُ'], 
   'نعلم': [
          'نَعْلَمُ',
          'نَعْلَمَ'], 
   'أريكم': [
           'أُرِيكُمْ'], 
   'فليغيرن': [
             'فَلَيُغَيِّرُنَّ'], 
   'فنسوا': [
           'فَنَسُوا'], 
   'تظلمون': [
            'تُظْلَمُونَ',
            'تَظْلِمُونَ'], 
   'ففسق': [
          'فَفَسَقَ'], 
   'ويطهركم': [
             'وَيُطَهِّرَكُمْ'], 
   'كلم': [
         'كُلِّمَ',
         'كَلَّمَ'], 
   'كله': [
         'كُلِّهِ',
         'كُلُّهُ',
         'كُلَّهُ'], 
   'لعنهم': [
           'لَعَنَهُمُ'], 
   'للصلاة': [
            'لِلصَّلَاةِ'], 
   'قطعا': [
          'قِطَعًا'], 
   'مستكبرا': [
             'مُسْتَكْبِرًا'], 
   'الأغنياء': [
              'الْأَغْنِيَاءِ'], 
   'بآخرين': [
            'بِآخَرِينَ'], 
   'وباءوا': [
            'وَبَاءُوا'], 
   'غضبي': [
          'غَضَبِي'], 
   'شكر': [
         'شَكَرَ'], 
   'وغير': [
          'وَغَيْرَ',
          'وَغَيْرِ',
          'وَغَيْرُ'], 
   'الأعلى': [
            'الْأَعْلَى'], 
   'يحول': [
          'يَحُولُ'], 
   'يلتقيان': [
             'يَلْتَقِيَانِ'], 
   'أفبعذابنا': [
               'أَفَبِعَذَابِنَا'], 
   'مسطورا': [
            'مَسْطُورًا'], 
   'نقصصهم': [
            'نَقْصُصْهُمْ'], 
   'تنزيلا': [
            'تَنْزِيلًا'], 
   'ويعلم': [
           'وَيَعْلَمُ',
           'وَيَعْلَمَ'], 
   'ترجعونها': [
              'تَرْجِعُونَهَا'], 
   'تسر': [
         'تَسُرُّ'], 
   'ركبانا': [
            'رُكْبَانًا'], 
   'حميما': [
           'حَمِيمًا'], 
   'فأهلكنا': [
             'فَأَهْلَكْنَا'], 
   'فتستجيبون': [
               'فَتَسْتَجِيبُونَ'], 
   'دماؤها': [
            'دِمَاؤُهَا'], 
   'زينتكم': [
            'زِينَتَكُمْ'], 
   'خائبين': [
            'خَائِبِينَ'], 
   'صديق': [
          'صَدِيقٍ'], 
   'بثمره': [
           'بِثَمَرِهِ'], 
   'لرسول': [
           'لِرَسُولٍ',
           'لَرَسُولُ'], 
   'مقربة': [
           'مَقْرَبَةٍ'], 
   'الموتى': [
            'الْمَوْتَى'], 
   'وتصدق': [
           'وَتَصَدَّقْ'], 
   'وجه': [
         'وَجْهِ',
         'وَجْهُ',
         'وَجْهَ'], 
   'الصور': [
           'الصُّورِ'], 
   'علمهم': [
           'عِلْمُهُمْ'], 
   'برأس': [
          'بِرَأْسِ'], 
   'وسعيرا': [
            'وَسَعِيرًا'], 
   'أخرجك': [
           'أَخْرَجَكَ'], 
   'الصفح': [
           'الصَّفْحَ'], 
   'توفتهم': [
            'تَوَفَّتْهُمُ'], 
   'فوقه': [
          'فَوْقِهِ'], 
   'نصيبهم': [
            'نَصِيبَهُمْ',
            'نَصِيبُهُمْ'], 
   'المتصدقين': [
               'الْمُتَصَدِّقِينَ'], 
   'ناصبة': [
           'نَاصِبَةٌ'], 
   'موعد': [
          'مَوْعِدٌ'], 
   'كاذبا': [
           'كَاذِبًا'], 
   'وينفقوا': [
             'وَيُنْفِقُوا'], 
   'نافلة': [
           'نَافِلَةً'], 
   'سلككم': [
           'سَلَكَكُمْ'], 
   'فرقوا': [
           'فَرَّقُوا'], 
   'تردن': [
          'تُرِدْنَ'], 
   'ظلالها': [
            'ظِلَالُهَا'], 
   'لأن': [
         'لِأَنْ'], 
   'أصدق': [
          'أَصْدَقُ'], 
   'طائفة': [
           'طَائِفَةٌ',
           'طَائِفَةً',
           'طَائِفَةٍ'], 
   'أعجب': [
          'أَعْجَبَ'], 
   'جئناك': [
           'جِئْنَاكَ'], 
   'وهي': [
         'وَهِيَ'], 
   'والقانتين': [
               'وَالْقَانِتِينَ'], 
   'وهو': [
         'وَهُوَ'], 
   'البدو': [
           'الْبَدْوِ'], 
   'وهن': [
         'وَهْنٍ',
         'وَهَنَ'], 
   'أنت': [
         'أَنْتَ'], 
   'وهل': [
         'وَهَلْ'], 
   'وهم': [
         'وَهُمْ',
         'وَهَمَّ'], 
   'تغيض': [
          'تَغِيضُ'], 
   'وغرتهم': [
            'وَغَرَّتْهُمُ'], 
   'يحشروا': [
            'يُحْشَرُوا'], 
   'مريد': [
          'مَرِيدٍ'], 
   'صديد': [
          'صَدِيدٍ'], 
   'التماثيل': [
              'التَّمَاثِيلُ'], 
   'عبدين': [
           'عَبْدَيْنِ'], 
   'مساكن': [
           'مَسَاكِنِ'], 
   'وجد': [
         'وَجَدَ',
         'وُجِدَ'], 
   'والسارق': [
             'وَالسَّارِقُ'], 
   'ونمنعكم': [
             'وَنَمْنَعْكُمْ'], 
   'عربي': [
          'عَرَبِيٍّ',
          'عَرَبِيٌّ'], 
   'يسعى': [
          'يَسْعَى'], 
   'لزاما': [
           'لِزَامًا'], 
   'إنسان': [
           'إِنْسَانٍ'], 
   'علمها': [
           'عِلْمُهَا'], 
   'مهلكوها': [
             'مُهْلِكُوهَا'], 
   'جنود': [
          'جُنُودُ',
          'جُنُودَ',
          'جُنُودٌ'], 
   'بعرشها': [
            'بِعَرْشِهَا'], 
   'بلاغا': [
           'بَلَاغًا'], 
   'أهواء': [
           'أَهْوَاءَ'], 
   'ليطمئن': [
            'لِيَطْمَئِنَّ'], 
   'ارجعون': [
            'ارْجِعُونِ'], 
   'والسلوى': [
             'وَالسَّلْوَى'], 
   'وادع': [
          'وَادْعُ'], 
   'وأبرئ': [
           'وَأُبْرِئُ'], 
   'تذكر': [
          'تَذْكُرُ',
          'تَذَكَّرَ'], 
   'رسلا': [
          'رُسُلًا'], 
   'الأرض': [
           'الْأَرْضِ',
           'الْأَرْضَ',
           'الْأَرْضُ'], 
   'تريدون': [
            'تُرِيدُونَ'], 
   'لخرجنا': [
            'لَخَرَجْنَا'], 
   'الصدفين': [
             'الصَّدَفَيْنِ'], 
   'خشوعا': [
           'خُشُوعًا'], 
   'والمسيح': [
             'وَالْمَسِيحَ'], 
   'خطيئة': [
           'خَطِيئَةً'], 
   'تخزنا': [
           'تُخْزِنَا'], 
   'سمعا': [
          'سَمْعًا'], 
   'أتحدثونهم': [
               'أَتُحَدِّثُونَهُمْ'], 
   'سمعت': [
          'سَمِعَتْ'], 
   'لبيت': [
          'لَبَيْتُ'], 
   'ها': [
        'هَا'], 
   'مختلفا': [
            'مُخْتَلِفًا'], 
   'تود': [
         'تَوَدُّ'], 
   'عصوني': [
           'عَصَوْنِي'], 
   'هب': [
        'هَبْ'], 
   'وعلامات': [
             'وَعَلَامَاتٍ'], 
   'العهد': [
           'الْعَهْدُ',
           'الْعَهْدَ'], 
   'ليطلعكم': [
             'لِيُطْلِعَكُمْ'], 
   'سمعه': [
          'سَمْعِهِ',
          'سَمِعَهُ'], 
   'عنتم': [
          'عَنِتُّمْ'], 
   'لمنقلبون': [
              'لَمُنْقَلِبُونَ'], 
   'التائبون': [
              'التَّائِبُونَ'], 
   'خليلا': [
           'خَلِيلًا'], 
   'تخزني': [
           'تُخْزِنِي'], 
   'لكفور': [
           'لَكَفُورٌ'], 
   'أنفسكم': [
            'أَنْفُسَكُمْ',
            'أَنْفُسِكُمْ',
            'أَنْفُسُكُمْ',
            'أَنْفُسِكُمُ',
            'أَنْفُسُكُمُ',
            'أَنْفُسَكُمُ'], 
   'هم': [
        'هُمْ',
        'هُمُ',
        'هَمَّ'], 
   'هل': [
        'هَلْ',
        'هَلِ'], 
   'داوود': [
           'دَاوُودَ',
           'دَاوُودُ'], 
   'ثلاثة': [
           'ثَلَاثَةَ',
           'ثَلَاثَةِ',
           'ثَلَاثَةٍ',
           'ثَلَاثَةٌ',
           'ثَلَاثَةُ',
           'ثَلَاثَةً'], 
   'ائذن': [
          'ائْذَنْ'], 
   'هي': [
        'هِيَ'], 
   'المعروف': [
             'الْمَعْرُوفِ'], 
   'هو': [
        'هُوَ'], 
   'رسلي': [
          'رُسُلِي'], 
   'تلكما': [
           'تِلْكُمَا'], 
   'متربص': [
           'مُتَرَبِّصٌ'], 
   'فتيلا': [
           'فَتِيلًا'], 
   'ارجعوا': [
            'ارْجِعُوا'], 
   'شغل': [
         'شُغُلٍ'], 
   'هدي': [
         'هُدِيَ'], 
   'رسله': [
          'رُسُلَهُ',
          'رُسُلِهِ'], 
   'والخنازير': [
               'وَالْخَنَازِيرَ'], 
   'جزيناهم': [
             'جَزَيْنَاهُمْ'], 
   'فافعلوا': [
             'فَافْعَلُوا'], 
   'نحن': [
         'نَحْنُ'], 
   'فتلك': [
          'فَتِلْكَ'], 
   'اهتزت': [
           'اهْتَزَّتْ'], 
   'خرجن': [
          'خَرَجْنَ'], 
   'وللآخرة': [
             'وَلَلْآخِرَةُ'], 
   'بعدت': [
          'بَعِدَتْ',
          'بَعُدَتْ'], 
   'تبلغ': [
          'تَبْلُغَ'], 
   'بوالديه': [
             'بِوَالِدَيْهِ'], 
   'العظيم': [
            'الْعَظِيمِ',
            'الْعَظِيمُ',
            'الْعَظِيمَ'], 
   'مغلولة': [
            'مَغْلُولَةٌ',
            'مَغْلُولَةً'], 
   'يلق': [
         'يَلْقَ'], 
   'تبيانا': [
            'تِبْيَانًا'], 
   'يطفئوا': [
            'يُطْفِئُوا'], 
   'لعجل': [
          'لَعَجَّلَ'], 
   'بهدية': [
           'بِهَدِيَّةٍ'], 
   'أني': [
         'أَنِّي'], 
   'يئوسا': [
           'يَئُوسًا'], 
   'يخرصون': [
            'يَخْرُصُونَ'], 
   'وأعز': [
          'وَأَعَزُّ'], 
   'لحكم': [
          'لِحُكْمِ'], 
   'ذهبا': [
          'ذَهَبًا'], 
   'والصابرين': [
               'وَالصَّابِرِينَ'], 
   'فاستخف': [
            'فَاسْتَخَفَّ'], 
   'فوقها': [
           'فَوْقِهَا',
           'فَوْقَهَا'], 
   'ذهبت': [
          'ذَهَبَتْ'], 
   'حسرة': [
          'حَسْرَةً'], 
   'ضامر': [
          'ضَامِرٍ'], 
   'أدوا': [
          'أَدُّوا'], 
   'عاقبتم': [
            'عَاقَبْتُمْ'], 
   'الطين': [
           'الطِّينِ'], 
   'أعجبك': [
           'أَعْجَبَكَ'], 
   'عزين': [
          'عِزِينَ'], 
   'واتبعوا': [
             'وَاتَّبَعُوا',
             'وَاتَّبِعُوا'], 
   'كونوا': [
           'كُونُوا'], 
   'أورثتموها': [
               'أُورِثْتُمُوهَا'], 
   'الخبيثات': [
              'الْخَبِيثَاتُ'], 
   'نصرنا': [
           'نَصْرُنَا'], 
   'سافلين': [
            'سَافِلِينَ'], 
   'الطير': [
           'الطَّيْرِ',
           'الطَّيْرُ',
           'الطَّيْرَ'], 
   'فوقهن': [
           'فَوْقِهِنَّ'], 
   'فوقهم': [
           'فَوْقِهِمْ',
           'فَوْقَهُمْ',
           'فَوْقَهُمُ'], 
   'أشقاها': [
            'أَشْقَاهَا'], 
   'يلوون': [
           'يَلْوُونَ'], 
   'شهودا': [
           'شُهُودًا'], 
   'الأخدود': [
             'الْأُخْدُودِ'], 
   'يعتصم': [
           'يَعْتَصِمْ'], 
   'واتبعوه': [
             'وَاتَّبِعُوهُ'], 
   'واتبعون': [
             'وَاتَّبِعُونِ'], 
   'شرعا': [
          'شُرَّعًا'], 
   'خلقتني': [
            'خَلَقْتَنِي'], 
   'فسيكفيكهم': [
               'فَسَيَكْفِيكَهُمُ'], 
   'الطيب': [
           'الطَّيِّبِ',
           'الطَّيِّبُ'], 
   'نعيم': [
          'نَعِيمٍ',
          'نَعِيمٌ'], 
   'ليبلوكم': [
             'لِيَبْلُوَكُمْ'], 
   'يلد': [
         'يَلِدْ'], 
   'أو': [
        'أَوْ',
        'أَوِ'], 
   'الميعاد': [
             'الْمِيعَادَ',
             'الْمِيعَادِ'], 
   'مثواكم': [
            'مَثْوَاكُمْ'], 
   'الطاغوت': [
             'الطَّاغُوتَ',
             'الطَّاغُوتِ',
             'الطَّاغُوتُ'], 
   'أك': [
        'أَكُ'], 
   'أصابت': [
           'أَصَابَتْ'], 
   'أف': [
        'أُفٍّ'], 
   'أن': [
        'أَنْ',
        'أَنَّ',
        'أَنِ'], 
   'أم': [
        'أَمْ',
        'أَمِ',
        'أُمَّ',
        'أُمِّ',
        'أُمُّ'], 
   'وروح': [
          'وَرُوحٌ'], 
   'نقول': [
          'نَقُولُ',
          'نَقُولَ'], 
   'براءة': [
           'بَرَاءَةٌ'], 
   'أأرباب': [
            'أَأَرْبَابٌ'], 
   'وصابروا': [
             'وَصَابِرُوا'], 
   'ممدود': [
           'مَمْدُودٍ'], 
   'شهابا': [
           'شِهَابًا'], 
   'فتكن': [
          'فَتَكُنْ'], 
   'ويضرب': [
           'وَيَضْرِبُ'], 
   'ونفاقا': [
            'وَنِفَاقًا'], 
   'ويهلك': [
           'وَيُهْلِكَ'], 
   'أخرج': [
          'أَخْرَجَ',
          'أُخْرَجُ',
          'أُخْرَجَ',
          'أَخْرِجْ'], 
   'مؤمنات': [
            'مُؤْمِنَاتٍ',
            'مُؤْمِنَاتٌ'], 
   'البطشة': [
            'الْبَطْشَةَ'], 
   'أمثلهم': [
            'أَمْثَلُهُمْ'], 
   'فرقنا': [
           'فَرَقْنَا'], 
   'يسكن': [
          'يُسْكِنِ'], 
   'بسيماهم': [
             'بِسِيمَاهُمْ'], 
   'يريدوا': [
            'يُرِيدُوا'], 
   'لقضي': [
          'لَقُضِيَ'], 
   'فليرتقوا': [
              'فَلْيَرْتَقُوا'], 
   'فاستمع': [
            'فَاسْتَمِعْ'], 
   'يرد': [
         'يُرَدُّ',
         'يُرِدْ',
         'يُرِدِ'], 
   'نخرة': [
          'نَخِرَةً'], 
   'المتكبرين': [
               'الْمُتَكَبِّرِينَ'], 
   'يناد': [
          'يُنَادِ'], 
   'نخرج': [
          'نُخْرِجُ'], 
   'وأبا': [
          'وَأَبًّا'], 
   'وآل': [
         'وَآلَ',
         'وَآلُ'], 
   'الأوتاد': [
             'الْأَوْتَادِ'], 
   'متين': [
          'مَتِينٌ'], 
   'لعب': [
         'لَعِبٌ'], 
   'يفسدون': [
            'يُفْسِدُونَ'], 
   'صديقكم': [
            'صَدِيقِكُمْ'], 
   'نؤثرك': [
           'نُؤْثِرَكَ'], 
   'وعليكم': [
            'وَعَلَيْكُمْ'], 
   'الهالكين': [
              'الْهَالِكِينَ'], 
   'قالتا': [
           'قَالَتَا'], 
   'السيارة': [
             'السَّيَّارَةِ'], 
   'بالتوراة': [
              'بِالتَّوْرَاةِ'], 
   'وأبى': [
          'وَأَبَى'], 
   'يرى': [
         'يَرَى',
         'يُرَى'], 
   'ينهاهم': [
            'يَنْهَاهُمُ'], 
   'يره': [
         'يَرَهُ'], 
   'يرم': [
         'يَرْمِ'], 
   'وأخذناهم': [
              'وَأَخَذْنَاهُمْ'], 
   'ينال': [
          'يَنَالُ',
          'يَنَالَ'], 
   'وكنوز': [
           'وَكُنُوزٍ'], 
   'تغفر': [
          'تَغْفِرْ'], 
   'فينظروا': [
             'فَيَنْظُرُوا'], 
   'نعيما': [
           'نَعِيمًا'], 
   'لعل': [
         'لَعَلَّ'], 
   'واتقى': [
           'وَاتَّقَى'], 
   'لعن': [
         'لُعِنَ',
         'لَعَنَ'], 
   'أخرى': [
          'أُخْرَى'], 
   'خلاف': [
          'خِلَافٍ',
          'خِلَافَ'], 
   'حسرتا': [
           'حَسْرَتَا'], 
   'زادوكم': [
            'زَادُوكُمْ'], 
   'وباركنا': [
             'وَبَارَكْنَا'], 
   'المجيد': [
            'الْمَجِيدِ',
            'الْمَجِيدُ'], 
   'تفور': [
          'تَفُورُ'], 
   'ينزغنك': [
            'يَنْزَغَنَّكَ'], 
   'مبينات': [
            'مُبَيِّنَاتٍ'], 
   'فاسلكوه': [
             'فَاسْلُكُوهُ'], 
   'يريدون': [
            'يُرِيدُونَ'], 
   'ولإخواننا': [
               'وَلِإِخْوَانِنَا'], 
   'يمسكهن': [
            'يُمْسِكُهُنَّ'], 
   'ونضع': [
          'وَنَضَعُ'], 
   'لولا': [
          'لَوْلَا'], 
   'لتقرأه': [
            'لِتَقْرَأَهُ'], 
   'أسورة': [
           'أَسْوِرَةٌ'], 
   'أصابتهم': [
             'أَصَابَتْهُمْ'], 
   'بالعدوة': [
             'بِالْعُدْوَةِ'], 
   'مرضت': [
          'مَرِضْتُ'], 
   'سندخلهم': [
             'سَنُدْخِلُهُمْ'], 
   'نضربها': [
            'نَضْرِبُهَا'], 
   'بالعراء': [
             'بِالْعَرَاءِ'], 
   'ومهلهم': [
            'وَمَهِّلْهُمْ'], 
   'كظلمات': [
            'كَظُلُمَاتٍ'], 
   'وبذي': [
          'وَبِذِي'], 
   'وتولوا': [
            'وَتَوَلَّوْا'], 
   'يقدرون': [
            'يَقْدِرُونَ'], 
   'تبين': [
          'تَبَيَّنَ'], 
   'أردتم': [
           'أَرَدْتُمْ',
           'أَرَدْتُمُ'], 
   'مقتحم': [
           'مُقْتَحِمٌ'], 
   'بحيرة': [
           'بَحِيرَةٍ'], 
   'يشتري': [
           'يَشْتَرِي'], 
   'مركوم': [
           'مَرْكُومٌ'], 
   'توفني': [
           'تَوَفَّنِي'], 
   'ضربوه': [
           'ضَرَبُوهُ'], 
   'اشكر': [
          'اشْكُرْ'], 
   'ويمكر': [
           'وَيَمْكُرُ'], 
   'لعمرك': [
           'لَعَمْرُكَ'], 
   'امرئ': [
          'امْرِئٍ'], 
   'امرؤ': [
          'امْرُؤٌ'], 
   'امرأ': [
          'امْرَأَ'], 
   'بحمدك': [
           'بِحَمْدِكَ'], 
   'لثمود': [
           'لِثَمُودَ'], 
   'كبير': [
          'كَبِيرٌ',
          'كَبِيرٍ'], 
   'بذبح': [
          'بِذِبْحٍ'], 
   'وغدوا': [
           'وَغَدَوْا'], 
   'استهزئ': [
            'اسْتُهْزِئَ'], 
   'والحياة': [
             'وَالْحَيَاةَ'], 
   'مقتصدة': [
            'مُقْتَصِدَةٌ'], 
   'دمرناهم': [
             'دَمَّرْنَاهُمْ'], 
   'مرضى': [
          'مَرْضَى'], 
   'تبيض': [
          'تَبْيَضُّ'], 
   'يشرون': [
           'يَشْرُونَ'], 
   'أترابا': [
            'أَتْرَابًا'], 
   'ويذرك': [
           'وَيَذَرَكَ'], 
   'تبيد': [
          'تَبِيدَ'], 
   'واستوت': [
            'وَاسْتَوَتْ'], 
   'يبطشون': [
            'يَبْطِشُونَ'], 
   'مبين': [
          'مُبِينٌ',
          'مُبِينٍ'], 
   'الشر': [
          'الشَّرُّ',
          'الشَّرَّ'], 
   'عجولا': [
           'عَجُولًا'], 
   'برقه': [
          'بَرْقِهِ'], 
   'أصحاب': [
           'أَصْحَابُ',
           'أَصْحَابِ',
           'أَصْحَابَ',
           'أَصْحَابٌ'], 
   'أدبارها': [
             'أَدْبَارِهَا'], 
   'نباته': [
           'نَبَاتُهُ'], 
   'يقولا': [
           'يَقُولَا'], 
   'يجتنبون': [
             'يَجْتَنِبُونَ'], 
   'فآتاهم': [
            'فَآتَاهُمُ'], 
   'فتقعد': [
           'فَتَقْعُدَ'], 
   'آتيتهن': [
            'آتَيْتَهُنَّ'], 
   'فسيعلمون': [
              'فَسَيَعْلَمُونَ'], 
   'ليعلموا': [
             'لِيَعْلَمُوا'], 
   'وخاب': [
          'وَخَابَ'], 
   'تهتدون': [
            'تَهْتَدُونَ'], 
   'يوجهه': [
           'يُوَجِّهْهُ'], 
   'فعقروها': [
             'فَعَقَرُوهَا'], 
   'بعضنا': [
           'بَعْضُنَا'], 
   'فجاءوهم': [
             'فَجَاءُوهُمْ'], 
   'نتبعهم': [
            'نُتْبِعُهُمُ'], 
   'وكلمه': [
           'وَكَلَّمَهُ'], 
   'ميسورا': [
            'مَيْسُورًا'], 
   'غرك': [
         'غَرَّكَ'], 
   'آناء': [
          'آنَاءَ',
          'آنَاءِ'], 
   'الخيل': [
           'الْخَيْلِ'], 
   'استزلهم': [
             'اسْتَزَلَّهُمُ'], 
   'قرآنه': [
           'قُرْآنَهُ'], 
   'ظننت': [
          'ظَنَنْتُ'], 
   'فيذهب': [
           'فَيَذْهَبُ'], 
   'الموالي': [
             'الْمَوَالِيَ'], 
   'يصلي': [
          'يُصَلِّي'], 
   'يصلى': [
          'يَصْلَى'], 
   'والدي': [
           'وَالِدَيَّ'], 
   'تهتدوا': [
            'تَهْتَدُوا'], 
   'يهلكون': [
            'يُهْلِكُونَ'], 
   'شققنا': [
           'شَقَقْنَا'], 
   'أشداء': [
           'أَشِدَّاءُ'], 
   'مغنون': [
           'مُغْنُونَ'], 
   'بالأمن': [
            'بِالْأَمْنِ'], 
   'والدم': [
           'وَالدَّمَ',
           'وَالدَّمُ'], 
   'والده': [
           'وَالِدِهِ'], 
   'لهما': [
          'لَهُمَا'], 
   'نضاختان': [
             'نَضَّاخَتَانِ'], 
   'صدقهم': [
           'صِدْقِهِمْ',
           'صِدْقُهُمْ'], 
   'فاقذفيه': [
             'فَاقْذِفِيهِ'], 
   'سنا': [
         'سَنَا'], 
   'قرآنا': [
           'قُرْآنًا'], 
   'يقتل': [
          'يُقْتَلُ',
          'يَقْتُلْ',
          'يَقْتُلَ'], 
   'ويرجو': [
           'وَيَرْجُو'], 
   'أعظكم': [
           'أَعِظُكُمْ'], 
   'أدبارهم': [
             'أَدْبَارِهِمْ',
             'أَدْبَارَهُمْ'], 
   'للذاكرين': [
              'لِلذَّاكِرِينَ'], 
   'نباتا': [
           'نَبَاتًا'], 
   'وضحاها': [
            'وَضُحَاهَا'], 
   'السبيل': [
            'السَّبِيلِ',
            'السَّبِيلَ',
            'السَّبِيلُ'], 
   'يبصرونهم': [
              'يُبَصَّرُونَهُمْ'], 
   'تمكرون': [
            'تَمْكُرُونَ'], 
   'لأقرب': [
           'لِأَقْرَبَ'], 
   'أختك': [
          'أُخْتُكَ'], 
   'ومرساها': [
             'وَمُرْسَاهَا'], 
   'تركضوا': [
            'تَرْكُضُوا'], 
   'يطهر': [
          'يُطَهِّرَ'], 
   'تذرهم': [
           'تَذَرْهُمْ'], 
   'بالنفس': [
            'بِالنَّفْسِ'], 
   'فاقرءوا': [
             'فَاقْرَءُوا'], 
   'تضرعوا': [
            'تَضَرَّعُوا'], 
   'وجدوا': [
           'وَجَدُوا'], 
   'نذر': [
         'نَذْرٍ'], 
   'ولتجري': [
            'وَلِتَجْرِيَ'], 
   'ماتوا': [
           'مَاتُوا'], 
   'وتسير': [
           'وَتَسِيرُ'], 
   'أهلكتهم': [
             'أَهْلَكْتَهُمْ'], 
   'بقربان': [
            'بِقُرْبَانٍ'], 
   'نعد': [
         'نَعُدْ',
         'نَعُدُّ'], 
   'وأيديهم': [
             'وَأَيْدِيهِمْ'], 
   'عصفا': [
          'عَصْفًا'], 
   'فتحنا': [
           'فَتَحْنَا'], 
   'ابنت': [
          'ابْنَتَ'], 
   'أشرك': [
          'أُشْرِكُ',
          'أُشْرِكْ',
          'أُشْرِكَ',
          'أَشْرَكَ'], 
   'وكسوتهن': [
             'وَكِسْوَتُهُنَّ'], 
   'أوتوه': [
           'أُوتُوهُ'], 
   'وقضينا': [
            'وَقَضَيْنَا'], 
   'جنفا': [
          'جَنَفًا'], 
   'لمشركون': [
             'لَمُشْرِكُونَ'], 
   'طبقا': [
          'طَبَقًا'], 
   'يذهب': [
          'يَذْهَبُ'], 
   'أهواءكم': [
             'أَهْوَاءَكُمْ'], 
   'لنعلم': [
           'لِنَعْلَمَ',
           'لَنَعْلَمُ'], 
   'مقطوع': [
           'مَقْطُوعٌ'], 
   'ونصروا': [
            'وَنَصَرُوا'], 
   'ضيق': [
         'ضَيْقٍ'], 
   'فجاءته': [
            'فَجَاءَتْهُ'], 
   'واضرب': [
           'وَاضْرِبْ'], 
   'والسماوات': [
               'وَالسَّمَاوَاتُ',
               'وَالسَّمَاوَاتِ'], 
   'رزقكم': [
           'رَزَقَكُمُ',
           'رِزْقُكُمْ',
           'رِزْقَكُمْ',
           'رَزَقَكُمْ'], 
   'نذل': [
         'نَذِلَّ'], 
   'اطلعت': [
           'اطَّلَعْتَ'], 
   'إسحاق': [
           'إِسْحَاقَ'], 
   'أبدا': [
          'أَبَدًا'], 
   'للعبيد': [
            'لِلْعَبِيدِ'], 
   'سكينا': [
           'سِكِّينًا'], 
   'يقضى': [
          'يُقْضَى'], 
   'بحر': [
         'بَحْرٍ'], 
   'فعلتها': [
            'فَعَلْتُهَا'], 
   'سوف': [
         'سَوْفَ'], 
   'أخرجوكم': [
             'أَخْرَجُوكُمْ'], 
   'الأنثى': [
            'الْأُنْثَى'], 
   'لذهب': [
          'لَذَهَبَ'], 
   'بالإيمان': [
              'بِالْإِيمَانِ'], 
   'الخرطوم': [
             'الْخُرْطُومِ'], 
   'اتخذوا': [
            'اتَّخَذُوا'], 
   'المصير': [
            'الْمَصِيرُ'], 
   'إسرافا': [
            'إِسْرَافًا'], 
   'علام': [
          'عَلَّامُ'], 
   'جزء': [
         'جُزْءٌ'], 
   'أروني': [
           'أَرُونِي',
           'أَرُونِيَ'], 
   'باليمين': [
             'بِالْيَمِينِ'], 
   'وقعت': [
          'وَقَعَتِ'], 
   'فأما': [
          'فَأَمَّا'], 
   'وقعد': [
          'وَقَعَدَ'], 
   'يذبح': [
          'يُذَبِّحُ'], 
   'فقعوا': [
           'فَقَعُوا'], 
   'سنن': [
         'سُنَنَ',
         'سُنَنٌ'], 
   'أخذوا': [
           'أُخِذُوا'], 
   'وألقي': [
           'وَأُلْقِيَ'], 
   'وألقى': [
           'وَأَلْقَى'], 
   'القوة': [
           'الْقُوَّةِ',
           'الْقُوَّةَ'], 
   'لاعبين': [
            'لَاعِبِينَ'], 
   'وأنكحوا': [
             'وَأَنْكِحُوا'], 
   'ولنذيقنهم': [
               'وَلَنُذِيقَنَّهُمْ'], 
   'تؤتي': [
          'تُؤْتِي'], 
   'الجاهلية': [
              'الْجَاهِلِيَّةِ'], 
   'أخراكم': [
            'أُخْرَاكُمْ'], 
   'والناشطات': [
               'وَالنَّاشِطَاتِ'], 
   'كرمت': [
          'كَرَّمْتَ'], 
   'فبشر': [
          'فَبَشِّرْ'], 
   'فضلا': [
          'فَضْلًا'], 
   'اطمس': [
          'اطْمِسْ'], 
   'عطاؤنا': [
            'عَطَاؤُنَا'], 
   'والصادقين': [
               'وَالصَّادِقِينَ'], 
   'يقاتلونكم': [
               'يُقَاتِلُونَكُمْ'], 
   'بعزيز': [
           'بِعَزِيزٍ'], 
   'المشارق': [
             'الْمَشَارِقِ'], 
   'أأشكر': [
           'أَأَشْكُرُ'], 
   'أراذلنا': [
             'أَرَاذِلُنَا'], 
   'أحيط': [
          'أُحِيطَ'], 
   'أفحسب': [
           'أَفَحَسِبَ'], 
   'الأولين': [
             'الْأَوَّلِينَ'], 
   'أتينا': [
           'أَتَيْنَا'], 
   'جعلوا': [
           'جَعَلُوا'], 
   'وأبصارا': [
             'وَأَبْصَارًا'], 
   'صيد': [
         'صَيْدُ'], 
   'المضلين': [
             'الْمُضِلِّينَ'], 
   'اكتتبها': [
             'اكْتَتَبَهَا'], 
   'بوكيل': [
           'بِوَكِيلٍ'], 
   'خلصوا': [
           'خَلَصُوا'], 
   'عهدي': [
          'عَهْدِي'], 
   'وآتوهن': [
            'وَآتُوهُنَّ'], 
   'وآتوهم': [
            'وَآتُوهُمْ'], 
   'بروج': [
          'بُرُوجٍ'], 
   'فأمه': [
          'فَأُمُّهُ'], 
   'هامدة': [
           'هَامِدَةً'], 
   'القول': [
           'الْقَوْلُ',
           'الْقَوْلِ',
           'الْقَوْلَ'], 
   'القوم': [
           'الْقَوْمِ',
           'الْقَوْمَ',
           'الْقَوْمُ'], 
   'وبالذي': [
            'وَبِالَّذِي'], 
   'والصائمين': [
               'وَالصَّائِمِينَ'], 
   'وألقت': [
           'وَأَلْقَتْ'], 
   'ماذا': [
          'مَاذَا'], 
   'القوى': [
           'الْقُوَى'], 
   'القوي': [
           'الْقَوِيُّ'], 
   'سنزيد': [
           'سَنَزِيدُ'], 
   'قوة': [
         'قُوَّةً',
         'قُوَّةٍ',
         'قُوَّةَ'], 
   'أعز': [
         'أَعَزُّ'], 
   'سنريهم': [
            'سَنُرِيهِمْ'], 
   'ببني': [
          'بِبَنِي'], 
   'والبصير': [
             'وَالْبَصِيرُ',
             'وَالْبَصِيرِ'], 
   'ألوانها': [
             'أَلْوَانُهَا'], 
   'قوا': [
         'قُوا'], 
   'تدخرون': [
            'تَدَّخِرُونَ'], 
   'يمكرون': [
            'يَمْكُرُونَ'], 
   'ينالوا': [
            'يَنَالُوا'], 
   'خطبكن': [
           'خَطْبُكُنَّ'], 
   'خطبكم': [
           'خَطْبُكُمْ'], 
   'يبلغن': [
           'يَبْلُغَنَّ'], 
   'أعد': [
         'أَعَدَّ'], 
   'آلله': [
          'آللَّهُ'], 
   'أحيا': [
          'أَحْيَا'], 
   'وأدخلناه': [
              'وَأَدْخَلْنَاهُ'], 
   'نبتغي': [
           'نَبْتَغِي'], 
   'المبطلون': [
              'الْمُبْطِلُونَ'], 
   'أغرقوا': [
            'أُغْرِقُوا'], 
   'شئتما': [
           'شِئْتُمَا'], 
   'فأيدنا': [
            'فَأَيَّدْنَا'], 
   'مقصورات': [
             'مَقْصُورَاتٌ'], 
   'طلبا': [
          'طَلَبًا'], 
   'الرسولا': [
             'الرَّسُولَا'], 
   'تنته': [
          'تَنْتَهِ'], 
   'اقنتي': [
           'اقْنُتِي'], 
   'يتفكرون': [
             'يَتَفَكَّرُونَ'], 
   'يصلحون': [
            'يُصْلِحُونَ'], 
   'أجعلتم': [
            'أَجَعَلْتُمْ'], 
   'يتمنوه': [
            'يَتَمَنَّوْهُ'], 
   'المستقر': [
             'الْمُسْتَقَرُّ'], 
   'فضحكت': [
           'فَضَحِكَتْ'], 
   'والحجارة': [
              'وَالْحِجَارَةُ'], 
   'أعقابكم': [
             'أَعْقَابِكُمْ'], 
   'يعيد': [
          'يُعِيدُ'], 
   'واصطبر': [
            'وَاصْطَبِرْ'], 
   'وتخفون': [
            'وَتُخْفُونَ'], 
   'يجتبي': [
           'يَجْتَبِي'], 
   'وأزلفت': [
            'وَأُزْلِفَتِ'], 
   'فأتبعنا': [
             'فَأَتْبَعْنَا'], 
   'عبدناهم': [
             'عَبَدْنَاهُمْ'], 
   'ليأتيني': [
             'لَيَأْتِيَنِّي'], 
   'قوي': [
         'قَوِيٌّ'], 
   'سمكها': [
           'سَمْكَهَا'], 
   'وجاءهم': [
            'وَجَاءَهُمُ',
            'وَجَاءَهُمْ'], 
   'نسائهم': [
            'نِسَائِهِمْ'], 
   'يفتيكم': [
            'يُفْتِيكُمْ'], 
   'نسائهن': [
            'نِسَائِهِنَّ'], 
   'قوم': [
         'قَوْمِ',
         'قَوْمٌ',
         'قَوْمٍ',
         'قَوْمُ',
         'قَوْمَ'], 
   'قول': [
         'قَوْلَ',
         'قَوْلُ',
         'قَوْلٍ',
         'قَوْلٌ'], 
   'وحملت': [
           'وَحُمِلَتِ'], 
   'سواها': [
           'سَوَّاهَا'], 
   'يمددكم': [
            'يُمْدِدْكُمْ'], 
   'ينالون': [
            'يَنَالُونَ'], 
   'يبلغا': [
           'يَبْلُغَا'], 
   'باسرة': [
           'بَاسِرَةٌ'], 
   'واشهد': [
           'وَاشْهَدْ'], 
   'وليذكر': [
            'وَلِيَذَّكَّرَ'], 
   'ليسجنن': [
            'لَيُسْجَنَنَّ'], 
   'فئة': [
         'فِئَةٍ',
         'فِئَةٌ',
         'فِئَةً'], 
   'مثقال': [
           'مِثْقَالَ',
           'مِثْقَالِ',
           'مِثْقَالُ'], 
   'وليدا': [
           'وَلِيدًا'], 
   'كشجرة': [
           'كَشَجَرَةٍ'], 
   'يرزقها': [
            'يَرْزُقُهَا'], 
   'اتقى': [
          'اتَّقَى'], 
   'الكفل': [
           'الْكِفْلِ'], 
   'فدخلوا': [
            'فَدَخَلُوا'], 
   'عمون': [
          'عَمُونَ'], 
   'يك': [
        'يَكُ'], 
   'صعودا': [
           'صَعُودًا'], 
   'الحوت': [
           'الْحُوتِ',
           'الْحُوتُ',
           'الْحُوتَ'], 
   'إلياس': [
           'إِلْيَاسَ'], 
   'بالمجرمين': [
               'بِالْمُجْرِمِينَ'], 
   'فأقبلت': [
            'فَأَقْبَلَتِ'], 
   'ومنذرين': [
             'وَمُنْذِرِينَ'], 
   'محسنون': [
            'مُحْسِنُونَ'], 
   'تخرج': [
          'تَخْرُجُ',
          'تَخْرُجْ',
          'تُخْرِجُ',
          'تَخْرُجَ'], 
   'الطول': [
           'الطَّوْلِ'], 
   'مظلمون': [
            'مُظْلِمُونَ'], 
   'نعود': [
          'نَعُودَ'], 
   'توبة': [
          'تَوْبَةً'], 
   'مصيرا': [
           'مَصِيرًا'], 
   'ويجركم': [
            'وَيُجِرْكُمْ'], 
   'آخران': [
           'آخَرَانِ'], 
   'ألفافا': [
            'أَلْفَافًا'], 
   'رواسي': [
           'رَوَاسِيَ'], 
   'فثبطهم': [
            'فَثَبَّطَهُمْ'], 
   'ورهبانهم': [
              'وَرُهْبَانَهُمْ'], 
   'تخرق': [
          'تَخْرِقَ'], 
   'والظاهر': [
             'وَالظَّاهِرُ'], 
   'أدر': [
         'أَدْرِ'], 
   'ترونهم': [
            'تَرَوْنَهُمْ'], 
   'ومتاع': [
           'وَمَتَاعٌ'], 
   'وخير': [
          'وَخَيْرٌ'], 
   'وسلموا': [
            'وَسَلِّمُوا'], 
   'وعيسى': [
           'وَعِيسَى'], 
   'عرفا': [
          'عُرْفًا'], 
   'وسلاما': [
            'وَسَلَامًا'], 
   'فهذا': [
          'فَهَذَا'], 
   'الطور': [
           'الطُّورِ',
           'الطُّورَ'], 
   'معروشات': [
             'مَعْرُوشَاتٍ'], 
   'بالنواصي': [
              'بِالنَّوَاصِي'], 
   'وضائق': [
           'وَضَائِقٌ'], 
   'الواقعة': [
             'الْوَاقِعَةُ'], 
   'الكفر': [
           'الْكُفْرَ',
           'الْكُفْرِ'], 
   'ير': [
        'يَرَ'], 
   'يس': [
        'يس'], 
   'الثلاثة': [
             'الثَّلَاثَةِ'], 
   'يد': [
        'يَدُ',
        'يَدٍ'], 
   'وأخرجوكم': [
              'وَأَخْرَجُوكُمْ'], 
   'بدلناهم': [
             'بَدَّلْنَاهُمْ'], 
   'عنيدا': [
           'عَنِيدًا'], 
   'يا': [
        'يَا'], 
   'فصلنا': [
           'فَصَّلْنَا'], 
   'وأنجينا': [
             'وَأَنْجَيْنَا'], 
   'الساحرون': [
              'السَّاحِرُونَ'], 
   'وثمانية': [
             'وَثَمَانِيَةَ'], 
   'يسمن': [
          'يُسْمِنُ'], 
   'وأعينهم': [
             'وَأَعْيُنُهُمْ'], 
   'لعناهم': [
            'لَعَنَّاهُمْ'], 
   'ونذر': [
          'وَنُذُرِ',
          'وَنَذَرُ',
          'وَنَذَرَ'], 
   'أفأنبئكم': [
              'أَفَأُنَبِّئُكُمْ'], 
   'براء': [
          'بَرَاءٌ'], 
   'فقاتل': [
           'فَقَاتِلْ'], 
   'تتبدلوا': [
             'تَتَبَدَّلُوا'], 
   'سيهدين': [
            'سَيَهْدِينِ'], 
   'عام': [
         'عَامٍ',
         'عَامٌ'], 
   'وتقطعت': [
            'وَتَقَطَّعَتْ'], 
   'صورناكم': [
             'صَوَّرْنَاكُمْ'], 
   'شهادات': [
            'شَهَادَاتٍ'], 
   'وأرادوا': [
             'وَأَرَادُوا'], 
   'يسر': [
         'يَسْرِ'], 
   'بثمن': [
          'بِثَمَنٍ'], 
   'فأت': [
         'فَأْتِ'], 
   'لمردودون': [
              'لَمَرْدُودُونَ'], 
   'مهيلا': [
           'مَهِيلًا'], 
   'بجنتيهم': [
             'بِجَنَّتَيْهِمْ'], 
   'ربياني': [
            'رَبَّيَانِي'], 
   'تأخذهم': [
            'تَأْخُذُهُمْ'], 
   'لشوبا': [
           'لَشَوْبًا'], 
   'عاد': [
         'عَادٍ',
         'عَادٌ',
         'عَادَ'], 
   'مكان': [
          'مَكَانٍ',
          'مَكَانَ'], 
   'يغنيهم': [
            'يُغْنِيَهُمُ'], 
   'استأجره': [
             'اسْتَأْجِرْهُ'], 
   'بالحجاب': [
             'بِالْحِجَابِ'], 
   'يرحمنا': [
            'يَرْحَمْنَا'], 
   'يحملنها': [
             'يَحْمِلْنَهَا'], 
   'فظلتم': [
           'فَظَلْتُمْ'], 
   'جبلا': [
          'جِبِلًّا'], 
   'أتعلمون': [
             'أَتُعَلِّمُونَ',
             'أَتَعْلَمُونَ'], 
   'ظليلا': [
           'ظَلِيلًا'], 
   'وغرتكم': [
            'وَغَرَّتْكُمُ'], 
   'قنوط': [
          'قَنُوطٌ'], 
   'كاشفات': [
            'كَاشِفَاتُ'], 
   'يسلبهم': [
            'يَسْلُبْهُمُ'], 
   'والحكم': [
            'وَالْحُكْمَ'], 
   'بخارج': [
           'بِخَارِجٍ'], 
   'قالها': [
           'قَالَهَا'], 
   'خروج': [
          'خُرُوجٍ'], 
   'وقلوبهم': [
             'وَقُلُوبُهُمْ'], 
   'فكفرت': [
           'فَكَفَرَتْ'], 
   'يسمع': [
          'يَسْمَعُ',
          'يُسْمِعُ',
          'يَسْمَعَ'], 
   'الكوثر': [
            'الْكَوْثَرَ'], 
   'كافورا': [
            'كَافُورًا'], 
   'الإسلام': [
             'الْإِسْلَامِ',
             'الْإِسْلَامُ',
             'الْإِسْلَامَ'], 
   'غائبين': [
            'غَائِبِينَ'], 
   'يلاقوا': [
            'يُلَاقُوا'], 
   'مناسكنا': [
             'مَنَاسِكَنَا'], 
   'استقر': [
           'اسْتَقَرَّ'], 
   'وفصيلته': [
             'وَفَصِيلَتِهِ'], 
   'مبوأ': [
          'مُبَوَّأَ'], 
   'منيبين': [
            'مُنِيبِينَ'], 
   'أصابك': [
           'أَصَابَكَ'], 
   'كبرت': [
          'كَبُرَتْ'], 
   'بأسكم': [
           'بَأْسِكُمْ',
           'بَأْسَكُمْ'], 
   'والمجوس': [
             'وَالْمَجُوسَ'], 
   'تبلو': [
          'تَبْلُو'], 
   'تبلى': [
          'تُبْلَى'], 
   'فارغب': [
           'فَارْغَبْ'], 
   'الفقير': [
            'الْفَقِيرَ'], 
   'ييأس': [
          'يَيْأَسِ',
          'يَيْأَسُ'], 
   'جيوبهن': [
            'جُيُوبِهِنَّ'], 
   'أخرجت': [
           'أُخْرِجَتْ'], 
   'كسادها': [
            'كَسَادَهَا'], 
   'ونزلنا': [
            'وَنَزَّلْنَا'], 
   'نبشرك': [
           'نُبَشِّرُكَ'], 
   'بالبشرى': [
             'بِالْبُشْرَى'], 
   'وعلمتني': [
             'وَعَلَّمْتَنِي'], 
   'أخرجه': [
           'أَخْرَجَهُ'], 
   'يبدين': [
           'يُبْدِينَ'], 
   'مخضرة': [
           'مُخْضَرَّةً'], 
   'ففزع': [
          'فَفَزِعَ'], 
   'برجال': [
           'بِرِجَالٍ'], 
   'والظالمين': [
               'وَالظَّالِمِينَ'], 
   'نعمت': [
          'نِعْمَتَ'], 
   'نجعلهما': [
             'نَجْعَلْهُمَا'], 
   'هباء': [
          'هَبَاءً'], 
   'اقتده': [
           'اقْتَدِهْ'], 
   'إناه': [
          'إِنَاهُ'], 
   'لسميع': [
           'لَسَمِيعُ',
           'لَسَمِيعٌ'], 
   'غشيهم': [
           'غَشِيَهُمْ'], 
   'بأيديكم': [
             'بِأَيْدِيكُمْ'], 
   'تعبدون': [
            'تَعْبُدُونَ'], 
   'اتبعتني': [
             'اتَّبَعْتَنِي'], 
   'باقية': [
           'بَاقِيَةٍ',
           'بَاقِيَةً'], 
   'مقتدر': [
           'مُقْتَدِرٍ'], 
   'وصد': [
         'وَصُدَّ',
         'وَصَدٌّ'], 
   'كبره': [
          'كِبْرَهُ'], 
   'تعتدونها': [
              'تَعْتَدُّونَهَا'], 
   'حوله': [
          'حَوْلَهُ'], 
   'لست': [
         'لَسْتَ',
         'لَسْتُ'], 
   'حولك': [
          'حَوْلِكَ'], 
   'آخذين': [
           'آخِذِينَ'], 
   'قويا': [
          'قَوِيًّا'], 
   'وكشفنا': [
            'وَكَشَفْنَا'], 
   'ماءها': [
           'مَاءَهَا'], 
   'ويرضين': [
            'وَيَرْضَيْنَ'], 
   'واتخذتموه': [
               'وَاتَّخَذْتُمُوهُ'], 
   'نبأت': [
          'نَبَّأَتْ'], 
   'والريحان': [
              'وَالرَّيْحَانُ'], 
   'ففي': [
         'فَفِي'], 
   'بالعذاب': [
             'بِالْعَذَابِ'], 
   'اقتتلوا': [
             'اقْتَتَلُوا'], 
   'ورسلنا': [
            'وَرُسُلُنَا'], 
   'وكثير': [
           'وَكَثِيرٌ'], 
   'رغبا': [
          'رَغَبًا'], 
   'نعما': [
          'نِعِمَّا'], 
   'ونجينا': [
            'وَنَجَّيْنَا'], 
   'تأتيكم': [
            'تَأْتِيكُمْ'], 
   'جانب': [
          'جَانِبِ',
          'جَانِبَ',
          'جَانِبٍ'], 
   'الروح': [
           'الرُّوحُ',
           'الرُّوحِ',
           'الرُّوحَ'], 
   'وليمحص': [
            'وَلِيُمَحِّصَ'], 
   'لبدا': [
          'لِبَدًا',
          'لُبَدًا'], 
   'الزارعون': [
              'الزَّارِعُونَ'], 
   'وأتوني': [
            'وَأْتُونِي'], 
   'واصطنعتك': [
              'وَاصْطَنَعْتُكَ'], 
   'لابثين': [
            'لَابِثِينَ'], 
   'يأتهم': [
           'يَأْتِهِمْ'], 
   'أبالله': [
            'أَبِاللَّهِ'], 
   'ثوابا': [
           'ثَوَابًا'], 
   'بألف': [
          'بِأَلْفٍ'], 
   'مشتبها': [
            'مُشْتَبِهًا'], 
   'الساجدون': [
              'السَّاجِدُونَ'], 
   'بتاركي': [
            'بِتَارِكِي'], 
   'دونها': [
           'دُونِهَا'], 
   'الآخرين': [
             'الْآخِرِينَ',
             'الْآخَرِينَ'], 
   'الروم': [
           'الرُّومُ'], 
   'أكبر': [
          'أَكْبَرُ',
          'أَكْبَرَ'], 
   'أحدهما': [
            'أَحَدُهُمَا',
            'أَحَدِهِمَا'], 
   'نزعناها': [
             'نَزَعْنَاهَا'], 
   'وليدع': [
           'وَلْيَدْعُ'], 
   'أتموا': [
           'أَتِمُّوا'], 
   'طيرا': [
          'طَيْرًا'], 
   'لربكم': [
           'لِرَبِّكُمْ'], 
   'بالملك': [
            'بِالْمُلْكِ'], 
   'فعصى': [
          'فَعَصَى'], 
   'ويحذركم': [
             'وَيُحَذِّرُكُمُ'], 
   'خزي': [
         'خِزْيٌ',
         'خِزْيِ'], 
   'بولده': [
           'بِوَلَدِهِ'], 
   'نبأه': [
          'نَبَأَهُ'], 
   'المشعر': [
            'الْمَشْعَرِ'], 
   'أقاموا': [
            'أَقَامُوا'], 
   'لينصرنه': [
             'لَيَنْصُرَنَّهُ'], 
   'فأروني': [
            'فَأَرُونِي'], 
   'لتحملهم': [
             'لِتَحْمِلَهُمْ'], 
   'قطمير': [
           'قِطْمِيرٍ'], 
   'فالصالحات': [
               'فَالصَّالِحَاتُ'], 
   'فتنازعوا': [
              'فَتَنَازَعُوا'], 
   'عاليهم': [
            'عَالِيَهُمْ'], 
   'شطر': [
         'شَطْرَ'], 
   'المثاني': [
             'الْمَثَانِي'], 
   'وعشيرتكم': [
              'وَعَشِيرَتُكُمْ'], 
   'سخروا': [
           'سَخِرُوا'], 
   'يبشر': [
          'يُبَشِّرُ'], 
   'وإسماعيل': [
              'وَإِسْمَاعِيلَ',
              'وَإِسْمَاعِيلُ'], 
   'نزد': [
         'نَزِدْ'], 
   'قاتلهم': [
            'قَاتَلَهُمُ'], 
   'ونجعل': [
           'وَنَجْعَلُ',
           'وَنَجْعَلَ'], 
   'ينفقونها': [
              'يُنْفِقُونَهَا'], 
   'بمقدار': [
            'بِمِقْدَارٍ'], 
   'نفعه': [
          'نَفْعِهِ'], 
   'وينذر': [
           'وَيُنْذِرَ'], 
   'للرحمن': [
            'لِلرَّحْمَنِ'], 
   'ظهورها': [
            'ظُهُورِهَا',
            'ظُهُورُهَا'], 
   'نزغ': [
         'نَزْغٌ',
         'نَزَغَ'], 
   'والإنجيل': [
              'وَالْإِنْجِيلَ',
              'وَالْإِنْجِيلِ',
              'وَالْإِنْجِيلُ'], 
   'أركسوا': [
            'أُرْكِسُوا'], 
   'جهدهم': [
           'جُهْدَهُمْ'], 
   'يكبروا': [
            'يَكْبَرُوا'], 
   'فيستحيي': [
             'فَيَسْتَحْيِي'], 
   'تبعني': [
           'تَبِعَنِي'], 
   'إعراضهم': [
             'إِعْرَاضُهُمْ'], 
   'تتفكرون': [
             'تَتَفَكَّرُونَ'], 
   'لأبيه': [
           'لِأَبِيهِ'], 
   'تباب': [
          'تَبَابٍ'], 
   'لذكرى': [
           'لَذِكْرَى'], 
   'الجاهلون': [
              'الْجَاهِلُونَ'], 
   'خلقناهم': [
             'خَلَقْنَاهُمْ'], 
   'لذكري': [
           'لِذِكْرِي'], 
   'النجاة': [
            'النَّجَاةِ'], 
   'نشوزا': [
           'نُشُوزًا'], 
   'وسراجا': [
            'وَسِرَاجًا'], 
   'الصراط': [
            'الصِّرَاطِ',
            'الصِّرَاطَ'], 
   'قسيسين': [
            'قِسِّيسِينَ'], 
   'يبكون': [
           'يَبْكُونَ'], 
   'جاءوها': [
            'جَاءُوهَا'], 
   'مغتسل': [
           'مُغْتَسَلٌ'], 
   'بارزون': [
            'بَارِزُونَ'], 
   'ليبدي': [
           'لِيُبْدِيَ'], 
   'تتفكروا': [
             'تَتَفَكَّرُوا'], 
   'للكذب': [
           'لِلْكَذِبِ'], 
   'ترجي': [
          'تُرْجِي'], 
   'تبروا': [
           'تَبَرُّوا'], 
   'بالبصر': [
            'بِالْبَصَرِ'], 
   'وابيضت': [
            'وَابْيَضَّتْ'], 
   'ترجو': [
          'تَرْجُو'], 
   'يصلاها': [
            'يَصْلَاهَا'], 
   'البأساء': [
             'الْبَأْسَاءِ',
             'الْبَأْسَاءُ'], 
   'المحيض': [
            'الْمَحِيضِ'], 
   'فإلم': [
          'فَإِلَّمْ'], 
   'شركاء': [
           'شُرَكَاءَ',
           'شُرَكَاءُ'], 
   'ومساكن': [
            'وَمَسَاكِنَ',
            'وَمَسَاكِنُ'], 
   'نزل': [
         'نَزَّلَ',
         'نُزِّلَ',
         'نَزَلَ'], 
   'النعاس': [
            'النُّعَاسَ'], 
   'ولعبد': [
           'وَلَعَبْدٌ'], 
   'أغويناهم': [
              'أَغْوَيْنَاهُمْ'], 
   'ولعبا': [
           'وَلَعِبًا'], 
   'منسأته': [
            'مِنْسَأَتَهُ'], 
   'نجينا': [
           'نَجَّيْنَا'], 
   'ظهورهم': [
            'ظُهُورِهِمْ'], 
   'وحقت': [
          'وَحُقَّتْ'], 
   'يستخفنك': [
             'يَسْتَخِفَّنَّكَ'], 
   'المزمل': [
            'الْمُزَّمِّلُ'], 
   'ثياب': [
          'ثِيَابُ',
          'ثِيَابٌ'], 
   'لتغفر': [
           'لِتَغْفِرَ'], 
   'اعتزلتموهم': [
                'اعْتَزَلْتُمُوهُمْ'], 
   'الزبور': [
            'الزَّبُورِ'], 
   'فلكل': [
          'فَلِكُلِّ'], 
   'لأحدهما': [
             'لِأَحَدِهِمَا'], 
   'حصيدا': [
           'حَصِيدًا'], 
   'ممددة': [
           'مُمَدَّدَةٍ'], 
   'والموفون': [
              'وَالْمُوفُونَ'], 
   'وأجدر': [
           'وَأَجْدَرُ'], 
   'الجهر': [
           'الْجَهْرَ',
           'الْجَهْرِ'], 
   'المصور': [
            'الْمُصَوِّرُ'], 
   'يستبدل': [
            'يَسْتَبْدِلْ'], 
   'وقلنا': [
           'وَقُلْنَا'], 
   'ذريتهما': [
             'ذُرِّيَّتِهِمَا'], 
   'تحسبهم': [
            'تَحْسَبُهُمْ'], 
   'شفعاؤنا': [
             'شُفَعَاؤُنَا'], 
   'يختم': [
          'يَخْتِمْ'], 
   'وأغلالا': [
             'وَأَغْلَالًا'], 
   'سأصليه': [
            'سَأُصْلِيهِ'], 
   'لهديناكم': [
              'لَهَدَيْنَاكُمْ'], 
   'قضينا': [
           'قَضَيْنَا'], 
   'ويهديه': [
            'وَيَهْدِيهِ'], 
   'السماء': [
            'السَّمَاءِ',
            'السَّمَاءُ',
            'السَّمَاءَ'], 
   'وعبقري': [
            'وَعَبْقَرِيٍّ'], 
   'الأولون': [
             'الْأَوَّلُونَ'], 
   'وأتممت': [
            'وَأَتْمَمْتُ'], 
   'المضعفون': [
              'الْمُضْعِفُونَ'], 
   'بمعروف': [
            'بِمَعْرُوفٍ'], 
   'فخرج': [
          'فَخَرَجَ'], 
   'مكتوبا': [
            'مَكْتُوبًا'], 
   'مؤمن': [
          'مُؤْمِنٌ',
          'مُؤْمِنٍ'], 
   'وإسرافنا': [
              'وَإِسْرَافَنَا'], 
   'يحبون': [
           'يُحِبُّونَ'], 
   'فأهلكناهم': [
               'فَأَهْلَكْنَاهُمْ'], 
   'تتقلب': [
           'تَتَقَلَّبُ'], 
   'باركنا': [
            'بَارَكْنَا'], 
   'ويسبحونه': [
              'وَيُسَبِّحُونَهُ'], 
   'فاقعدوا': [
             'فَاقْعُدُوا'], 
   'يختص': [
          'يَخْتَصُّ'], 
   'رأينه': [
           'رَأَيْنَهُ'], 
   'يمشي': [
          'يَمْشِي'], 
   'يولوكم': [
            'يُوَلُّوكُمُ'], 
   'ويستجيب': [
             'وَيَسْتَجِيبُ'], 
   'نذيقهم': [
            'نُذِيقُهُمُ'], 
   'القيم': [
           'الْقَيِّمُ',
           'الْقَيِّمِ'], 
   'مساكين': [
            'مَسَاكِينَ'], 
   'وزهق': [
          'وَزَهَقَ'], 
   'رجعوا': [
           'رَجَعُوا'], 
   'سجين': [
          'سِجِّينٍ',
          'سِجِّينٌ'], 
   'الموت': [
           'الْمَوْتِ',
           'الْمَوْتُ',
           'الْمَوْتَ'], 
   'ضره': [
         'ضُرِّهِ',
         'ضُرَّهُ',
         'ضَرُّهُ'], 
   'زجرا': [
          'زَجْرًا'], 
   'ود': [
        'وَدَّ'], 
   'الموج': [
           'الْمَوْجُ'], 
   'برسلي': [
           'بِرُسُلِي'], 
   'رقبة': [
          'رَقَبَةٍ'], 
   'محمد': [
          'مُحَمَّدٌ',
          'مُحَمَّدٍ'], 
   'وتذرون': [
            'وَتَذَرُونَ'], 
   'علي': [
         'عَلَيَّ',
         'عَلِيٌّ'], 
   'سئلت': [
          'سُئِلَتْ'], 
   'على': [
         'عَلَى'], 
   'أموال': [
           'أَمْوَالَ',
           'أَمْوَالِ'], 
   'المبثوث': [
             'الْمَبْثُوثِ'], 
   'علم': [
         'عِلْمٍ',
         'عِلْمٌ',
         'عَلِمَ',
         'عِلْمُ',
         'عِلْمَ',
         'عَلَّمَ'], 
   'علق': [
         'عَلَقٍ'], 
   'بالمنكر': [
             'بِالْمُنْكَرِ'], 
   'أولادكم': [
             'أَوْلَادُكُمْ',
             'أَوْلَادَكُمْ',
             'أَوْلَادِكُمْ'], 
   'اختلاف': [
            'اخْتِلَافِ',
            'اخْتِلَافُ'], 
   'جبار': [
          'جَبَّارٍ'], 
   'وتحمل': [
           'وَتَحْمِلُ'], 
   'وفرش': [
          'وَفُرُشٍ'], 
   'رءوف': [
          'رَءُوفٌ'], 
   'يبايعونك': [
              'يُبَايِعُونَكَ'], 
   'قال': [
         'قَالَ'], 
   'قام': [
         'قَامَ'], 
   'الأحاديث': [
              'الْأَحَادِيثِ'], 
   'ليثبتوك': [
             'لِيُثْبِتُوكَ'], 
   'وعهدهم': [
            'وَعَهْدِهِمْ'], 
   'بلقاء': [
           'بِلِقَاءِ'], 
   'أين': [
         'أَيْنَ'], 
   'أيه': [
         'أَيُّهَ'], 
   'تنبت': [
          'تُنْبِتُ',
          'تَنْبُتُ'], 
   'والراسخون': [
               'وَالرَّاسِخُونَ'], 
   'فروج': [
          'فُرُوجٍ'], 
   'نتوفينك': [
             'نَتَوَفَّيَنَّكَ'], 
   'اثاقلتم': [
             'اثَّاقَلْتُمْ'], 
   'البشر': [
           'الْبَشَرِ'], 
   'يدخلنا': [
            'يُدْخِلَنَا'], 
   'نذيرا': [
           'نَذِيرًا'], 
   'يؤخرهم': [
            'يُؤَخِّرُهُمْ'], 
   'المتعال': [
             'الْمُتَعَالِ'], 
   'كبيرهم': [
            'كَبِيرُهُمْ'], 
   'ودت': [
         'وَدَّتْ'], 
   'يهاجر': [
           'يُهَاجِرْ'], 
   'أيا': [
         'أَيًّا'], 
   'الاسم': [
           'الِاسْمُ'], 
   'يسرقن': [
           'يَسْرِقْنَ'], 
   'يؤذي': [
          'يُؤْذِي'], 
   'قاصرات': [
            'قَاصِرَاتُ'], 
   'يؤذن': [
          'يُؤْذَنُ',
          'يُؤْذَنَ'], 
   'يقتروا': [
            'يَقْتُرُوا'], 
   'محضرون': [
            'مُحْضَرُونَ'], 
   'نصحوا': [
           'نَصَحُوا'], 
   'قيل': [
         'قِيلَ'], 
   'أموات': [
           'أَمْوَاتٌ'], 
   'فالموريات': [
               'فَالْمُورِيَاتِ'], 
   'نعيده': [
           'نُعِيدُهُ'], 
   'كذبتم': [
           'كَذَّبْتُمْ'], 
   'رءوس': [
          'رُءُوسُ'], 
   'وبنعمت': [
            'وَبِنِعْمَتِ'], 
   'بقميصي': [
            'بِقَمِيصِي'], 
   'وبنعمة': [
            'وَبِنِعْمَةِ'], 
   'وعدكم': [
           'وَعَدَكُمْ',
           'وَعَدَكُمُ'], 
   'بهاد': [
          'بِهَادِ'], 
   'سعيه': [
          'سَعْيَهُ'], 
   'فحسبه': [
           'فَحَسْبُهُ'], 
   'أقتل': [
          'أَقْتُلْ'], 
   'يعدلون': [
            'يَعْدِلُونَ'], 
   'لعاد': [
          'لِعَادٍ'], 
   'تلووا': [
           'تَلْوُوا'], 
   'جنيا': [
          'جَنِيًّا'], 
   'كفار': [
          'كُفَّارٌ',
          'كَفَّارٍ',
          'كَفَّارٌ'], 
   'وازدجر': [
            'وَازْدُجِرَ'], 
   'أحصاه': [
           'أَحْصَاهُ'], 
   'ألفينا': [
            'أَلْفَيْنَا'], 
   'ندع': [
         'نَدْعُ'], 
   'واشربي': [
            'وَاشْرَبِي'], 
   'جدد': [
         'جُدَدٌ'], 
   'استطاع': [
            'اسْتَطَاعَ'], 
   'وبينكم': [
            'وَبَيْنَكُمْ',
            'وَبَيْنَكُمُ'], 
   'فتنا': [
          'فَتَنَّا'], 
   'اللؤلؤ': [
            'اللُّؤْلُؤِ',
            'اللُّؤْلُؤُ'], 
   'اقتربت': [
            'اقْتَرَبَتِ'], 
   'بايعتم': [
            'بَايَعْتُمْ'], 
   'فتنة': [
          'فِتْنَةٌ',
          'فِتْنَةً',
          'فِتْنَةَ'], 
   'واحد': [
          'وَاحِدٌ',
          'وَاحِدٍ'], 
   'مواخر': [
           'مَوَاخِرَ'], 
   'فيضاعفه': [
             'فَيُضَاعِفَهُ'], 
   'قدحا': [
          'قَدْحًا'], 
   'ويبسطوا': [
             'وَيَبْسُطُوا'], 
   'فنظل': [
          'فَنَظَلُّ'], 
   'السجن': [
           'السِّجْنِ',
           'السِّجْنُ',
           'السِّجْنَ'], 
   'ولنعم': [
           'وَلَنِعْمَ'], 
   'أجبتم': [
           'أُجِبْتُمْ',
           'أَجَبْتُمُ'], 
   'خلفها': [
           'خَلْفَهَا'], 
   'وأطيعوا': [
             'وَأَطِيعُوا'], 
   'ستة': [
         'سِتَّةِ'], 
   'يمسسكم': [
            'يَمْسَسْكُمْ'], 
   'وترى': [
          'وَتَرَى'], 
   'ولتنذر': [
            'وَلِتُنْذِرَ'], 
   'وليأتينهم': [
               'وَلَيَأْتِيَنَّهُمْ'], 
   'تبغونها': [
             'تَبْغُونَهَا'], 
   'لفتاه': [
           'لِفَتَاهُ'], 
   'جزاؤه': [
           'جَزَاؤُهُ'], 
   'كذابا': [
           'كِذَّابًا'], 
   'أكذبتم': [
            'أَكَذَّبْتُمْ'], 
   'مستكبرين': [
              'مُسْتَكْبِرِينَ'], 
   'جناح': [
          'جُنَاحَ',
          'جُنَاحٌ',
          'جَنَاحَ'], 
   'جنات': [
          'جَنَّاتٍ',
          'جَنَّاتِ',
          'جَنَّاتُ',
          'جَنَّاتٌ'], 
   'وأطيعون': [
             'وَأَطِيعُونِ'], 
   'خلفهم': [
           'خَلْفَهُمْ',
           'خَلْفِهِمْ'], 
   'إسرائيل': [
             'إِسْرَائِيلَ',
             'إِسْرَائِيلُ'], 
   'ورائه': [
           'وَرَائِهِ'], 
   'أستكبرت': [
             'أَسْتَكْبَرْتَ'], 
   'قبضا': [
          'قَبْضًا'], 
   'برحمة': [
           'بِرَحْمَةٍ'], 
   'فكيف': [
          'فَكَيْفَ'], 
   'المتين': [
            'الْمَتِينُ'], 
   'أقتلت': [
           'أَقَتَلْتَ'], 
   'طباقا': [
           'طِبَاقًا'], 
   'يشفين': [
           'يَشْفِينِ'], 
   'يكذبك': [
           'يُكَذِّبُكَ'], 
   'لعال': [
          'لَعَالٍ'], 
   'وأصلحنا': [
             'وَأَصْلَحْنَا'], 
   'الخراصون': [
              'الْخَرَّاصُونَ'], 
   'فأنشرنا': [
             'فَأَنْشَرْنَا'], 
   'أقتت': [
          'أُقِّتَتْ'], 
   'وتلك': [
          'وَتِلْكَ'], 
   'ولربك': [
           'وَلِرَبِّكَ'], 
   'حافظات': [
            'حَافِظَاتٌ'], 
   'وتله': [
          'وَتَلَّهُ'], 
   'حسير': [
          'حَسِيرٌ'], 
   'للعباد': [
            'لِلْعِبَادِ'], 
   'جاءتكم': [
            'جَاءَتْكُمْ',
            'جَاءَتْكُمُ'], 
   'أنبياء': [
            'أَنْبِيَاءَ'], 
   'وقصر': [
          'وَقَصْرٍ'], 
   'كسب': [
         'كَسَبَ'], 
   'لأمسكتم': [
             'لَأَمْسَكْتُمْ'], 
   'مشركين': [
            'مُشْرِكِينَ'], 
   'صوتك': [
          'صَوْتِكَ'], 
   'وأطهر': [
           'وَأَطْهَرُ'], 
   'ويتجنبها': [
              'وَيَتَجَنَّبُهَا'], 
   'ليأخذ': [
           'لِيَأْخُذَ'], 
   'لأحتنكن': [
             'لَأَحْتَنِكَنَّ'], 
   'قتل': [
         'قُتِلَ',
         'قَتَلَ',
         'قَتْلَ'], 
   'يتقبل': [
           'يُتَقَبَّلْ',
           'يُتَقَبَّلَ',
           'يَتَقَبَّلُ'], 
   'بمفازة': [
            'بِمَفَازَةٍ'], 
   'يأتوكم': [
            'يَأْتُوكُمْ'], 
   'ويتفكرون': [
              'وَيَتَفَكَّرُونَ'], 
   'ليعجزه': [
            'لِيُعْجِزَهُ'], 
   'سكرتهم': [
            'سَكْرَتِهِمْ'], 
   'واجتبينا': [
              'وَاجْتَبَيْنَا'], 
   'ابعث': [
          'ابْعَثْ'], 
   'سائغا': [
           'سَائِغًا'], 
   'بالمن': [
           'بِالْمَنِّ'], 
   'متصدعا': [
            'مُتَصَدِّعًا'], 
   'أخراهم': [
            'أُخْرَاهُمْ'], 
   'تهتز': [
          'تَهْتَزُّ'], 
   'وتخرجون': [
             'وَتُخْرِجُونَ'], 
   'وآثارا': [
            'وَآثَارًا'], 
   'فتيان': [
           'فَتَيَانِ'], 
   'سألتم': [
           'سَأَلْتُمْ'], 
   'ويضع': [
          'وَيَضَعُ'], 
   'ويضل': [
          'وَيُضِلُّ'], 
   'لنذيقهم': [
             'لِنُذِيقَهُمْ'], 
   'الأليم': [
            'الْأَلِيمَ',
            'الْأَلِيمِ',
            'الْأَلِيمُ'], 
   'أناس': [
          'أُنَاسٍ',
          'أُنَاسٌ'], 
   'لتأفكنا': [
             'لِتَأْفِكَنَا'], 
   'أصلابكم': [
             'أَصْلَابِكُمْ'], 
   'مغرما': [
           'مَغْرَمًا'], 
   'أناب': [
          'أَنَابَ'], 
   'يغاثوا': [
            'يُغَاثُوا'], 
   'توارت': [
           'تَوَارَتْ'], 
   'سود': [
         'سُودٌ'], 
   'فعموا': [
           'فَعَمُوا'], 
   'أجيبت': [
           'أُجِيبَتْ'], 
   'فأحبط': [
           'فَأَحْبَطَ'], 
   'خبيثة': [
           'خَبِيثَةٍ'], 
   'بفاحشة': [
            'بِفَاحِشَةٍ'], 
   'شطأه': [
          'شَطْأَهُ'], 
   'بسمعهم': [
            'بِسَمْعِهِمْ'], 
   'تمتع': [
          'تَمَتَّعْ',
          'تَمَتَّعَ'], 
   'الحاكمين': [
              'الْحَاكِمِينَ'], 
   'روحنا': [
           'رُوحِنَا',
           'رُوحَنَا'], 
   'فلنحيينه': [
              'فَلَنُحْيِيَنَّهُ'], 
   'تأتي': [
          'تَأْتِي',
          'تَأْتِيَ'], 
   'ويهديك': [
            'وَيَهْدِيَكَ'], 
   'آباءهم': [
            'آبَاءَهُمْ',
            'آبَاءَهُمُ'], 
   'ويأمرون': [
             'وَيَأْمُرُونَ'], 
   'رهوا': [
          'رَهْوًا'], 
   'أنزلتموه': [
              'أَنْزَلْتُمُوهُ'], 
   'يسجن': [
          'يُسْجَنَ'], 
   'صرف': [
         'صَرَفَ'], 
   'لتنزيل': [
            'لَتَنْزِيلُ'], 
   'لأعنتكم': [
             'لَأَعْنَتَكُمْ'], 
   'لنكونن': [
            'لَنَكُونَنَّ'], 
   'الدماء': [
            'الدِّمَاءَ'], 
   'سموم': [
          'سَمُومٍ'], 
   'يضلوا': [
           'يُضِلُّوا'], 
   'اثنين': [
           'اثْنَيْنِ'], 
   'استسقاه': [
             'اسْتَسْقَاهُ'], 
   'تحكمون': [
            'تَحْكُمُونَ'], 
   'بإثمي': [
           'بِإِثْمِي'], 
   'ائتنا': [
           'ائْتِنَا'], 
   'توبوا': [
           'تُوبُوا'], 
   'راد': [
         'رَادَّ'], 
   'فأتى': [
          'فَأَتَى'], 
   'وعن': [
         'وَعَنِ',
         'وَعَنْ'], 
   'وزوجه': [
           'وَزَوْجِهِ'], 
   'وزوجك': [
           'وَزَوْجُكَ'], 
   'وترحمني': [
             'وَتَرْحَمْنِي'], 
   'الوصية': [
            'الْوَصِيَّةِ',
            'الْوَصِيَّةُ'], 
   'صنع': [
         'صُنْعَ'], 
   'وأرض': [
          'وَأَرْضُ'], 
   'زوج': [
         'زَوْجٍ'], 
   'مستضعفين': [
              'مُسْتَضْعَفِينَ'], 
   'فالحكم': [
            'فَالْحُكْمُ'], 
   'لكتاب': [
           'لَكِتَابٌ'], 
   'لقسم': [
          'لَقَسَمٌ'], 
   'الخالقين': [
              'الْخَالِقِينَ'], 
   'وتحيتهم': [
             'وَتَحِيَّتُهُمْ'], 
   'قرية': [
          'قَرْيَةٍ',
          'قَرْيَةً',
          'قَرْيَةٌ'], 
   'حسابيه': [
            'حِسَابِيَهْ'], 
   'وترحمنا': [
             'وَتَرْحَمْنَا'], 
   'يكبتهم': [
            'يَكْبِتَهُمْ'], 
   'مستمسكون': [
              'مُسْتَمْسِكُونَ'], 
   'ظلمهم': [
           'ظَلَمَهُمُ',
           'ظُلْمِهِمْ'], 
   'وأرى': [
          'وَأَرَى'], 
   'وعد': [
         'وَعْدَ',
         'وَعَدَ',
         'وَعْدُ',
         'وُعِدَ',
         'وَعْدٌ'], 
   'ألد': [
         'أَلَدُّ'], 
   'بالبنين': [
             'بِالْبَنِينَ'], 
   'والناس': [
            'وَالنَّاسِ'], 
   'والنار': [
            'وَالنَّارُ'], 
   'ويبغونها': [
              'وَيَبْغُونَهَا'], 
   'الثمن': [
           'الثُّمُنُ'], 
   'الكذاب': [
            'الْكَذَّابُ'], 
   'فكذلك': [
           'فَكَذَلِكَ'], 
   'الصلاة': [
            'الصَّلَاةَ',
            'الصَّلَاةِ',
            'الصَّلَاةُ'], 
   'والنبوة': [
             'وَالنُّبُوَّةَ'], 
   'باليوم': [
            'بِالْيَوْمِ'], 
   'أعرضوا': [
            'أَعْرَضُوا'], 
   'يسجد': [
          'يَسْجُدُ'], 
   'فأحكم': [
           'فَأَحْكُمُ'], 
   'يتخطفكم': [
             'يَتَخَطَّفَكُمُ'], 
   'البغي': [
           'الْبَغْيُ'], 
   'يضلوك': [
           'يُضِلُّوكَ'], 
   'فأرادوا': [
             'فَأَرَادُوا'], 
   'نسائكم': [
            'نِسَائِكُمْ',
            'نِسَائِكُمُ'], 
   'فالذين': [
            'فَالَّذِينَ'], 
   'يضلون': [
           'يُضِلُّونَ',
           'يَضِلُّونَ'], 
   'دعا': [
         'دَعَا',
         'دَعًّا'], 
   'نصبت': [
          'نُصِبَتْ'], 
   'تحكموا': [
            'تَحْكُمُوا'], 
   'داحضة': [
           'دَاحِضَةٌ'], 
   'تذهل': [
          'تَذْهَلُ'], 
   'فليأتوا': [
             'فَلْيَأْتُوا'], 
   'وأبصر': [
           'وَأَبْصِرْ'], 
   'السجود': [
            'السُّجُودِ'], 
   'أخدان': [
           'أَخْدَانٍ'], 
   'استويت': [
            'اسْتَوَيْتَ'], 
   'مهلك': [
          'مُهْلِكَ',
          'مَهْلِكَ'], 
   'تقبل': [
          'تُقْبَلَ',
          'تُقُبِّلَ',
          'تَقَبَّلْ'], 
   'أحمل': [
          'أَحْمِلُ'], 
   'ادارك': [
           'ادَّارَكَ'], 
   'حظا': [
         'حَظًّا'], 
   'تضروه': [
           'تَضُرُّوهُ'], 
   'والشهادة': [
              'وَالشَّهَادَةِ'], 
   'يطعمني': [
            'يُطْعِمُنِي'], 
   'والسلاسل': [
              'وَالسَّلَاسِلُ'], 
   'فأخذناهم': [
              'فَأَخَذْنَاهُمْ'], 
   'لأنعمه': [
            'لِأَنْعُمِهِ'], 
   'همسا': [
          'هَمْسًا'], 
   'المبذرين': [
              'الْمُبَذِّرِينَ'], 
   'يكونا': [
           'يَكُونَا'], 
   'بطغواها': [
             'بِطَغْوَاهَا'], 
   'بكل': [
         'بِكُلِّ',
         'بِكُلٍّ'], 
   'بكم': [
         'بِكُمْ',
         'بِكُمُ',
         'بُكْمٌ'], 
   'تعد': [
         'تَعْدُ'], 
   'وألقوا': [
            'وَأَلْقَوْا'], 
   'ضربنا': [
           'ضَرَبْنَا'], 
   'فيعذبه': [
            'فَيُعَذِّبُهُ'], 
   'يغنوا': [
           'يَغْنَوْا',
           'يُغْنُوا'], 
   'تدرك': [
          'تُدْرِكَ'], 
   'هؤلاء': [
           'هَؤُلَاءِ'], 
   'بكر': [
         'بِكْرٌ'], 
   'تغرب': [
          'تَغْرُبُ'], 
   'سأنبئك': [
            'سَأُنَبِّئُكَ'], 
   'تدري': [
          'تَدْرِي'], 
   'مهلكي': [
           'مُهْلِكِي'], 
   'تجارتهم': [
             'تِجَارَتُهُمْ'], 
   'مخضود': [
           'مَخْضُودٍ'], 
   'المعذرون': [
              'الْمُعَذِّرُونَ'], 
   'أكفاركم': [
             'أَكُفَّارُكُمْ'], 
   'أرضعت': [
           'أَرْضَعَتْ'], 
   'المر': [
          'المر'], 
   'يكتمن': [
           'يَكْتُمْنَ'], 
   'سكنتم': [
           'سَكَنْتُمْ'], 
   'الأقربين': [
              'الْأَقْرَبِينَ'], 
   'بكت': [
         'بَكَتْ'], 
   'وإخوانهم': [
              'وَإِخْوَانِهِمْ',
              'وَإِخْوَانُهُمْ'], 
   'اثنان': [
           'اثْنَانِ'], 
   'طلقتم': [
           'طَلَّقْتُمُ'], 
   'وألقوه': [
            'وَأَلْقُوهُ'], 
   'أنساب': [
           'أَنْسَابَ'], 
   'انقص': [
          'انْقُصْ'], 
   'ساق': [
         'سَاقٍ'], 
   'رجيم': [
          'رَجِيمٍ',
          'رَجِيمٌ'], 
   'يعجب': [
          'يُعْجِبُ'], 
   'قريش': [
          'قُرَيْشٍ'], 
   'ليكون': [
           'لِيَكُونَ'], 
   'وحشر': [
          'وَحُشِرَ'], 
   'بالفتح': [
            'بِالْفَتْحِ'], 
   'رسول': [
          'رَسُولٌ',
          'رَسُولُ',
          'رَسُولٍ',
          'رَسُولَ',
          'رَسُولِ'], 
   'يرسل': [
          'يُرْسِلَ',
          'يُرْسِلُ',
          'يُرْسِلِ',
          'يُرْسَلُ'], 
   'أتراب': [
           'أَتْرَابٌ'], 
   'قائمون': [
            'قَائِمُونَ'], 
   'وطهر': [
          'وَطَهِّرْ'], 
   'ينقذون': [
            'يُنْقِذُونِ',
            'يُنْقَذُونَ'], 
   'فبم': [
         'فَبِمَ'], 
   'أعرضتم': [
            'أَعْرَضْتُمْ'], 
   'يلقاها': [
            'يُلَقَّاهَا'], 
   'فشاربون': [
             'فَشَارِبُونَ'], 
   'ويلك': [
          'وَيْلَكَ'], 
   'سربا': [
          'سَرَبًا'], 
   'سيغلبون': [
             'سَيَغْلِبُونَ'], 
   'ابتلي': [
           'ابْتُلِيَ'], 
   'الصالحون': [
              'الصَّالِحُونَ'], 
   'أخذتهم': [
            'أَخَذْتُهُمْ',
            'أَخَذَتْهُمُ'], 
   'والزبر': [
            'وَالزُّبُرِ'], 
   'أكون': [
          'أَكُونَ'], 
   'الكهف': [
           'الْكَهْفِ'], 
   'والصابئون': [
               'وَالصَّابِئُونَ'], 
   'أراد': [
          'أَرَادَ'], 
   'وليحلفن': [
             'وَلَيَحْلِفُنَّ'], 
   'يمتعكم': [
            'يُمَتِّعْكُمْ'], 
   'مؤجلا': [
           'مُؤَجَّلًا'], 
   'يعصمكم': [
            'يَعْصِمُكُمْ'], 
   'افعل': [
          'افْعَلْ'], 
   'والطيبات': [
              'وَالطَّيِّبَاتِ',
              'وَالطَّيِّبَاتُ'], 
   'الصابرون': [
              'الصَّابِرُونَ'], 
   'ص': [
       'ص'], 
   'أخنه': [
          'أَخُنْهُ'], 
   'الآخرة': [
            'الْآخِرَةِ',
            'الْآخِرَةَ',
            'الْآخِرَةُ'], 
   'لتاركو': [
            'لَتَارِكُو'], 
   'بينهما': [
            'بَيْنَهُمَا',
            'بَيْنِهِمَا'], 
   'بزينة': [
           'بِزِينَةٍ'], 
   'وحسبوا': [
            'وَحَسِبُوا'], 
   'دركا': [
          'دَرَكًا'], 
   'تراني': [
           'تَرَانِي'], 
   'فلعرفتهم': [
              'فَلَعَرَفْتَهُمْ'], 
   'فاهبط': [
           'فَاهْبِطْ'], 
   'أراك': [
          'أَرَاكَ'], 
   'النعيم': [
            'النَّعِيمِ'], 
   'طيبا': [
          'طَيِّبًا'], 
   'أنحن': [
          'أَنَحْنُ'], 
   'فسنيسره': [
             'فَسَنُيَسِّرُهُ'], 
   'فلما': [
          'فَلَمَّا'], 
   'تؤتوا': [
           'تُؤْتُوا'], 
   'كالفجار': [
             'كَالْفُجَّارِ'], 
   'لتحكم': [
           'لِتَحْكُمَ'], 
   'وهدى': [
          'وَهُدًى',
          'وَهَدَى'], 
   'آباؤكم': [
            'آبَاؤُكُمْ'], 
   'أشهد': [
          'أُشْهِدُ',
          'أَشْهَدُ'], 
   'الباقين': [
             'الْبَاقِينَ'], 
   'ينفعك': [
           'يَنْفَعُكَ'], 
   'غافر': [
          'غَافِرِ'], 
   'ينفعه': [
           'يَنْفَعُهُ'], 
   'موعدهم': [
            'مَوْعِدُهُمْ',
            'مَوْعِدَهُمُ'], 
   'لنفس': [
          'لِنَفْسٍ'], 
   'عاهدتم': [
            'عَاهَدْتُمْ'], 
   'لمخرجون': [
             'لَمُخْرَجُونَ'], 
   'مكني': [
          'مَكَّنِّي'], 
   'ويخشون': [
            'وَيَخْشَوْنَ'], 
   'لنفد': [
          'لَنَفِدَ'], 
   'والسحاب': [
             'وَالسَّحَابِ'], 
   'أخذتها': [
            'أَخَذْتُهَا'], 
   'والذاكرين': [
               'وَالذَّاكِرِينَ'], 
   'تصنعون': [
            'تَصْنَعُونَ'], 
   'مجراها': [
            'مَجْرَاهَا'], 
   'لطمسنا': [
            'لَطَمَسْنَا'], 
   'لامرأته': [
             'لِامْرَأَتِهِ'], 
   'لبلد': [
          'لِبَلَدٍ'], 
   'مشرك': [
          'مُشْرِكٍ',
          'مُشْرِكٌ'], 
   'لعنه': [
          'لَعَنَهُ'], 
   'باسم': [
          'بِاسْمِ'], 
   'فأتوهن': [
            'فَأْتُوهُنَّ'], 
   'أثاما': [
           'أَثَامًا'], 
   'تسألوا': [
            'تَسْأَلُوا'], 
   'وأقبل': [
           'وَأَقْبَلَ'], 
   'وثيابك': [
            'وَثِيَابَكَ'], 
   'انظر': [
          'انْظُرْ'], 
   'وقهم': [
          'وَقِهِمْ',
          'وَقِهِمُ'], 
   'افتراه': [
            'افْتَرَاهُ'], 
   'جاءهم': [
           'جَاءَهُمْ',
           'جَاءَهُمُ'], 
   'تغشاها': [
            'تَغَشَّاهَا'], 
   'ودخل': [
          'وَدَخَلَ'], 
   'رزق': [
         'رِزْقٍ',
         'رِزْقِ',
         'رِزْقٌ'], 
   'آلاء': [
          'آلَاءِ',
          'آلَاءَ'], 
   'كلمتنا': [
            'كَلِمَتُنَا'], 
   'تذهبوا': [
            'تَذْهَبُوا'], 
   'غالب': [
          'غَالِبَ',
          'غَالِبٌ'], 
   'معذبوها': [
             'مُعَذِّبُوهَا'], 
   'تفسدوا': [
            'تُفْسِدُوا'], 
   'بالغ': [
          'بَالِغُ',
          'بَالِغَ'], 
   'بالليل': [
            'بِاللَّيْلِ'], 
   'إخراج': [
           'إِخْرَاجٍ'], 
   'فويل': [
          'فَوَيْلٌ'], 
   'أكفرت': [
           'أَكَفَرْتَ'], 
   'بساحتهم': [
             'بِسَاحَتِهِمْ'], 
   'وتأتون': [
            'وَتَأْتُونَ'], 
   'آلاف': [
          'آلَافٍ'], 
   'انصرني': [
            'انْصُرْنِي'], 
   'أذاهم': [
           'أَذَاهُمْ'], 
   'والفضة': [
            'وَالْفِضَّةِ',
            'وَالْفِضَّةَ'], 
   'يحسبهم': [
            'يَحْسَبُهُمُ'], 
   'تذهبون': [
            'تَذْهَبُونَ'], 
   'وعزني': [
           'وَعَزَّنِي'], 
   'يحموم': [
           'يَحْمُومٍ'], 
   'الذكور': [
            'الذُّكُورَ'], 
   'تدخل': [
          'تُدْخِلِ'], 
   'لكما': [
          'لَكُمَا'], 
   'يتضرعون': [
             'يَتَضَرَّعُونَ'], 
   'وصاحبهما': [
              'وَصَاحِبْهُمَا'], 
   'أتوا': [
          'أَتَوْا'], 
   'لعنت': [
          'لَعْنَتَ',
          'لَعَنَتْ'], 
   'ميثاق': [
           'مِيثَاقَ',
           'مِيثَاقٌ',
           'مِيثَاقُ'], 
   'منتصرا': [
            'مُنْتَصِرًا'], 
   'تبور': [
          'تَبُورَ'], 
   'البحار': [
            'الْبِحَارُ'], 
   'أتوب': [
          'أَتُوبُ'], 
   'تسألون': [
            'تُسْأَلُونَ'], 
   'قائمة': [
           'قَائِمَةً',
           'قَائِمَةٌ'], 
   'آتيتني': [
            'آتَيْتَنِي'], 
   'ننهك': [
          'نَنْهَكَ'], 
   'أطعنكم': [
            'أَطَعْنَكُمْ'], 
   'تبوآ': [
          'تَبَوَّآ'], 
   'باسط': [
          'بَاسِطٌ'], 
   'فتنتكم': [
            'فِتْنَتَكُمْ'], 
   'قائما': [
           'قَائِمًا'], 
   'يهلك': [
          'يُهْلِكَ',
          'يُهْلَكُ'], 
   'القادرون': [
              'الْقَادِرُونَ'], 
   'جاءها': [
           'جَاءَهَا'], 
   'الشجرة': [
            'الشَّجَرَةِ',
            'الشَّجَرَةَ'], 
   'حاسبين': [
            'حَاسِبِينَ'], 
   'ولتسألن': [
             'وَلَتُسْأَلُنَّ'], 
   'خضر': [
         'خُضْرٍ',
         'خُضْرٌ'], 
   'المقسطين': [
              'الْمُقْسِطِينَ'], 
   'فليتوكل': [
             'فَلْيَتَوَكَّلِ'], 
   'حرسا': [
          'حَرَسًا'], 
   'سيحلفون': [
             'سَيَحْلِفُونَ'], 
   'متقابلين': [
              'مُتَقَابِلِينَ'], 
   'فمن': [
         'فَمَنْ',
         'فَمَنِ',
         'فَمِنْ',
         'فَمِنَ',
         'فَمَنَّ'], 
   'كتم': [
         'كَتَمَ'], 
   'استخلف': [
            'اسْتَخْلَفَ'], 
   'باتخاذكم': [
              'بِاتِّخَاذِكُمُ'], 
   'جرزا': [
          'جُرُزًا'], 
   'ولوالدي': [
             'وَلِوَالِدَيَّ'], 
   'وبناتكم': [
             'وَبَنَاتُكُمْ'], 
   'محكمات': [
            'مُحْكَمَاتٌ'], 
   'يخسف': [
          'يَخْسِفَ'], 
   'ابتدعوها': [
              'ابْتَدَعُوهَا'], 
   'سعيا': [
          'سَعْيًا'], 
   'أنبئوني': [
             'أَنْبِئُونِي'], 
   'برسالاتي': [
              'بِرِسَالَاتِي'], 
   'نطمس': [
          'نَطْمِسَ'], 
   'خوض': [
         'خَوْضٍ'], 
   'حرقوه': [
           'حَرِّقُوهُ'], 
   'فتردى': [
           'فَتَرْدَى'], 
   'يأتكم': [
           'يَأْتِكُمْ'], 
   'فنفخنا': [
            'فَنَفَخْنَا'], 
   'منتشر': [
           'مُنْتَشِرٌ'], 
   'بالحياة': [
             'بِالْحَيَاةِ'], 
   'بخل': [
         'بَخِلَ'], 
   'مثقلة': [
           'مُثْقَلَةٌ'], 
   'وخيفة': [
           'وَخِيفَةً'], 
   'جاثية': [
           'جَاثِيَةً'], 
   'وتشهد': [
           'وَتَشْهَدُ'], 
   'تلوموني': [
             'تَلُومُونِي'], 
   'وأمواتا': [
             'وَأَمْوَاتًا'], 
   'ترتدوا': [
            'تَرْتَدُّوا'], 
   'ويلعن': [
           'وَيَلْعَنُ'], 
   'تتبعها': [
            'تَتْبَعُهَا'], 
   'ألربك': [
           'أَلِرَبِّكَ'], 
   'ينسفها': [
            'يَنْسِفُهَا'], 
   'يخسر': [
          'يَخْسَرُ'], 
   'مخلصين': [
            'مُخْلِصِينَ'], 
   'عدتهم': [
           'عِدَّتَهُمْ'], 
   'لاهية': [
           'لَاهِيَةً'], 
   'أأنت': [
          'أَأَنْتَ'], 
   'والنصارى': [
              'وَالنَّصَارَى'], 
   'حملت': [
          'حَمَلَتْ'], 
   'ونعيم': [
           'وَنَعِيمٍ'], 
   'نغرقهم': [
            'نُغْرِقْهُمْ'], 
   'تستترون': [
             'تَسْتَتِرُونَ'], 
   'وأياما': [
            'وَأَيَّامًا'], 
   'بخلاقكم': [
             'بِخَلَاقِكُمْ'], 
   'فما': [
         'فَمَا'], 
   'التابوت': [
             'التَّابُوتِ',
             'التَّابُوتُ'], 
   'تالله': [
           'تَاللَّهِ'], 
   'لتذهبوا': [
             'لِتَذْهَبُوا'], 
   'فستذكرون': [
              'فَسَتَذْكُرُونَ'], 
   'المرء': [
           'الْمَرْءِ',
           'الْمَرْءُ'], 
   'بالغة': [
           'بَالِغَةٌ'], 
   'وعنت': [
          'وَعَنَتِ'], 
   'الظن': [
          'الظَّنَّ',
          'الظَّنِّ'], 
   'حسبانا': [
            'حُسْبَانًا'], 
   'أبنائهن': [
             'أَبْنَائِهِنَّ'], 
   'نتلوها': [
            'نَتْلُوهَا'], 
   'وليكتب': [
            'وَلْيَكْتُبْ'], 
   'فأنساه': [
            'فَأَنْسَاهُ'], 
   'سنشد': [
          'سَنَشُدُّ'], 
   'فسيحشرهم': [
              'فَسَيَحْشُرُهُمْ'], 
   'متخذات': [
            'مُتَّخِذَاتِ'], 
   'بيمينك': [
            'بِيَمِينِكَ'], 
   'الصحف': [
           'الصُّحُفِ',
           'الصُّحُفُ'], 
   'تسمع': [
          'تُسْمِعُ',
          'تَسْمَعُ',
          'تَسْمَعْ'], 
   'بيمينه': [
            'بِيَمِينِهِ'], 
   'البعيد': [
            'الْبَعِيدُ',
            'الْبَعِيدِ'], 
   'وكفرا': [
           'وَكُفْرًا'], 
   'حين': [
         'حِينٍ',
         'حِينَ',
         'حِينِ',
         'حِينٌ'], 
   'تخطه': [
          'تَخُطُّهُ'], 
   'النهى': [
           'النُّهَى'], 
   'فيجعله': [
            'فَيَجْعَلَهُ'], 
   'والأسباط': [
              'وَالْأَسْبَاطِ',
              'وَالْأَسْبَاطَ'], 
   'يفعل': [
          'يَفْعَلُ',
          'يَفْعَلْ',
          'يُفْعَلُ',
          'يُفْعَلَ'], 
   'مفرطون': [
            'مُفْرَطُونَ'], 
   'فاجتباه': [
             'فَاجْتَبَاهُ'], 
   'سابق': [
          'سَابِقُ',
          'سَابِقٌ'], 
   'وظالم': [
           'وَظَالِمٌ'], 
   'نكن': [
         'نَكُنْ'], 
   'والوتر': [
            'وَالْوَتْرِ'], 
   'خلطوا': [
           'خَلَطُوا'], 
   'نكر': [
         'نُكُرٍ'], 
   'وخضتم': [
           'وَخُضْتُمْ'], 
   'حيا': [
         'حَيًّا'], 
   'نكص': [
         'نَكَصَ'], 
   'رجسهم': [
           'رِجْسِهِمْ'], 
   'فتهاجروا': [
              'فَتُهَاجِرُوا'], 
   'فالآن': [
           'فَالْآنَ'], 
   'حيث': [
         'حَيْثُ'], 
   'ائت': [
         'ائْتِ'], 
   'الصديق': [
            'الصِّدِّيقُ'], 
   'فاسجدوا': [
             'فَاسْجُدُوا'], 
   'أحياكم': [
            'أَحْيَاكُمْ'], 
   'آتيكم': [
           'آتِيكُمْ'], 
   'واسجدوا': [
             'وَاسْجُدُوا'], 
   'صدقكم': [
           'صَدَقَكُمُ'], 
   'لمثل': [
          'لِمِثْلِ'], 
   'وجاهدهم': [
             'وَجَاهِدْهُمْ'], 
   'مسجد': [
          'مَسْجِدٍ'], 
   'نحيي': [
          'نُحْيِي'], 
   'وجيها': [
           'وَجِيهًا'], 
   'حكمتم': [
           'حَكَمْتُمْ'], 
   'أدباركم': [
             'أَدْبَارِكُمْ'], 
   'ويربي': [
           'وَيُرْبِي'], 
   'يستغيثوا': [
              'يَسْتَغِيثُوا'], 
   'مولى': [
          'مَوْلَى',
          'مَوْلًى'], 
   'لآكلون': [
            'لَآكِلُونَ'], 
   'رزقها': [
           'رِزْقُهَا',
           'رِزْقَهَا'], 
   'السحرة': [
            'السَّحَرَةُ',
            'السَّحَرَةَ'], 
   'فأتبعه': [
            'فَأَتْبَعَهُ'], 
   'نشأ': [
         'نَشَأْ'], 
   'يكذب': [
          'يُكَذِّبُ'], 
   'نفسك': [
          'نَفْسِكَ',
          'نَفْسَكَ',
          'نَفْسُكَ'], 
   'أولاهم': [
            'أُولَاهُمْ'], 
   'وأولادكم': [
              'وَأَوْلَادُكُمْ',
              'وَأَوْلَادِكُمْ'], 
   'يرجع': [
          'يَرْجِعُ',
          'يُرْجَعُ',
          'يَرْجِعَ'], 
   'تموت': [
          'تَمُوتُ',
          'تَمُوتَ'], 
   'أأتخذ': [
           'أَأَتَّخِذُ'], 
   'تقرضهم': [
            'تَقْرِضُهُمْ'], 
   'بالمتقين': [
              'بِالْمُتَّقِينَ'], 
   'الولي': [
           'الْوَلِيُّ'], 
   'قاب': [
         'قَابَ'], 
   'بمقعدهم': [
             'بِمَقْعَدِهِمْ'], 
   'جهولا': [
           'جَهُولًا'], 
   'والطيب': [
            'وَالطَّيِّبُ'], 
   'يضرون': [
           'يَضُرُّونَ'], 
   'رحم': [
         'رَحِمَ'], 
   'رحل': [
         'رَحْلِ'], 
   'يضروك': [
           'يَضُرُّوكَ'], 
   'شهود': [
          'شُهُودٌ'], 
   'وعدناه': [
            'وَعَدْنَاهُ'], 
   'يدبر': [
          'يُدَبِّرُ'], 
   'مجرما': [
           'مُجْرِمًا'], 
   'بأمانيكم': [
              'بِأَمَانِيِّكُمْ'], 
   'قلبه': [
          'قَلْبِهِ',
          'قَلْبَهُ',
          'قَلْبُهُ'], 
   'السابقون': [
              'السَّابِقُونَ'], 
   'للموقنين': [
              'لِلْمُوقِنِينَ'], 
   'قلبك': [
          'قَلْبِكَ'], 
   'أتوك': [
          'أَتَوْكَ'], 
   'بأهله': [
           'بِأَهْلِهِ'], 
   'يؤتين': [
           'يُؤْتِيَنِ'], 
   'صالحين': [
            'صَالِحِينَ',
            'صَالِحَيْنِ'], 
   'بأهلك': [
           'بِأَهْلِكَ'], 
   'المسلمون': [
              'الْمُسْلِمُونَ'], 
   'المعتدون': [
              'الْمُعْتَدُونَ'], 
   'يضروا': [
           'يَضُرُّوا'], 
   'عليين': [
           'عِلِّيِّينَ'], 
   'درجة': [
          'دَرَجَةً',
          'دَرَجَةٌ'], 
   'يأتيانها': [
              'يَأْتِيَانِهَا'], 
   'معك': [
         'مَعَكَ'], 
   'ندعوه': [
           'نَدْعُوهُ'], 
   'قادرون': [
            'قَادِرُونَ'], 
   'معه': [
         'مَعَهُ'], 
   'ممطرنا': [
            'مُمْطِرُنَا'], 
   'معي': [
         'مَعِيَ'], 
   'رزقهم': [
           'رَزَقَهُمْ',
           'رَزَقَهُمُ',
           'رِزْقِهِمْ',
           'رِزْقُهُمْ'], 
   'يرجو': [
          'يَرْجُو'], 
   'الوتين': [
            'الْوَتِينَ'], 
   'أحصرتم': [
            'أُحْصِرْتُمْ'], 
   'يسبحون': [
            'يُسَبِّحُونَ',
            'يَسْبَحُونَ'], 
   'وجعلوا': [
            'وَجَعَلُوا'], 
   'معاذ': [
          'مَعَاذَ'], 
   'نفسا': [
          'نَفْسًا'], 
   'معايش': [
           'مَعَايِشَ'], 
   'عاديتم': [
            'عَادَيْتُمْ'], 
   'قاض': [
         'قَاضٍ'], 
   'قولنا': [
           'قَوْلُنَا'], 
   'نزلة': [
          'نَزْلَةً'], 
   'النبوة': [
            'النُّبُوَّةَ'], 
   'عبادا': [
           'عِبَادًا'], 
   'يسخر': [
          'يَسْخَرْ'], 
   'لنخرجن': [
            'لَنَخْرُجَنَّ'], 
   'تناجيتم': [
             'تَنَاجَيْتُمْ'], 
   'وبعثنا': [
            'وَبَعَثْنَا'], 
   'وزيناها': [
             'وَزَيَّنَّاهَا'], 
   'فؤاد': [
          'فُؤَادُ'], 
   'مجرميها': [
             'مُجْرِمِيهَا'], 
   'أولادهن': [
             'أَوْلَادَهُنَّ'], 
   'أولادهم': [
             'أَوْلَادُهُمْ',
             'أَوْلَادِهِمْ',
             'أَوْلَادَهُمْ'], 
   'صوت': [
         'صَوْتِ'], 
   'زيغ': [
         'زَيْغٌ'], 
   'خبير': [
          'خَبِيرٌ',
          'خَبِيرٍ'], 
   'بخالصة': [
            'بِخَالِصَةٍ'], 
   'فضلكم': [
           'فَضَّلَكُمْ'], 
   'أرنا': [
          'أَرِنَا'], 
   'قيما': [
          'قِيَمًا',
          'قَيِّمًا'], 
   'أغرقنا': [
            'أَغْرَقْنَا'], 
   'الوثاق': [
            'الْوَثَاقَ'], 
   'تكبيرا': [
            'تَكْبِيرًا'], 
   'بالسنين': [
             'بِالسِّنِينَ'], 
   'فصالا': [
           'فِصَالًا'], 
   'دأب': [
         'دَأْبِ'], 
   'فأنتم': [
           'فَأَنْتُمْ'], 
   'الخالدين': [
              'الْخَالِدِينَ'], 
   'الزبد': [
           'الزَّبَدُ'], 
   'فوسوس': [
           'فَوَسْوَسَ'], 
   'زين': [
         'زُيِّنَ',
         'زَيَّنَ'], 
   'انقلب': [
           'انْقَلَبَ'], 
   'الزبر': [
           'الزُّبُرِ'], 
   'ونجيناه': [
             'وَنَجَّيْنَاهُ'], 
   'أتنبئون': [
             'أَتُنَبِّئُونَ'], 
   'مواقعوها': [
              'مُوَاقِعُوهَا'], 
   'المتربصين': [
               'الْمُتَرَبِّصِينَ'], 
   'عبادي': [
           'عِبَادِي',
           'عِبَادِيَ'], 
   'ليتساءلوا': [
               'لِيَتَسَاءَلُوا'], 
   'فغوى': [
          'فَغَوَى'], 
   'أكفره': [
           'أَكْفَرَهُ'], 
   'أنسجد': [
           'أَنَسْجُدُ'], 
   'عبادك': [
           'عِبَادِكَ',
           'عِبَادَكَ',
           'عِبَادُكَ'], 
   'حديدا': [
           'حَدِيدًا'], 
   'عباده': [
           'عِبَادِهِ',
           'عِبَادَهُ'], 
   'لتعلم': [
           'لَتَعْلَمُ'], 
   'وتقسطوا': [
             'وَتُقْسِطُوا'], 
   'قراطيس': [
            'قَرَاطِيسَ'], 
   'ليحكم': [
           'لِيَحْكُمَ',
           'لَيَحْكُمُ'], 
   'ويهدي': [
           'وَيَهْدِي'], 
   'يستنقذوه': [
              'يَسْتَنْقِذُوهُ'], 
   'ظلمه': [
          'ظُلْمِهِ'], 
   'قارعة': [
           'قَارِعَةٌ'], 
   'فليأتنا': [
             'فَلْيَأْتِنَا'], 
   'ظلمك': [
          'ظَلَمَكَ'], 
   'فغشيهم': [
            'فَغَشِيَهُمْ'], 
   'تبدل': [
          'تُبَدَّلُ',
          'تَبَدَّلَ'], 
   'ليجعل': [
           'لِيَجْعَلَ'], 
   'رسالته': [
            'رِسَالَتَهُ'], 
   'فطرني': [
           'فَطَرَنِي'], 
   'ستجدني': [
            'سَتَجِدُنِي'], 
   'لأمر': [
          'لِأَمْرِ'], 
   'سخط': [
         'سَخِطَ'], 
   'ليعلمون': [
             'لَيَعْلَمُونَ'], 
   'سخر': [
         'سَخَّرَ',
         'سَخِرَ'], 
   'ليلها': [
           'لَيْلَهَا'], 
   'قطنا': [
          'قِطَّنَا'], 
   'وبينهم': [
            'وَبَيْنَهُمْ'], 
   'كدأب': [
          'كَدَأْبِ'], 
   'المرسلين': [
              'الْمُرْسَلِينَ'], 
   'وانطلق': [
            'وَانْطَلَقَ'], 
   'أتاهم': [
           'أَتَاهُمْ'], 
   'تفرون': [
           'تَفِرُّونَ'], 
   'فزينوا': [
            'فَزَيَّنُوا'], 
   'يعلمان': [
            'يُعَلِّمَانِ'], 
   'أحمد': [
          'أَحْمَدُ'], 
   'فاحذروهم': [
              'فَاحْذَرُوهُمْ'], 
   'مصلى': [
          'مُصَلًّى'], 
   'وألقيت': [
            'وَأَلْقَيْتُ'], 
   'قطعتم': [
           'قَطَعْتُمْ'], 
   'العمى': [
           'الْعَمَى'], 
   'العمي': [
           'الْعُمْيِ',
           'الْعُمْيَ'], 
   'مفتر': [
          'مُفْتَرٍ'], 
   'أتاها': [
           'أَتَاهَا'], 
   'كانا': [
          'كَانَا'], 
   'آباؤنا': [
            'آبَاؤُنَا'], 
   'كانت': [
          'كَانَتْ',
          'كَانَتِ'], 
   'لبوس': [
          'لَبُوسٍ'], 
   'ويثبت': [
           'وَيُثْبِتُ',
           'وَيُثَبِّتْ',
           'وَيُثَبِّتَ'], 
   'أمتعكن': [
            'أُمَتِّعْكُنَّ'], 
   'وليهما': [
            'وَلِيُّهُمَا'], 
   'ونزداد': [
            'وَنَزْدَادُ'], 
   'خصاصة': [
           'خَصَاصَةٌ'], 
   'واسترهبوهم': [
                'وَاسْتَرْهَبُوهُمْ'], 
   'ظلما': [
          'ظُلْمًا'], 
   'فطرنا': [
           'فَطَرَنَا'], 
   'يخصمون': [
            'يَخِصِّمُونَ'], 
   'حسنة': [
          'حَسَنَةٌ',
          'حَسَنَةً',
          'حَسَنَةٍ'], 
   'فليستجيبوا': [
                'فَلْيَسْتَجِيبُوا'], 
   'نزاعة': [
           'نَزَّاعَةً'], 
   'رءوسكم': [
            'رُءُوسَكُمْ'], 
   'تسوى': [
          'تُسَوَّى'], 
   'حسنا': [
          'حَسَنًا',
          'حُسْنًا'], 
   'لآياتنا': [
             'لِآيَاتِنَا'], 
   'بلسانك': [
            'بِلِسَانِكَ'], 
   'عقباها': [
            'عُقْبَاهَا'], 
   'ويخرون': [
            'وَيَخِرُّونَ'], 
   'لرقيك': [
           'لِرُقِيِّكَ'], 
   'السدرة': [
            'السِّدْرَةَ'], 
   'ذراعا': [
           'ذِرَاعًا'], 
   'وقالوا': [
            'وَقَالُوا'], 
   'ليبلونكم': [
              'لَيَبْلُوَنَّكُمُ'], 
   'ارتضى': [
           'ارْتَضَى'], 
   'ووهبنا': [
            'وَوَهَبْنَا'], 
   'آمين': [
          'آمِّينَ'], 
   'وأخرجوهم': [
              'وَأَخْرِجُوهُمْ'], 
   'ريبهم': [
           'رَيْبِهِمْ'], 
   'وكأسا': [
           'وَكَأْسًا'], 
   'قوتلوا': [
            'قُوتِلُوا'], 
   'والباقيات': [
               'وَالْبَاقِيَاتُ'], 
   'المحتظر': [
             'الْمُحْتَظِرِ'], 
   'نك': [
        'نَكُ'], 
   'فتح': [
         'فَتْحٌ',
         'فَتَحَ'], 
   'يصدقني': [
            'يُصَدِّقُنِي'], 
   'فكلا': [
          'فَكُلًّا',
          'فَكُلَا'], 
   'وثامنهم': [
             'وَثَامِنُهُمْ'], 
   'بكتابكم': [
             'بِكِتَابِكُمْ'], 
   'جاءه': [
          'جَاءَهُ'], 
   'توفى': [
          'تُوَفَّى'], 
   'نسويكم': [
            'نُسَوِّيكُمْ'], 
   'حكيما': [
           'حَكِيمًا'], 
   'تراود': [
           'تُرَاوِدُ'], 
   'سمعتموه': [
             'سَمِعْتُمُوهُ'], 
   'وماروت': [
            'وَمَارُوتَ'], 
   'الطريقة': [
             'الطَّرِيقَةِ'], 
   'بعضهم': [
           'بَعْضُهُمْ',
           'بَعْضَهُمْ'], 
   'مكرمون': [
            'مُكْرَمُونَ'], 
   'نشهد': [
          'نَشْهَدُ'], 
   'أخلق': [
          'أَخْلُقُ'], 
   'فنتبرأ': [
            'فَنَتَبَرَّأَ'], 
   'أتتهم': [
           'أَتَتْهُمْ'], 
   'يؤلف': [
          'يُؤَلِّفُ'], 
   'المشرق': [
            'الْمَشْرِقِ',
            'الْمَشْرِقُ'], 
   'السدين': [
            'السَّدَّيْنِ'], 
   'أفضتم': [
           'أَفَضْتُمْ'], 
   'فعجل': [
          'فَعَجَّلَ'], 
   'آذن': [
         'آذَنَ'], 
   'تقرضوا': [
            'تُقْرِضُوا'], 
   'يعطيك': [
           'يُعْطِيكَ'], 
   'شانئك': [
           'شَانِئَكَ'], 
   'ويحل': [
          'وَيَحِلُّ',
          'وَيُحِلُّ'], 
   'هيهات': [
           'هَيْهَاتَ'], 
   'الزجاجة': [
             'الزُّجَاجَةُ'], 
   'يحزنون': [
            'يَحْزَنُونَ'], 
   'قبضته': [
           'قَبْضَتُهُ'], 
   'بعدتهم': [
            'بِعِدَّتِهِمْ'], 
   'لمثوبة': [
            'لَمَثُوبَةٌ'], 
   'بريئا': [
           'بَرِيئًا'], 
   'ينظروا': [
            'يَنْظُرُوا'], 
   'يقض': [
         'يَقْضِ'], 
   'وشهد': [
          'وَشَهِدَ'], 
   'يخروا': [
           'يَخِرُّوا'], 
   'النطفة': [
            'النُّطْفَةَ'], 
   'خائنة': [
           'خَائِنَةَ',
           'خَائِنَةٍ'], 
   'توجه': [
          'تَوَجَّهَ'], 
   'توجل': [
          'تَوْجَلْ'], 
   'ملاق': [
          'مُلَاقٍ'], 
   'جنودا': [
           'جُنُودًا'], 
   'قدمتم': [
           'قَدَّمْتُمْ'], 
   'فتى': [
         'فَتًى'], 
   'الدنيا': [
            'الدُّنْيَا'], 
   'لتحصنكم': [
             'لِتُحْصِنَكُمْ'], 
   'راودته': [
            'رَاوَدْتُهُ'], 
   'يرزقكم': [
            'يَرْزُقُكُمْ'], 
   'والصبح': [
            'وَالصُّبْحِ'], 
   'ونفور': [
           'وَنُفُورٍ'], 
   'رفيقا': [
           'رَفِيقًا'], 
   'ظلم': [
         'ظَلَمَ',
         'ظُلْمَ',
         'ظُلِمَ'], 
   'ظلل': [
         'ظُلَلٌ',
         'ظُلَلٍ'], 
   'ليحملوا': [
             'لِيَحْمِلُوا'], 
   'موقوتا': [
            'مَوْقُوتًا'], 
   'وانشق': [
           'وَانْشَقَّ'], 
   'الراجفة': [
             'الرَّاجِفَةُ'], 
   'جاء': [
         'جَاءَ'], 
   'إياك': [
          'إِيَّاكَ'], 
   'ردوه': [
          'رَدُّوهُ'], 
   'تصدقون': [
            'تُصَدِّقُونَ'], 
   'هاروت': [
           'هَارُوتَ'], 
   'لليتامى': [
             'لِلْيَتَامَى'], 
   'لنوره': [
           'لِنُورِهِ'], 
   'فقدره': [
           'فَقَدَّرَهُ'], 
   'آل': [
        'آلَ',
        'آلِ',
        'آلُ'], 
   'أغويتني': [
             'أَغْوَيْتَنِي'], 
   'أتاكم': [
           'أَتَاكُمْ'], 
   'أثيم': [
          'أَثِيمٍ'], 
   'فأكرمه': [
            'فَأَكْرَمَهُ'], 
   'يدع': [
         'يَدْعُ',
         'يَدُعُّ'], 
   'تراض': [
          'تَرَاضٍ'], 
   'رأته': [
          'رَأَتْهُ'], 
   'أندعو': [
           'أَنَدْعُو'], 
   'تراب': [
          'تُرَابٍ',
          'تُرَابٌ'], 
   'فاتكم': [
           'فَاتَكُمْ'], 
   'بيوت': [
          'بُيُوتِ',
          'بُيُوتَ',
          'بُيُوتٍ'], 
   'يدا': [
         'يَدَا'], 
   'خاشعون': [
            'خَاشِعُونَ'], 
   'لنرسل': [
           'لِنُرْسِلَ'], 
   'ورفعناه': [
             'وَرَفَعْنَاهُ'], 
   'تفيء': [
          'تَفِيءَ'], 
   'ونبئهم': [
            'وَنَبِّئْهُمْ'], 
   'نأكل': [
          'نَأْكُلَ'], 
   'ويسارعون': [
              'وَيُسَارِعُونَ'], 
   'يحكمان': [
            'يَحْكُمَانِ'], 
   'يدك': [
         'يَدَكَ'], 
   'ينعق': [
          'يَنْعِقُ'], 
   'تفيض': [
          'تَفِيضُ'], 
   'تلفح': [
          'تَلْفَحُ'], 
   'يدي': [
         'يَدَيْ',
         'يَدَيَّ',
         'يَدِيَ',
         'يَدَيِ'], 
   'بيوم': [
          'بِيَوْمِ'], 
   'لشتى': [
          'لَشَتَّى'], 
   'معطلة': [
           'مُعَطَّلَةٍ'], 
   'لقيتم': [
           'لَقِيتُمُ',
           'لَقِيتُمْ'], 
   'السجل': [
           'السِّجِلِّ'], 
   'ظلا': [
         'ظِلًّا'], 
   'ليؤذن': [
           'لِيُؤْذَنَ'], 
   'ويهيئ': [
           'وَيُهَيِّئْ'], 
   'نجاكم': [
           'نَجَّاكُمْ'], 
   'خشعا': [
          'خُشَّعًا'], 
   'الحكم': [
           'الْحُكْمُ',
           'الْحُكْمَ'], 
   'جان': [
         'جَانٌّ'], 
   'ظلت': [
         'ظَلْتَ'], 
   'ظلة': [
         'ظُلَّةٌ'], 
   'كفيناك': [
            'كَفَيْنَاكَ'], 
   'أساءوا': [
            'أَسَاءُوا'], 
   'هارون': [
           'هَارُونَ',
           'هَارُونُ'], 
   'افترى': [
           'افْتَرَى'], 
   'قسمنا': [
           'قَسَمْنَا'], 
   'والمسجد': [
             'وَالْمَسْجِدِ'], 
   'فاخشوهم': [
             'فَاخْشَوْهُمْ'], 
   'فالتقطه': [
             'فَالْتَقَطَهُ'], 
   'للخروج': [
            'لِلْخُرُوجِ'], 
   'بهذا': [
          'بِهَذَا'], 
   'فهي': [
         'فَهِيَ'], 
   'شرك': [
         'شِرْكٌ',
         'شِرْكٍ'], 
   'ونقلب': [
           'وَنُقَلِّبُ'], 
   'فهم': [
         'فَهُمْ',
         'فَهُمُ'], 
   'أعمالهم': [
             'أَعْمَالَهُمْ',
             'أَعْمَالُهُمْ',
             'أَعْمَالِهِمْ'], 
   'لأنت': [
          'لَأَنْتَ'], 
   'أليس': [
          'أَلَيْسَ'], 
   'اللطيف': [
            'اللَّطِيفُ'], 
   'فقولوا': [
            'فَقُولُوا'], 
   'ويولون': [
            'وَيُوَلُّونَ'], 
   'فادارأتم': [
              'فَادَّارَأْتُمْ'], 
   'يعيدكم': [
            'يُعِيدُكُمْ',
            'يُعِيدَكُمْ'], 
   'إذ': [
        'إِذْ',
        'إِذِ'], 
   'لأكونن': [
            'لَأَكُونَنَّ'], 
   'جذاذا': [
           'جُذَاذًا'], 
   'يفتنون': [
            'يُفْتَنُونَ'], 
   'يفتنوك': [
            'يَفْتِنُوكَ'], 
   'العبد': [
           'الْعَبْدُ'], 
   'بالرسل': [
            'بِالرُّسُلِ'], 
   'فالتاليات': [
               'فَالتَّالِيَاتِ'], 
   'تحيد': [
          'تَحِيدُ'], 
   'وذلك': [
          'وَذَلِكَ'], 
   'تحية': [
          'تَحِيَّةً'], 
   'مشيدة': [
           'مُشَيَّدَةٍ'], 
   'لتكبروا': [
             'لِتُكَبِّرُوا'], 
   'أنذرناكم': [
              'أَنْذَرْنَاكُمْ'], 
   'برسوله': [
            'بِرَسُولِهِ'], 
   'يسمعوا': [
            'يَسْمَعُوا'], 
   'تكون': [
          'تَكُونَ',
          'تَكُونُ'], 
   'سخريا': [
           'سِخْرِيًّا',
           'سُخْرِيًّا'], 
   'نزلهم': [
           'نُزُلُهُمْ'], 
   'جئتنا': [
           'جِئْتَنَا'], 
   'وأعوذ': [
           'وَأَعُوذُ'], 
   'والصادقات': [
               'وَالصَّادِقَاتِ'], 
   'تسجد': [
          'تَسْجُدَ'], 
   'يخرج': [
          'يَخْرُجُ',
          'يُخْرِجُ',
          'يُخْرِجْ',
          'يُخْرِجَ',
          'يَخْرُجْ'], 
   'معكما': [
           'مَعَكُمَا'], 
   'نكذب': [
          'نُكَذِّبُ',
          'نُكَذِّبَ'], 
   'سلسلة': [
           'سِلْسِلَةٍ'], 
   'غنمتم': [
           'غَنِمْتُمْ'], 
   'مخلصون': [
            'مُخْلِصُونَ'], 
   'فعسى': [
          'فَعَسَى'], 
   'فأخذتكم': [
             'فَأَخَذَتْكُمُ'], 
   'الساجدين': [
              'السَّاجِدِينَ'], 
   'ورثة': [
          'وَرَثَةِ'], 
   'يسمعون': [
            'يَسْمَعُونَ',
            'يَسَّمَّعُونَ'], 
   'مطمئن': [
           'مُطْمَئِنٌّ'], 
   'شرا': [
         'شَرًّا'], 
   'والأنفس': [
             'وَالْأَنْفُسِ'], 
   'أليم': [
          'أَلِيمٌ',
          'أَلِيمٍ'], 
   'للحي': [
          'لِلْحَيِّ'], 
   'بإسحاق': [
            'بِإِسْحَاقَ'], 
   'شرح': [
         'شَرَحَ'], 
   'كعصف': [
          'كَعَصْفٍ'], 
   'نسقيكم': [
            'نُسْقِيكُمْ'], 
   'شرب': [
         'شِرْبُ',
         'شِرْبٍ',
         'شِرْبٌ',
         'شُرْبَ',
         'شَرِبَ'], 
   'فعتوا': [
           'فَعَتَوْا'], 
   'قبيلا': [
           'قَبِيلًا'], 
   'حدب': [
         'حَدَبٍ'], 
   'تكذيب': [
           'تَكْذِيبٍ'], 
   'وتكفرون': [
             'وَتَكْفُرُونَ'], 
   'بغضب': [
          'بِغَضَبٍ'], 
   'شرع': [
         'شَرَعَ'], 
   'فراق': [
          'فِرَاقُ'], 
   'يبدلوا': [
            'يُبَدِّلُوا'], 
   'وفتح': [
          'وَفَتْحٌ'], 
   'تستأنسوا': [
              'تَسْتَأْنِسُوا'], 
   'كشفنا': [
           'كَشَفْنَا'], 
   'الصدق': [
           'الصِّدْقِ'], 
   'يحتسب': [
           'يَحْتَسِبُ'], 
   'الوارث': [
            'الْوَارِثِ'], 
   'وكواعب': [
            'وَكَوَاعِبَ'], 
   'وهؤلاء': [
            'وَهَؤُلَاءِ'], 
   'بعضه': [
          'بَعْضَهُ'], 
   'تحلوا': [
           'تُحِلُّوا'], 
   'قريتكم': [
            'قَرْيَتِكُمْ'], 
   'فانظري': [
            'فَانْظُرِي'], 
   'بأنا': [
          'بِأَنَّا'], 
   'ورسول': [
           'وَرَسُولٌ'], 
   'يصنع': [
          'يَصْنَعُ'], 
   'وادكر': [
           'وَادَّكَرَ'], 
   'غصبا': [
          'غَصْبًا'], 
   'وتزكيهم': [
             'وَتُزَكِّيهِمْ'], 
   'مشارق': [
           'مَشَارِقَ'], 
   'وفضلناهم': [
              'وَفَضَّلْنَاهُمْ'], 
   'الخوف': [
           'الْخَوْفِ',
           'الْخَوْفُ'], 
   'يؤثر': [
          'يُؤْثَرُ'], 
   'والحج': [
           'وَالْحَجِّ'], 
   'لمنكم': [
           'لَمِنْكُمْ'], 
   'المنفوش': [
             'الْمَنْفُوشِ'], 
   'والحب': [
           'وَالْحَبُّ'], 
   'وذرياتهم': [
              'وَذُرِّيَّاتِهِمْ'], 
   'ممنون': [
           'مَمْنُونٍ'], 
   'أمثالكم': [
             'أَمْثَالُكُمْ',
             'أَمْثَالَكُمْ'], 
   'بأنه': [
          'بِأَنَّهُ'], 
   'انقلبوا': [
             'انْقَلَبُوا'], 
   'المعمور': [
             'الْمَعْمُورِ'], 
   'بأسماء': [
            'بِأَسْمَاءِ'], 
   'فالتمسوا': [
              'فَالْتَمِسُوا'], 
   'لافتدوا': [
             'لَافْتَدَوْا'], 
   'خزنتها': [
            'خَزَنَتُهَا'], 
   'ينحتون': [
            'يَنْحِتُونَ'], 
   'مقبوضة': [
            'مَقْبُوضَةٌ'], 
   'بطني': [
          'بَطْنِي'], 
   'ومبشرا': [
            'وَمُبَشِّرًا'], 
   'والملائكة': [
               'وَالْمَلَائِكَةُ',
               'وَالْمَلَائِكَةِ'], 
   'فنظر': [
          'فَنَظَرَ'], 
   'كهيعص': [
           'كهيعص'], 
   'متجاورات': [
              'مُتَجَاوِرَاتٌ'], 
   'رسولكم': [
            'رَسُولَكُمْ',
            'رَسُولَكُمُ'], 
   'يحرفون': [
            'يُحَرِّفُونَ'], 
   'رددناه': [
            'رَدَدْنَاهُ'], 
   'بالطاغية': [
              'بِالطَّاغِيَةِ'], 
   'امرأتي': [
            'امْرَأَتِي'], 
   'فأوحى': [
           'فَأَوْحَى'], 
   'الغي': [
          'الْغَيِّ'], 
   'لتبلغوا': [
             'لِتَبْلُغُوا'], 
   'ووصينا': [
            'وَوَصَّيْنَا'], 
   'امرأتك': [
            'امْرَأَتَكَ'], 
   'بعضا': [
          'بَعْضًا'], 
   'امرأته': [
            'امْرَأَتَهُ',
            'امْرَأَتُهُ'], 
   'للكفر': [
           'لِلْكُفْرِ'], 
   'وسعة': [
          'وَسَعَةً'], 
   'وسعت': [
          'وَسِعْتَ',
          'وَسِعَتْ'], 
   'قبلة': [
          'قِبْلَةً',
          'قِبْلَةَ'], 
   'قبلا': [
          'قُبُلًا'], 
   'فتأتيهم': [
             'فَتَأْتِيَهُمْ'], 
   'حاد': [
         'حَادَّ'], 
   'يعقلها': [
            'يَعْقِلُهَا'], 
   'نشرك': [
          'نُشْرِكَ'], 
   'الرقاب': [
            'الرِّقَابِ'], 
   'وراودته': [
             'وَرَاوَدَتْهُ'], 
   'أحسن': [
          'أَحْسَنُ',
          'أَحْسَنَ',
          'أَحْسَنِ'], 
   'حاش': [
         'حَاشَ'], 
   'وينشر': [
           'وَيَنْشُرُ'], 
   'وجعلني': [
            'وَجَعَلَنِي'], 
   'لمعكم': [
           'لَمَعَكُمْ'], 
   'وسعر': [
          'وَسُعُرٍ'], 
   'نفرق': [
          'نُفَرِّقُ'], 
   'وتسود': [
           'وَتَسْوَدُّ'], 
   'أيبتغون': [
             'أَيَبْتَغُونَ'], 
   'وانقلبوا': [
              'وَانْقَلَبُوا'], 
   'فمتعوهن': [
             'فَمَتِّعُوهُنَّ'], 
   'وهديناهما': [
               'وَهَدَيْنَاهُمَا'], 
   'ونساءنا': [
             'وَنِسَاءَنَا'], 
   'يؤتوا': [
           'يُؤْتُوا'], 
   'فأصبحوا': [
             'فَأَصْبَحُوا'], 
   'تحبون': [
           'تُحِبُّونَ'], 
   'للمحسنات': [
              'لِلْمُحْسِنَاتِ'], 
   'ردف': [
         'رَدِفَ'], 
   'يخرجونهم': [
              'يُخْرِجُونَهُمْ'], 
   'ذلكم': [
          'ذَلِكُمْ',
          'ذَلِكُمُ'], 
   'خلقناكم': [
             'خَلَقْنَاكُمْ'], 
   'كدنا': [
          'كِدْنَا'], 
   'أرادا': [
           'أَرَادَا'], 
   'قلتم': [
          'قُلْتُمْ'], 
   'قلته': [
          'قُلْتُهُ'], 
   'يؤتون': [
           'يُؤْتُونَ',
           'يُؤْتَوْنَ'], 
   'تحبوا': [
           'تُحِبُّوا'], 
   'عليون': [
           'عِلِّيُّونَ'], 
   'يستغفر': [
            'يَسْتَغْفِرْ',
            'يَسْتَغْفِرِ'], 
   'الوقت': [
           'الْوَقْتِ'], 
   'الصافون': [
             'الصَّافُّونَ'], 
   'ردت': [
         'رُدَّتْ'], 
   'المعتدين': [
              'الْمُعْتَدِينَ'], 
   'قادرين': [
            'قَادِرِينَ'], 
   'نشرح': [
          'نَشْرَحْ'], 
   'أغنياء': [
            'أَغْنِيَاءُ',
            'أَغْنِيَاءَ'], 
   'منقعر': [
           'مُنْقَعِرٍ'], 
   'مباركا': [
            'مُبَارَكًا'], 
   'قبلي': [
          'قَبْلِي'], 
   'وسعى': [
          'وَسَعَى'], 
   'العتيق': [
            'الْعَتِيقِ'], 
   'نشرت': [
          'نُشِرَتْ'], 
   'ليشهدوا': [
             'لِيَشْهَدُوا'], 
   'قبله': [
          'قَبْلِهِ',
          'قِبَلِهِ',
          'قَبْلَهُ'], 
   'نشرا': [
          'نَشْرًا'], 
   'قبلك': [
          'قَبْلِكَ',
          'قَبْلَكَ',
          'قِبَلَكَ'], 
   'ريحكم': [
           'رِيحُكُمْ'], 
   'وجعلنا': [
            'وَجَعَلْنَا'], 
   'وتنازعتم': [
              'وَتَنَازَعْتُمْ'], 
   'عاصفة': [
           'عَاصِفَةً'], 
   'نفرا': [
          'نَفَرًا'], 
   'أحلام': [
           'أَحْلَامٍ'], 
   'كهيئة': [
           'كَهَيْئَةِ'], 
   'اشرح': [
          'اشْرَحْ'], 
   'كرة': [
         'كَرَّةً',
         'كَرَّةٌ'], 
   'مشركون': [
            'مُشْرِكُونَ'], 
   'وأبكارا': [
             'وَأَبْكَارًا'], 
   'لتنفقوا': [
             'لِتُنْفِقُوا'], 
   'فسالت': [
           'فَسَالَتْ'], 
   'البطون': [
            'الْبُطُونَ',
            'الْبُطُونِ'], 
   'والخاشعين': [
               'وَالْخَاشِعِينَ'], 
   'الوعد': [
           'الْوَعْدُ',
           'الْوَعْدِ',
           'الْوَعْدَ'], 
   'وصبروا': [
            'وَصَبَرُوا'], 
   'فليحذر': [
            'فَلْيَحْذَرِ'], 
   'أخذنا': [
           'أَخَذْنَا'], 
   'اقرأ': [
          'اقْرَأْ'], 
   'آتاكم': [
           'آتَاكُمْ',
           'آتَاكُمُ'], 
   'مصيبة': [
           'مُصِيبَةٌ',
           'مُصِيبَةٍ',
           'مُصِيبَةُ'], 
   'فهدى': [
          'فَهَدَى'], 
   'الأرحام': [
             'الْأَرْحَامِ',
             'الْأَرْحَامُ'], 
   'وأحاطت': [
            'وَأَحَاطَتْ'], 
   'رددنا': [
           'رَدَدْنَا'], 
   'ويلقون': [
            'وَيُلَقَّوْنَ'], 
   'صدقنا': [
           'صَدَقَنَا'], 
   'كرها': [
          'كَرْهًا',
          'كُرْهًا'], 
   'ولسانا': [
            'وَلِسَانًا'], 
   'خيرات': [
           'خَيْرَاتٌ'], 
   'يريهم': [
           'يُرِيهِمُ'], 
   'وينهى': [
           'وَيَنْهَى'], 
   'لترونها': [
             'لَتَرَوُنَّهَا'], 
   'ويعيد': [
           'وَيُعِيدُ'], 
   'أسروا': [
           'أَسَرُّوا'], 
   'مصيركم': [
            'مَصِيرَكُمْ'], 
   'أبوهما': [
            'أَبُوهُمَا'], 
   'بصائر': [
           'بَصَائِرُ',
           'بَصَائِرَ'], 
   'بأيديهم': [
             'بِأَيْدِيهِمْ'], 
   'نحسات': [
           'نَحِسَاتٍ'], 
   'شهادتهم': [
             'شَهَادَتُهُمْ'], 
   'مبعوثون': [
             'مَبْعُوثُونَ'], 
   'وعشيا': [
           'وَعَشِيًّا'], 
   'فالحق': [
           'فَالْحَقُّ'], 
   'وإدريس': [
            'وَإِدْرِيسَ'], 
   'واهجرني': [
             'وَاهْجُرْنِي'], 
   'قرضا': [
          'قَرْضًا'], 
   'نادمين': [
            'نَادِمِينَ'], 
   'نبأهم': [
           'نَبَأَهُمْ'], 
   'مأمون': [
           'مَأْمُونٍ'], 
   'ناديكم': [
            'نَادِيكُمُ'], 
   'لتقتلني': [
             'لِتَقْتُلَنِي'], 
   'فسق': [
         'فِسْقٌ'], 
   'كره': [
         'كَرِهَ',
         'كُرْهٌ'], 
   'أقلعي': [
           'أَقْلِعِي'], 
   'خلقناهما': [
              'خَلَقْنَاهُمَا'], 
   'بسورة': [
           'بِسُورَةٍ'], 
   'وإخوانكم': [
              'وَإِخْوَانُكُمْ',
              'وَإِخْوَانَكُمْ'], 
   'ضبحا': [
          'ضَبْحًا'], 
   'مبعدون': [
            'مُبْعَدُونَ'], 
   'والمحصنات': [
               'وَالْمُحْصَنَاتُ'], 
   'لبشر': [
          'لِبَشَرٍ'], 
   'فانظروا': [
             'فَانْظُرُوا'], 
   'ذرية': [
          'ذُرِّيَّةً',
          'ذُرِّيَّةِ',
          'ذُرِّيَّةٌ',
          'ذُرِّيَّةَ'], 
   'نصرف': [
          'نُصَرِّفُ'], 
   'بواحدة': [
            'بِوَاحِدَةٍ'], 
   'يلقاه': [
           'يَلْقَاهُ'], 
   'يعرفون': [
            'يَعْرِفُونَ'], 
   'قعيد': [
          'قَعِيدٌ'], 
   'نصره': [
          'نَصَرَهُ'], 
   'وعيد': [
          'وَعِيدِ'], 
   'ليحزنني': [
             'لَيَحْزُنُنِي'], 
   'كرسيه': [
           'كُرْسِيِّهِ',
           'كُرْسِيُّهُ'], 
   'ولبيوتهم': [
              'وَلِبُيُوتِهِمْ'], 
   'والمتصدقات': [
                'وَالْمُتَصَدِّقَاتِ'], 
   'تفضحون': [
            'تَفْضَحُونِ'], 
   'لآمن': [
          'لَآمَنَ'], 
   'سكينته': [
            'سَكِينَتَهُ'], 
   'فعليه': [
           'فَعَلَيْهِ'], 
   'يتولون': [
            'يَتَوَلَّوْنَ'], 
   'اسطاعوا': [
             'اسْطَاعُوا'], 
   'لمقت': [
          'لَمَقْتُ'], 
   'مكرهم': [
           'مَكْرُهُمْ',
           'مَكْرِهِمْ',
           'مَكْرَهُمْ'], 
   'كسبوا': [
           'كَسَبُوا'], 
   'بعظم': [
          'بِعَظْمٍ'], 
   'رصدا': [
          'رَصَدًا'], 
   'للشمس': [
           'لِلشَّمْسِ'], 
   'ألواح': [
           'أَلْوَاحٍ'], 
   'يحاط': [
          'يُحَاطَ'], 
   'مبلسون': [
            'مُبْلِسُونَ'], 
   'فصرف': [
          'فَصَرَفَ'], 
   'مجتمعون': [
             'مُجْتَمِعُونَ'], 
   'يتولوا': [
            'يَتَوَلَّوْا'], 
   'لامستم': [
            'لَامَسْتُمُ'], 
   'فتخطفه': [
            'فَتَخْطَفُهُ'], 
   'ليتفقهوا': [
              'لِيَتَفَقَّهُوا'], 
   'فقولا': [
           'فَقُولَا'], 
   'لمعزولون': [
              'لَمَعْزُولُونَ'], 
   'يخشاها': [
            'يَخْشَاهَا'], 
   'البكم': [
           'الْبُكْمُ'], 
   'هاؤم': [
          'هَاؤُمُ'], 
   'العالمين': [
              'الْعَالَمِينَ'], 
   'ترضاه': [
           'تَرْضَاهُ'], 
   'وجبريل': [
            'وَجِبْرِيلُ',
            'وَجِبْرِيلَ'], 
   'وأنهم': [
           'وَأَنَّهُمْ'], 
   'آتيهم': [
           'آتِيهِمْ'], 
   'غل': [
        'غِلٍّ',
        'غَلَّ'], 
   'نقضت': [
          'نَقَضَتْ'], 
   'قدرنا': [
           'قَدَّرْنَا'], 
   'يعرفوا': [
            'يَعْرِفُوا'], 
   'نصرا': [
          'نَصْرًا'], 
   'ذرأنا': [
           'ذَرَأْنَا'], 
   'فحملته': [
            'فَحَمَلَتْهُ'], 
   'والمطلوب': [
              'وَالْمَطْلُوبُ'], 
   'أتذر': [
          'أَتَذَرُ'], 
   'انفضوا': [
            'انْفَضُّوا'], 
   'تقويم': [
           'تَقْوِيمٍ'], 
   'عطاء': [
          'عَطَاءً',
          'عَطَاءِ',
          'عَطَاءُ'], 
   'نصرانيا': [
             'نَصْرَانِيًّا'], 
   'آثما': [
          'آثِمًا'], 
   'نفورا': [
           'نُفُورًا'], 
   'لنخرجنك': [
             'لَنُخْرِجَنَّكَ'], 
   'صرصرا': [
           'صَرْصَرًا'], 
   'وضاق': [
          'وَضَاقَ'], 
   'سعة': [
         'سَعَةٍ',
         'سَعَةً'], 
   'ليوفينهم': [
              'لَيُوَفِّيَنَّهُمْ'], 
   'نظر': [
         'نَظَرَ'], 
   'يعش': [
         'يَعْشُ'], 
   'للدين': [
           'لِلدِّينِ'], 
   'وليخش': [
           'وَلْيَخْشَ'], 
   'نسقط': [
          'نُسْقِطْ'], 
   'وتتلقاهم': [
              'وَتَتَلَقَّاهُمُ'], 
   'وأداء': [
           'وَأَدَاءٌ'], 
   'دمرنا': [
           'دَمَّرْنَا'], 
   'لاختلفتم': [
              'لَاخْتَلَفْتُمْ'], 
   'أطعتموهم': [
              'أَطَعْتُمُوهُمْ'], 
   'بصاحبهم': [
             'بِصَاحِبِهِمْ'], 
   'مصر': [
         'مِصْرَ'], 
   'أثارة': [
           'أَثَارَةٍ'], 
   'وعدسها': [
            'وَعَدَسِهَا'], 
   'اتبعكما': [
             'اتَّبَعَكُمَا'], 
   'السراء': [
            'السَّرَّاءِ'], 
   'والشياطين': [
               'وَالشَّيَاطِينَ'], 
   'إليهن': [
           'إِلَيْهِنَّ'], 
   'المنشئون': [
              'الْمُنْشِئُونَ'], 
   'توبتهم': [
            'تَوْبَتُهُمْ'], 
   'الذين': [
           'الَّذِينَ'], 
   'مسمع': [
          'مُسْمَعٍ'], 
   'أمواتا': [
            'أَمْوَاتًا'], 
   'وأسمع': [
           'وَأَسْمِعْ'], 
   'أقسمتم': [
            'أَقْسَمْتُمْ'], 
   'ضغثا': [
          'ضِغْثًا'], 
   'الخزي': [
           'الْخِزْيِ',
           'الْخِزْيَ',
           'الْخِزْيُ'], 
   'لأصلبنكم': [
              'لَأُصَلِّبَنَّكُمْ'], 
   'سئلوا': [
           'سُئِلُوا'], 
   'يبلوكم': [
            'يَبْلُوكُمُ'], 
   'ثقيلا': [
           'ثَقِيلًا'], 
   'أوزارا': [
            'أَوْزَارًا'], 
   'ومكر': [
          'وَمَكْرُ',
          'وَمَكْرَ',
          'وَمَكَرَ'], 
   'إخوة': [
          'إِخْوَةٌ',
          'إِخْوَةُ',
          'إِخْوَةً'], 
   'المهين': [
            'الْمُهِينِ'], 
   'تراءت': [
           'تَرَاءَتِ'], 
   'قتلهم': [
           'قَتْلَهُمْ',
           'قَتَلَهُمْ'], 
   'كاظمين': [
            'كَاظِمِينَ'], 
   'غدوت': [
          'غَدَوْتَ'], 
   'مسمى': [
          'مُسَمًّى'], 
   'يربو': [
          'يَرْبُو'], 
   'حتما': [
          'حَتْمًا'], 
   'معدود': [
           'مَعْدُودٍ'], 
   'عرضنا': [
           'عَرَضْنَا'], 
   'سعى': [
         'سَعَى'], 
   'فأنقذكم': [
             'فَأَنْقَذَكُمْ'], 
   'وورث': [
          'وَوَرِثَ'], 
   'نسقي': [
          'نَسْقِي'], 
   'زالتا': [
           'زَالَتَا'], 
   'يغلبون': [
            'يُغْلَبُونَ'], 
   'تقطع': [
          'تَقَطَّعَ',
          'تُقَطَّعَ'], 
   'معذرة': [
           'مَعْذِرَةً'], 
   'نظن': [
         'نَظُنُّ'], 
   'المنتصرين': [
               'الْمُنْتَصِرِينَ'], 
   'فألهمها': [
             'فَأَلْهَمَهَا'], 
   'فأسقط': [
           'فَأَسْقِطْ'], 
   'يصدون': [
           'يَصُدُّونَ',
           'يَصِدُّونَ'], 
   'ملعونين': [
             'مَلْعُونِينَ'], 
   'لعبادنا': [
             'لِعِبَادِنَا'], 
   'أدخلني': [
            'أَدْخِلْنِي'], 
   'مترفين': [
            'مُتْرَفِينَ'], 
   'يعد': [
         'يَعِدُ'], 
   'شيوخا': [
           'شُيُوخًا'], 
   'هامان': [
           'هَامَانُ'], 
   'وقرا': [
          'وَقْرًا',
          'وِقْرًا'], 
   'مراغما': [
            'مُرَاغَمًا'], 
   'وتدعوا': [
            'وَتَدْعُوا'], 
   'لهن': [
         'لَهُنَّ'], 
   'يعلنون': [
            'يُعْلِنُونَ'], 
   'لهم': [
         'لَهُمْ',
         'لَهُمُ'], 
   'لهي': [
         'لَهِيَ'], 
   'لهو': [
         'لَهُوَ',
         'لَهْوَ',
         'لَهْوٌ'], 
   'خسفنا': [
           'خَسَفْنَا'], 
   'يأكلهن': [
            'يَأْكُلُهُنَّ'], 
   'تفضيلا': [
            'تَفْضِيلًا'], 
   'الأصفاد': [
             'الْأَصْفَادِ'], 
   'واللاتي': [
             'وَاللَّاتِي'], 
   'ترجعون': [
            'تُرْجَعُونَ'], 
   'قربانا': [
            'قُرْبَانًا'], 
   'السموم': [
            'السَّمُومِ'], 
   'يبخلون': [
            'يَبْخَلُونَ'], 
   'تعالى': [
           'تَعَالَى'], 
   'إنك': [
         'إِنَّكَ',
         'إِنَّكِ'], 
   'مدين': [
          'مَدْيَنَ'], 
   'إنه': [
         'إِنَّهُ'], 
   'مصروفا': [
            'مَصْرُوفًا'], 
   'لها': [
         'لَهَا'], 
   'جديدا': [
           'جَدِيدًا'], 
   'يراها': [
           'يَرَاهَا'], 
   'لهب': [
         'لَهَبٍ'], 
   'إنس': [
         'إِنْسٌ'], 
   'صياما': [
           'صِيَامًا'], 
   'بيتها': [
           'بَيْتِهَا'], 
   'يلعبون': [
            'يَلْعَبُونَ'], 
   'وارجوا': [
            'وَارْجُوا'], 
   'وترزق': [
           'وَتَرْزُقُ'], 
   'صوما': [
          'صَوْمًا'], 
   'وجادلهم': [
             'وَجَادِلْهُمْ'], 
   'خذها': [
          'خُذْهَا'], 
   'منشورا': [
            'مَنْشُورًا'], 
   'فقيرا': [
           'فَقِيرًا'], 
   'سألتك': [
           'سَأَلْتُكَ'], 
   'إنا': [
         'إِنَّا'], 
   'يستصرخه': [
             'يَسْتَصْرِخُهُ'], 
   'لأسجد': [
           'لِأَسْجُدَ'], 
   'تطهرن': [
           'تَطَهَّرْنَ'], 
   'مثليها': [
            'مِثْلَيْهَا'], 
   'برهانان': [
             'بُرْهَانَانِ'], 
   'تعولوا': [
            'تَعُولُوا'], 
   'وقري': [
          'وَقَرِّي'], 
   'السبيلا': [
             'السَّبِيلَا'], 
   'أوديتهم': [
             'أَوْدِيَتِهِمْ'], 
   'وقرن': [
          'وَقَرْنَ'], 
   'ويخرجكم': [
             'وَيُخْرِجُكُمْ'], 
   'مطمئنة': [
            'مُطْمَئِنَّةً'], 
   'أرى': [
         'أَرَى'], 
   'فأحييناه': [
              'فَأَحْيَيْنَاهُ'], 
   'والفسوق': [
             'وَالْفُسُوقَ'], 
   'لجة': [
         'لُجَّةً'], 
   'وبالنجم': [
             'وَبِالنَّجْمِ'], 
   'انكدرت': [
            'انْكَدَرَتْ'], 
   'برزخ': [
          'بَرْزَخٌ'], 
   'يغرنكم': [
            'يَغُرَّنَّكُمْ'], 
   'صحف': [
         'صُحُفِ',
         'صُحُفٍ'], 
   'تجادل': [
           'تُجَادِلْ',
           'تُجَادِلُ'], 
   'بفضل': [
          'بِفَضْلِ'], 
   'واجعل': [
           'وَاجْعَلْ'], 
   'الخصام': [
            'الْخِصَامِ'], 
   'حمارك': [
           'حِمَارِكَ'], 
   'مرصد': [
          'مَرْصَدٍ'], 
   'حزبه': [
          'حِزْبَهُ'], 
   'لعلنا': [
           'لَعَلَّنَا'], 
   'مرتاب': [
           'مُرْتَابٌ'], 
   'أذنت': [
          'أَذِنْتَ'], 
   'رأسه': [
          'رَأْسِهِ'], 
   'منكرة': [
           'مُنْكِرَةٌ'], 
   'مغفرة': [
           'مَغْفِرَةٌ',
           'مَغْفِرَةٍ',
           'مَغْفِرَةً'], 
   'تأتنا': [
           'تَأْتِنَا'], 
   'تغرنكم': [
            'تَغُرَّنَّكُمُ'], 
   'سائق': [
          'سَائِقٌ'], 
   'أصاب': [
          'أَصَابَ'], 
   'شريعة': [
           'شَرِيعَةٍ'], 
   'وإيتاء': [
            'وَإِيتَاءِ',
            'وَإِيتَاءَ'], 
   'بالغدو': [
            'بِالْغُدُوِّ'], 
   'فلبثت': [
           'فَلَبِثْتَ'], 
   'مصرا': [
          'مِصْرًا'], 
   'تشمت': [
          'تُشْمِتْ'], 
   'فرجل': [
          'فَرَجُلٌ'], 
   'الحناجر': [
             'الْحَنَاجِرِ',
             'الْحَنَاجِرَ'], 
   'والحرمات': [
              'وَالْحُرُمَاتُ'], 
   'للذكر': [
           'لِلذِّكْرِ',
           'لِلذَّكَرِ'], 
   'ومثلهم': [
            'وَمِثْلَهُمْ',
            'وَمَثَلُهُمْ'], 
   'ننسخ': [
          'نَنْسَخْ'], 
   'والركب': [
            'وَالرَّكْبُ'], 
   'مسطور': [
           'مَسْطُورٍ'], 
   'يحاسبكم': [
             'يُحَاسِبْكُمْ'], 
   'محشورة': [
            'مَحْشُورَةً'], 
   'سلام': [
          'سَلَامٌ'], 
   'دونهما': [
            'دُونِهِمَا'], 
   'سنؤتيهم': [
             'سَنُؤْتِيهِمْ'], 
   'فبرأه': [
           'فَبَرَّأَهُ'], 
   'والركع': [
            'وَالرُّكَّعِ'], 
   'خامدون': [
            'خَامِدُونَ'], 
   'دعاءكم': [
            'دُعَاءَكُمْ'], 
   'قواريرا': [
             'قَوَارِيرَا'], 
   'الصاخة': [
            'الصَّاخَّةُ'], 
   'فصيام': [
           'فَصِيَامُ'], 
   'ليالي': [
           'لَيَالِيَ'], 
   'تقنطوا': [
            'تَقْنَطُوا'], 
   'تشخص': [
          'تَشْخَصُ'], 
   'يسبح': [
          'يُسَبِّحُ'], 
   'لجي': [
         'لُجِّيٍّ'], 
   'ويلقوا': [
            'وَيُلْقُوا'], 
   'وأرنا': [
           'وَأَرِنَا'], 
   'فالجاريات': [
               'فَالْجَارِيَاتِ'], 
   'سنابل': [
           'سَنَابِلَ'], 
   'مستورا': [
            'مَسْتُورًا'], 
   'كرام': [
          'كِرَامٍ'], 
   'وأخوك': [
           'وَأَخُوكَ'], 
   'وفضلا': [
           'وَفَضْلًا'], 
   'أرض': [
         'أَرْضِ',
         'أَرْضُ',
         'أَرْضٍ'], 
   'ولذلك': [
           'وَلِذَلِكَ'], 
   'شامخات': [
            'شَامِخَاتٍ'], 
   'محلها': [
           'مَحِلُّهَا'], 
   'نذرت': [
          'نَذَرْتُ'], 
   'بأعدائكم': [
              'بِأَعْدَائِكُمْ'], 
   'الفجار': [
            'الْفُجَّارِ',
            'الْفُجَّارَ'], 
   'بأسنا': [
           'بَأْسُنَا',
           'بَأْسَنَا'], 
   'سيدها': [
           'سَيِّدَهَا'], 
   'تواعدوهن': [
              'تُوَاعِدُوهُنَّ'], 
   'مكناكم': [
            'مَكَّنَّاكُمْ'], 
   'الصالحين': [
              'الصَّالِحِينَ'], 
   'فأبى': [
          'فَأَبَى'], 
   'كالفراش': [
             'كَالْفَرَاشِ'], 
   'يحلل': [
          'يَحْلِلْ'], 
   'ملوما': [
           'مَلُومًا'], 
   'نستنسخ': [
            'نَسْتَنْسِخُ'], 
   'انسلخ': [
           'انْسَلَخَ'], 
   'وأصحاب': [
            'وَأَصْحَابُ',
            'وَأَصْحَابَ',
            'وَأَصْحَابِ'], 
   'تذكروا': [
            'تَذْكُرُوا',
            'تَذَكَّرُوا'], 
   'تفشلا': [
           'تَفْشَلَا'], 
   'تقهر': [
          'تَقْهَرْ'], 
   'أحاديث': [
            'أَحَادِيثَ'], 
   'يكفروه': [
            'يُكْفَرُوهُ'], 
   'يكفرون': [
            'يَكْفُرُونَ'], 
   'فلهن': [
          'فَلَهُنَّ'], 
   'وبرحمته': [
             'وَبِرَحْمَتِهِ'], 
   'فلهم': [
          'فَلَهُمْ'], 
   'بخارجين': [
             'بِخَارِجِينَ'], 
   'حسدا': [
          'حَسَدًا'], 
   'وتعز': [
          'وَتُعِزُّ'], 
   'الوسطى': [
            'الْوُسْطَى'], 
   'والصابئين': [
               'وَالصَّابِئِينَ'], 
   'أشاء': [
          'أَشَاءُ'], 
   'تذكرون': [
            'تَذَكَّرُونَ'], 
   'أكنة': [
          'أَكِنَّةً',
          'أَكِنَّةٍ'], 
   'ورقة': [
          'وَرَقَةٍ'], 
   'يقسمون': [
            'يَقْسِمُونَ'], 
   'ففريقا': [
            'فَفَرِيقًا'], 
   'أكرمي': [
           'أَكْرِمِي'], 
   'زخرف': [
          'زُخْرُفَ',
          'زُخْرُفٍ'], 
   'لحما': [
          'لَحْمًا'], 
   'يكفروا': [
            'يَكْفُرُوا'], 
   'طائركم': [
            'طَائِرُكُمْ'], 
   'فلها': [
          'فَلَهَا'], 
   'صدقناهم': [
             'صَدَقْنَاهُمُ'], 
   'يدنين': [
           'يُدْنِينَ'], 
   'الأفئدة': [
             'الْأَفْئِدَةِ'], 
   'مزقتم': [
           'مُزِّقْتُمْ'], 
   'يتمنونه': [
             'يَتَمَنَّوْنَهُ'], 
   'مخلصا': [
           'مُخْلِصًا',
           'مُخْلَصًا'], 
   'وبنينا': [
            'وَبَنَيْنَا'], 
   'أفأنت': [
           'أَفَأَنْتَ'], 
   'الأهلة': [
            'الْأَهِلَّةِ'], 
   'نحشر': [
          'نَحْشُرُ'], 
   'طائفتين': [
             'طَائِفَتَيْنِ'], 
   'فخذ': [
         'فَخُذْ'], 
   'فخر': [
         'فَخَرَّ'], 
   'ولينا': [
           'وَلِيُّنَا'], 
   'لغافلون': [
             'لَغَافِلُونَ'], 
   'وجهت': [
          'وَجَّهْتُ'], 
   'وسبحه': [
           'وَسَبِّحْهُ'], 
   'الحليم': [
            'الْحَلِيمُ'], 
   'ربوة': [
          'رَبْوَةٍ'], 
   'أرهطي': [
           'أَرَهْطِي'], 
   'بعبده': [
           'بِعَبْدِهِ'], 
   'وكتبه': [
           'وَكُتُبِهِ'], 
   'كجهر': [
          'كَجَهْرِ'], 
   'وآتيناهم': [
              'وَآتَيْنَاهُمْ'], 
   'يضيق': [
          'يَضِيقُ'], 
   'اقذفيه': [
            'اقْذِفِيهِ'], 
   'وأمي': [
          'وَأُمِّيَ'], 
   'تحيتهم': [
            'تَحِيَّتُهُمْ'], 
   'هدينا': [
           'هَدَيْنَا'], 
   'وإننا': [
           'وَإِنَّنَا'], 
   'وأمه': [
          'وَأُمَّهُ',
          'وَأُمِّهِ',
          'وَأُمُّهُ'], 
   'محضرا': [
           'مُحْضَرًا'], 
   'ونهر': [
          'وَنَهَرٍ'], 
   'تراضوا': [
            'تَرَاضَوْا'], 
   'وأخر': [
          'وَأُخَرَ',
          'وَأُخَرُ',
          'وَأَخَّرَ'], 
   'وأخذ': [
          'وَأَخَذَ'], 
   'النصر': [
           'النَّصْرُ'], 
   'تلوون': [
           'تَلْوُونَ'], 
   'تسقى': [
          'تُسْقَى'], 
   'تناصرون': [
             'تَنَاصَرُونَ'], 
   'ورائي': [
           'وَرَائِي'], 
   'النصب': [
           'النُّصُبِ'], 
   'أسباطا': [
            'أَسْبَاطًا'], 
   'المجيبون': [
              'الْمُجِيبُونَ'], 
   'اخسئوا': [
            'اخْسَئُوا'], 
   'الصالحات': [
              'الصَّالِحَاتِ',
              'الصَّالِحَاتُ'], 
   'ليصدونهم': [
              'لَيَصُدُّونَهُمْ'], 
   'أنصتوا': [
            'أَنْصِتُوا'], 
   'قتلتم': [
           'قُتِلْتُمْ',
           'قَتَلْتُمْ'], 
   'بالأبصار': [
              'بِالْأَبْصَارِ'], 
   'فاجلدوهم': [
              'فَاجْلِدُوهُمْ'], 
   'واشكروا': [
             'وَاشْكُرُوا'], 
   'الصابرين': [
              'الصَّابِرِينَ'], 
   'القيامة': [
             'الْقِيَامَةِ'], 
   'المهاد': [
            'الْمِهَادُ'], 
   'وأخي': [
          'وَأَخِي'], 
   'يصرف': [
          'يُصْرَفْ'], 
   'ونهى': [
          'وَنَهَى'], 
   'مختلفين': [
             'مُخْتَلِفِينَ'], 
   'متشابه': [
            'مُتَشَابِهٍ'], 
   'الويل': [
           'الْوَيْلُ'], 
   'وأمر': [
          'وَأْمُرْ',
          'وَأَمَرُّ'], 
   'فكأين': [
           'فَكَأَيِّنْ'], 
   'يضيع': [
          'يُضِيعُ'], 
   'فأنظرني': [
             'فَأَنْظِرْنِي'], 
   'ظل': [
        'ظَلَّ',
        'ظِلٍّ'], 
   'وانظر': [
           'وَانْظُرْ'], 
   'وإنني': [
           'وَإِنَّنِي'], 
   'يضيء': [
          'يُضِيءُ'], 
   'آمنتم': [
           'آمَنْتُمْ'], 
   'يومهم': [
           'يَوْمَهُمُ',
           'يَوْمِهِمْ',
           'يَوْمِهِمُ'], 
   'بسبب': [
          'بِسَبَبٍ'], 
   'بدعائك': [
            'بِدُعَائِكَ'], 
   'بيوتكن': [
            'بُيُوتِكُنَّ'], 
   'بيوتكم': [
            'بُيُوتِكُمْ',
            'بُيُوتَكُمْ'], 
   'فاسأله': [
            'فَاسْأَلْهُ'], 
   'وأما': [
          'وَأَمَّا'], 
   'لأذبحنه': [
             'لَأَذْبَحَنَّهُ'], 
   'بالشهداء': [
              'بِالشُّهَدَاءِ'], 
   'فأتاهم': [
            'فَأَتَاهُمُ'], 
   'يتكلم': [
           'يَتَكَلَّمُ'], 
   'فيؤخذ': [
           'فَيُؤْخَذُ'], 
   'دائمون': [
            'دَائِمُونَ'], 
   'تسحرون': [
            'تُسْحَرُونَ'], 
   'ونخيل': [
           'وَنَخِيلٌ'], 
   'جاهدوا': [
            'جَاهَدُوا'], 
   'والإيمان': [
              'وَالْإِيمَانَ'], 
   'طغى': [
         'طَغَى'], 
   'بادي': [
          'بَادِيَ'], 
   'فنبذناه': [
             'فَنَبَذْنَاهُ'], 
   'يدرك': [
          'يُدْرِكُ'], 
   'والناشرات': [
               'وَالنَّاشِرَاتِ'], 
   'رضي': [
         'رَضِيَ'], 
   'أغفلنا': [
            'أَغْفَلْنَا'], 
   'وزكريا': [
            'وَزَكَرِيَّا'], 
   'جنتان': [
           'جَنَّتَانِ'], 
   'أرادوا': [
            'أَرَادُوا'], 
   'فأرسلوا': [
             'فَأَرْسَلُوا'], 
   'تعظون': [
           'تَعِظُونَ'], 
   'بمال': [
          'بِمَالٍ'], 
   'أوزار': [
           'أَوْزَارِ'], 
   'وتذهب': [
           'وَتَذْهَبَ'], 
   'تحرثون': [
            'تَحْرُثُونَ'], 
   'ليفسد': [
           'لِيُفْسِدَ'], 
   'ويعملون': [
             'وَيَعْمَلُونَ'], 
   'فيمت': [
          'فَيَمُتْ'], 
   'سيدخلون': [
             'سَيَدْخُلُونَ'], 
   'القرنين': [
             'الْقَرْنَيْنِ'], 
   'سلفا': [
          'سَلَفًا'], 
   'نهلك': [
          'نُهْلِكِ',
          'نُهْلِكَ'], 
   'يستنكف': [
            'يَسْتَنْكِفْ',
            'يَسْتَنْكِفَ'], 
   'والعشي': [
            'وَالْعَشِيِّ'], 
   'تعلموهم': [
             'تَعْلَمُوهُمْ'], 
   'ابيضت': [
           'ابْيَضَّتْ'], 
   'فأرسلون': [
             'فَأَرْسِلُونِ'], 
   'خوانا': [
           'خَوَّانًا'], 
   'يغويكم': [
            'يُغْوِيَكُمْ'], 
   'أعثرنا': [
            'أَعْثَرْنَا'], 
   'بالباطل': [
             'بِالْبَاطِلِ'], 
   'بماء': [
          'بِمَاءٍ'], 
   'تدمر': [
          'تُدَمِّرُ'], 
   'مثوبة': [
           'مَثُوبَةً'], 
   'لمهتدون': [
             'لَمُهْتَدُونَ'], 
   'والقناطير': [
               'وَالْقَنَاطِيرِ'], 
   'جاهلون': [
            'جَاهِلُونَ'], 
   'يبلغوا': [
            'يَبْلُغُوا'], 
   'تسمية': [
           'تَسْمِيَةَ'], 
   'جنتين': [
           'جَنَّتَيْنِ'], 
   'تكتموا': [
            'تَكْتُمُوا'], 
   'ركن': [
         'رُكْنٍ'], 
   'واتقوا': [
            'وَاتَّقُوا',
            'وَاتَّقَوْا'], 
   'هادي': [
          'هَادِيَ'], 
   'وعصوا': [
           'وَعَصَوْا',
           'وَعَصَوُا'], 
   'دعي': [
         'دُعِيَ'], 
   'فستعلمون': [
              'فَسَتَعْلَمُونَ'], 
   'ينفعنا': [
            'يَنْفَعَنَا',
            'يَنْفَعُنَا'], 
   'للسحت': [
           'لِلسُّحْتِ'], 
   'وأشرقت': [
            'وَأَشْرَقَتِ'], 
   'خيل': [
         'خَيْلٍ'], 
   'ومنافع': [
            'وَمَنَافِعُ'], 
   'كبت': [
         'كُبِتَ'], 
   'رحلة': [
          'رِحْلَةَ'], 
   'كبد': [
         'كَبَدٍ'], 
   'كبر': [
         'كَبُرَ',
         'كِبْرٌ'], 
   'جئنا': [
          'جِئْنَا'], 
   'الحرب': [
           'الْحَرْبِ',
           'الْحَرْبُ'], 
   'لتذكرة': [
            'لَتَذْكِرَةٌ'], 
   'الشهور': [
            'الشُّهُورِ'], 
   'تطعمون': [
            'تُطْعِمُونَ'], 
   'ليولن': [
           'لَيُوَلُّنَّ'], 
   'فتنوا': [
           'فُتِنُوا',
           'فَتَنُوا'], 
   'تأكلون': [
            'تَأْكُلُونَ'], 
   'ردما': [
          'رَدْمًا'], 
   'سبيلي': [
           'سَبِيلِي'], 
   'فسقناه': [
            'فَسُقْنَاهُ'], 
   'فهديناهم': [
              'فَهَدَيْنَاهُمْ'], 
   'يحسدون': [
            'يَحْسُدُونَ'], 
   'أضعف': [
          'أَضْعَفُ'], 
   'سبيلك': [
           'سَبِيلِكَ',
           'سَبِيلَكَ'], 
   'يستوفون': [
             'يَسْتَوْفُونَ'], 
   'سبيله': [
           'سَبِيلِهِ',
           'سَبِيلَهُ'], 
   'يخطف': [
          'يَخْطَفُ'], 
   'عزيزا': [
           'عَزِيزًا'], 
   'يسألكم': [
            'يَسْأَلْكُمْ',
            'يَسْأَلُكُمْ'], 
   'قصصناهم': [
             'قَصَصْنَاهُمْ'], 
   'فأذاقهم': [
             'فَأَذَاقَهُمُ'], 
   'يصدفون': [
            'يَصْدِفُونَ'], 
   'تأكلوا': [
            'تَأْكُلُوا'], 
   'سيجزيهم': [
             'سَيَجْزِيهِمْ'], 
   'ونقدس': [
           'وَنُقَدِّسُ'], 
   'فألقي': [
           'فَأُلْقِيَ'], 
   'فألقى': [
           'فَأَلْقَى'], 
   'وليعلمن': [
             'وَلَيَعْلَمَنَّ'], 
   'وإسحاق': [
            'وَإِسْحَاقَ'], 
   'بآل': [
         'بِآلِ'], 
   'ولأوضعوا': [
              'وَلَأَوْضَعُوا'], 
   'سبيلا': [
           'سَبِيلًا'], 
   'تؤويه': [
           'تُؤْوِيهِ'], 
   'غلبوا': [
           'غَلَبُوا'], 
   'تثقفنهم': [
             'تَثْقَفَنَّهُمْ'], 
   'فيكيدوا': [
             'فَيَكِيدُوا'], 
   'البائس': [
            'الْبَائِسَ'], 
   'وتركتم': [
            'وَتَرَكْتُمْ'], 
   'الوقود': [
            'الْوَقُودِ'], 
   'وشركاؤكم': [
              'وَشُرَكَاؤُكُمْ'], 
   'ومتعوهن': [
             'وَمَتِّعُوهُنَّ'], 
   'تتمنوا': [
            'تَتَمَنَّوْا'], 
   'نصبا': [
          'نَصَبًا'], 
   'موفورا': [
            'مَوْفُورًا'], 
   'وسرحوهن': [
             'وَسَرِّحُوهُنَّ'], 
   'فاعلم': [
           'فَاعْلَمْ'], 
   'العداوة': [
             'الْعَدَاوَةَ',
             'الْعَدَاوَةُ'], 
   'والباطل': [
             'وَالْبَاطِلَ'], 
   'والباطن': [
             'وَالْبَاطِنُ'], 
   'الإنفاق': [
             'الْإِنْفَاقِ'], 
   'لأجرا': [
           'لَأَجْرًا'], 
   'امتلأت': [
            'امْتَلَأْتِ'], 
   'فأسرها': [
            'فَأَسَرَّهَا'], 
   'فذرهم': [
           'فَذَرْهُمْ'], 
   'للحسنى': [
            'لَلْحُسْنَى'], 
   'نكرهم': [
           'نَكِرَهُمْ'], 
   'والزانية': [
              'وَالزَّانِيَةُ'], 
   'وغرهم': [
           'وَغَرَّهُمْ'], 
   'يطعم': [
          'يُطْعِمُ',
          'يُطْعَمُ'], 
   'فتأتون': [
            'فَتَأْتُونَ'], 
   'فنعما': [
           'فَنِعِمَّا'], 
   'وملأه': [
           'وَمَلَأَهُ'], 
   'وقفوا': [
           'وُقِفُوا'], 
   'فآواكم': [
            'فَآوَاكُمْ'], 
   'تصرفون': [
            'تُصْرَفُونَ'], 
   'يكتمها': [
            'يَكْتُمْهَا'], 
   'أجلنا': [
           'أَجَلَنَا'], 
   'أصواتهم': [
             'أَصْوَاتَهُمْ'], 
   'مطر': [
         'مَطَرُ',
         'مَطَرَ',
         'مَطَرٍ'], 
   'أبوابها': [
             'أَبْوَابُهَا',
             'أَبْوَابِهَا'], 
   'فصلت': [
          'فُصِّلَتْ',
          'فَصَلَتِ'], 
   'أسألكم': [
            'أَسْأَلُكُمْ'], 
   'فريقا': [
           'فَرِيقًا'], 
   'ذرني': [
          'ذَرْنِي'], 
   'نكفر': [
          'نُكَفِّرْ',
          'نَكْفُرَ'], 
   'نفصل': [
          'نُفَصِّلُ'], 
   'تشركون': [
            'تُشْرِكُونَ'], 
   'بضياء': [
           'بِضِيَاءٍ'], 
   'غزلها': [
           'غَزْلَهَا'], 
   'هينا': [
          'هَيِّنًا'], 
   'بالنذر': [
            'بِالنُّذُرِ',
            'بِالنَّذْرِ'], 
   'وممن': [
          'وَمِمَّنْ'], 
   'تساءلون': [
             'تَسَاءَلُونَ'], 
   'يدخل': [
          'يُدْخِلُ',
          'يُدْخَلَ',
          'يَدْخُلِ',
          'يَدْخُلَ'], 
   'شجرت': [
          'شَجَرَتَ'], 
   'فتحوا': [
           'فَتَحُوا'], 
   'أنصارا': [
            'أَنْصَارًا'], 
   'منعنا': [
           'مَنَعَنَا'], 
   'وليبدلنهم': [
               'وَلَيُبَدِّلَنَّهُمْ'], 
   'أخرقتها': [
             'أَخَرَقْتَهَا'], 
   'تشركوا': [
            'تُشْرِكُوا'], 
   'أوتيتم': [
            'أُوتِيتُمْ'], 
   'أوتيته': [
            'أُوتِيتُهُ'], 
   'ذرنا': [
          'ذَرْنَا'], 
   'عذاب': [
          'عَذَابٌ',
          'عَذَابَ',
          'عَذَابِ',
          'عَذَابٍ',
          'عَذَابُ'], 
   'المسلمين': [
              'الْمُسْلِمِينَ'], 
   'فوج': [
         'فَوْجٌ'], 
   'فطرهن': [
           'فَطَرَهُنَّ'], 
   'يستغيثان': [
              'يَسْتَغِيثَانِ'], 
   'نعاجه': [
           'نِعَاجِهِ'], 
   'ربكما': [
           'رَبِّكُمَا',
           'رَبُّكُمَا'], 
   'وحميم': [
           'وَحَمِيمٍ'], 
   'فظنوا': [
           'فَظَنُّوا'], 
   'وراعنا': [
            'وَرَاعِنَا'], 
   'وأشهدوا': [
             'وَأَشْهِدُوا'], 
   'وإقام': [
           'وَإِقَامِ',
           'وَإِقَامَ'], 
   'ظهير': [
          'ظَهِيرٍ',
          'ظَهِيرٌ'], 
   'يخافون': [
            'يَخَافُونَ'], 
   'الخاطئون': [
              'الْخَاطِئُونَ'], 
   'ويأمنوا': [
             'وَيَأْمَنُوا'], 
   'فادخلوا': [
             'فَادْخُلُوا'], 
   'تعلم': [
          'تَعْلَمُ',
          'تَعْلَمْ'], 
   'أبرئ': [
          'أُبَرِّئُ'], 
   'ولنحمل': [
            'وَلْنَحْمِلْ'], 
   'لمتنني': [
            'لُمْتُنَّنِي'], 
   'نكسوها': [
            'نَكْسُوهَا'], 
   'فكذبوهما': [
              'فَكَذَّبُوهُمَا'], 
   'ويتقه': [
           'وَيَتَّقْهِ'], 
   'شياطينهم': [
              'شَيَاطِينِهِمْ'], 
   'والبصر': [
            'وَالْبَصَرَ'], 
   'صوامع': [
           'صَوَامِعُ'], 
   'شاكرا': [
           'شَاكِرًا'], 
   'لمن': [
         'لِمَنْ',
         'لَمِنَ',
         'لِمَنِ',
         'لَمَنْ',
         'لَمِنْ',
         'لَمَنِ'], 
   'رهين': [
          'رَهِينٌ'], 
   'الحرم': [
           'الْحُرُمُ'], 
   'العيون': [
            'الْعُيُونِ'], 
   'اغترف': [
           'اغْتَرَفَ'], 
   'آتاهم': [
           'آتَاهُمُ',
           'آتَاهُمْ'], 
   'يوقد': [
          'يُوقَدُ'], 
   'نبئوني': [
            'نَبِّئُونِي'], 
   'ستذكرونهن': [
               'سَتَذْكُرُونَهُنَّ'], 
   'استأذن': [
            'اسْتَأْذَنَ'], 
   'كالمجرمين': [
               'كَالْمُجْرِمِينَ'], 
   'ذرونا': [
           'ذَرُونَا'], 
   'جنته': [
          'جَنَّتَهُ'], 
   'يوقع': [
          'يُوقِعَ'], 
   'يتسللون': [
             'يَتَسَلَّلُونَ'], 
   'ويشف': [
          'وَيَشْفِ'], 
   'يصلحا': [
           'يُصْلِحَا'], 
   'آتاها': [
           'آتَاهَا'], 
   'بكاهن': [
           'بِكَاهِنٍ'], 
   'أطعمهم': [
            'أَطْعَمَهُمْ'], 
   'وأخذوا': [
            'وَأُخِذُوا'], 
   'الحرث': [
           'الْحَرْثِ',
           'الْحَرْثَ'], 
   'السميع': [
            'السَّمِيعُ'], 
   'لقومكما': [
             'لِقَوْمِكُمَا'], 
   'يستعجلونك': [
               'يَسْتَعْجِلُونَكَ'], 
   'ألا': [
         'أَلَا',
         'أَلَّا'], 
   'الأوفى': [
            'الْأَوْفَى'], 
   'ويلعبوا': [
             'وَيَلْعَبُوا'], 
   'ذروني': [
           'ذَرُونِي'], 
   'ظهورهما': [
             'ظُهُورُهُمَا'], 
   'للجبل': [
           'لِلْجَبَلِ'], 
   'لمع': [
         'لَمَعَ'], 
   'يأجوج': [
           'يَأْجُوجُ',
           'يَأْجُوجَ'], 
   'حاصبا': [
           'حَاصِبًا'], 
   'وتب': [
         'وَتُبْ',
         'وَتَبَّ'], 
   'وليحكم': [
            'وَلْيَحْكُمْ'], 
   'وهديناه': [
             'وَهَدَيْنَاهُ'], 
   'ويختار': [
            'وَيَخْتَارُ'], 
   'وأهلها': [
            'وَأَهْلُهَا',
            'وَأَهْلَهَا'], 
   'أعجلك': [
           'أَعْجَلَكَ'], 
   'فاءت': [
          'فَاءَتْ'], 
   'رعايتها': [
             'رِعَايَتِهَا'], 
   'فبغى': [
          'فَبَغَى'], 
   'لما': [
         'لِمَا',
         'لَمَّا',
         'لَمَا',
         'لَمًّا'], 
   'فأقبل': [
           'فَأَقْبَلَ'], 
   'تيمموا': [
            'تَيَمَّمُوا'], 
   'والرقيم': [
             'وَالرَّقِيمِ'], 
   'وترجون': [
            'وَتَرْجُونَ'], 
   'فربكم': [
           'فَرَبُّكُمْ'], 
   'ومزقناهم': [
              'وَمَزَّقْنَاهُمْ'], 
   'يوقنون': [
            'يُوقِنُونَ'], 
   'غلبهم': [
           'غَلَبِهِمْ'], 
   'صدق': [
         'صِدْقٍ',
         'صَدَّقَ',
         'صَدَقَ'], 
   'نجزي': [
          'نَجْزِي'], 
   'بعثنا': [
           'بَعَثْنَا',
           'بَعَثَنَا'], 
   'للبث': [
          'لَلَبِثَ'], 
   'أمتكم': [
           'أُمَّتُكُمْ'], 
   'تشهد': [
          'تَشْهَدْ',
          'تَشْهَدُ',
          'تَشْهَدَ'], 
   'سمعنا': [
           'سَمِعْنَا'], 
   'سرحوهن': [
            'سَرِّحُوهُنَّ'], 
   'فتراه': [
           'فَتَرَاهُ'], 
   'القيوم': [
            'الْقَيُّومُ',
            'الْقَيُّومِ'], 
   'باعد': [
          'بَاعِدْ'], 
   'لآية': [
          'لَآيَةً'], 
   'كسفا': [
          'كِسَفًا',
          'كِسْفًا'], 
   'مستضعفون': [
              'مُسْتَضْعَفُونَ'], 
   'منذرون': [
            'مُنْذِرُونَ'], 
   'ليصدوا': [
            'لِيَصُدُّوا'], 
   'وازينت': [
            'وَازَّيَّنَتْ'], 
   'وأخلصوا': [
             'وَأَخْلَصُوا'], 
   'مشهد': [
          'مَشْهَدِ'], 
   'وإستبرق': [
             'وَإِسْتَبْرَقٍ',
             'وَإِسْتَبْرَقٌ'], 
   'كمثله': [
           'كَمِثْلِهِ'], 
   'لسانا': [
           'لِسَانًا'], 
   'ذكرا': [
          'ذِكْرًا'], 
   'قدم': [
         'قَدَّمَ',
         'قَدَمَ',
         'قَدَمٌ'], 
   'اختلفتم': [
             'اخْتَلَفْتُمْ'], 
   'صلح': [
         'صَلَحَ'], 
   'صرة': [
         'صَرَّةٍ'], 
   'يريكم': [
           'يُرِيكُمُ',
           'يُرِيكُمْ'], 
   'نافقوا': [
            'نَافَقُوا'], 
   'مكين': [
          'مَكِينٍ',
          'مَكِينٌ'], 
   'قدر': [
         'قَدَّرَ',
         'قُدِرَ',
         'قَدَرٍ'], 
   'نصبر': [
          'نَصْبِرَ'], 
   'واكسوهم': [
             'وَاكْسُوهُمْ'], 
   'تفرحوا': [
            'تَفْرَحُوا'], 
   'وميكال': [
            'وَمِيكَالَ'], 
   'ذكرى': [
          'ذِكْرَى'], 
   'ذكري': [
          'ذِكْرِي'], 
   'لساني': [
           'لِسَانِي'], 
   'للبشر': [
           'لِلْبَشَرِ'], 
   'صرح': [
         'صَرْحٌ'], 
   'صلى': [
         'صَلَّى'], 
   'تغيظا': [
           'تَغَيُّظًا'], 
   'جدال': [
          'جِدَالَ'], 
   'لسانك': [
           'لِسَانَكَ'], 
   'ذكرك': [
          'ذِكْرَكَ'], 
   'فيقسمان': [
             'فَيُقْسِمَانِ'], 
   'وتخرج': [
           'وَتُخْرِجُ'], 
   'وعاد': [
          'وَعَادٌ',
          'وَعَادٍ'], 
   'وعاء': [
          'وِعَاءِ'], 
   'ونخلا': [
           'وَنَخْلًا'], 
   'اجترحوا': [
             'اجْتَرَحُوا'], 
   'وارزقنا': [
             'وَارْزُقْنَا'], 
   'وعندنا': [
            'وَعِنْدَنَا'], 
   'بأنعم': [
           'بِأَنْعُمِ'], 
   'والقلم': [
            'وَالْقَلَمِ'], 
   'تخلفه': [
           'تُخْلَفَهُ'], 
   'سميا': [
          'سَمِيًّا'], 
   'فقتل': [
          'فَقُتِلَ'], 
   'لمغفرة': [
            'لَمَغْفِرَةٌ'], 
   'والمنخنقة': [
               'وَالْمُنْخَنِقَةُ'], 
   'طال': [
         'طَالَ'], 
   'إعراضا': [
            'إِعْرَاضًا'], 
   'مكروها': [
            'مَكْرُوهًا'], 
   'رجلا': [
          'رَجُلًا'], 
   'بدت': [
         'بَدَتْ',
         'بَدَتِ'], 
   'نضيع': [
          'نُضِيعُ'], 
   'فخسفنا': [
            'فَخَسَفْنَا'], 
   'ولتنظر': [
            'وَلْتَنْظُرْ'], 
   'والطيبون': [
              'وَالطَّيِّبُونَ'], 
   'رابية': [
           'رَابِيَةً'], 
   'واذكرن': [
            'وَاذْكُرْنَ'], 
   'فتمتعوا': [
             'فَتَمَتَّعُوا'], 
   'النهار': [
            'النَّهَارِ',
            'النَّهَارَ'], 
   'الميمنة': [
             'الْمَيْمَنَةِ'], 
   'أنشأناهن': [
              'أَنْشَأْنَاهُنَّ'], 
   'بحبل': [
          'بِحَبْلِ',
          'بِحَبْلٍ'], 
   'تطع': [
         'تُطِعْ',
         'تُطِعِ'], 
   'يعذب': [
          'يُعَذِّبُ'], 
   'وقوموا': [
            'وَقُومُوا'], 
   'مدخلا': [
           'مُدْخَلًا',
           'مُدَّخَلًا'], 
   'يخرجوك': [
            'يُخْرِجُوكَ'], 
   'حييتم': [
           'حُيِّيتُمْ'], 
   'ونخرج': [
           'وَنُخْرِجُ'], 
   'يخرجون': [
            'يَخْرُجُونَ',
            'يُخْرِجُونَ',
            'يُخْرَجُونَ'], 
   'العفو': [
           'الْعَفْوَ'], 
   'بمن': [
         'بِمَنْ',
         'بِمَنِ'], 
   'تباشروهن': [
              'تُبَاشِرُوهُنَّ'], 
   'فكان': [
          'فَكَانَ'], 
   'ذكرنا': [
           'ذِكْرِنَا'], 
   'ويخرجهم': [
             'وَيُخْرِجُهُمْ'], 
   'لآبائهم': [
             'لِآبَائِهِمْ'], 
   'سماء': [
          'سَمَاءُ',
          'سَمَاءٍ'], 
   'ولتصنع': [
            'وَلِتُصْنَعَ'], 
   'ولبئس': [
           'وَلَبِئْسَ'], 
   'مقتا': [
          'مَقْتًا'], 
   'الكعبة': [
            'الْكَعْبَةِ',
            'الْكَعْبَةَ'], 
   'أقل': [
         'أَقُلْ',
         'أَقَلَّ'], 
   'أقم': [
         'أَقِمِ',
         'أَقِمْ'], 
   'فنذر': [
          'فَنَذَرُ'], 
   'طولا': [
          'طُولًا',
          'طَوْلًا'], 
   'تقتلوه': [
            'تَقْتُلُوهُ'], 
   'زوجك': [
          'زَوْجَكَ'], 
   'يخرجوا': [
            'يَخْرُجُوا'], 
   'خادعهم': [
            'خَادِعُهُمْ'], 
   'المدائن': [
             'الْمَدَائِنِ'], 
   'خاطئة': [
           'خَاطِئَةٍ'], 
   'جندا': [
          'جُنْدًا'], 
   'وأعناب': [
            'وَأَعْنَابٍ'], 
   'سمان': [
          'سِمَانٍ'], 
   'وابنها': [
            'وَابْنَهَا'], 
   'وأحصوا': [
            'وَأَحْصُوا'], 
   'وألحقني': [
             'وَأَلْحِقْنِي'], 
   'والتوراة': [
              'وَالتَّوْرَاةَ'], 
   'أفرغ': [
          'أَفْرِغْ',
          'أُفْرِغْ'], 
   'أنظرني': [
            'أَنْظِرْنِي'], 
   'المورود': [
             'الْمَوْرُودُ'], 
   'طاب': [
         'طَابَ'], 
   'أكل': [
         'أُكُلٍ',
         'أَكَلَ'], 
   'الكلالة': [
             'الْكَلَالَةِ'], 
   'تؤذوا': [
           'تُؤْذُوا'], 
   'يجادل': [
           'يُجَادِلُ'], 
   'فكانت': [
           'فَكَانَتْ'], 
   'فتيمموا': [
             'فَتَيَمَّمُوا'], 
   'والقائلين': [
               'وَالْقَائِلِينَ'], 
   'لتغرق': [
           'لِتُغْرِقَ'], 
   'ووجد': [
          'وَوَجَدَ'], 
   'الآخر': [
           'الْآخِرِ',
           'الْآخِرَ',
           'الْآخَرُ',
           'الْآخَرِ'], 
   'ربنا': [
          'رَبَّنَا',
          'رَبِّنَا',
          'رَبُّنَا'], 
   'غرور': [
          'غُرُورٍ'], 
   'ظنه': [
         'ظَنَّهُ'], 
   'وأكن': [
          'وَأَكُنْ'], 
   'روضة': [
          'رَوْضَةٍ'], 
   'الملعونة': [
              'الْمَلْعُونَةَ'], 
   'اكفر': [
          'اكْفُرْ'], 
   'دامت': [
          'دَامَتِ'], 
   'وسيصلون': [
             'وَسَيَصْلَوْنَ'], 
   'وأجر': [
          'وَأَجْرٌ',
          'وَأَجْرٍ'], 
   'أكننتم': [
            'أَكْنَنْتُمْ'], 
   'ونفس': [
          'وَنَفْسٍ'], 
   'أوقدوا': [
            'أَوْقَدُوا'], 
   'فرغت': [
          'فَرَغْتَ'], 
   'يحض': [
         'يَحُضُّ'], 
   'وفومها': [
            'وَفُومِهَا'], 
   'يحب': [
         'يُحِبُّ'], 
   'ليطغى': [
           'لَيَطْغَى'], 
   'ومهيمنا': [
             'وَمُهَيْمِنًا'], 
   'رسولنا': [
            'رَسُولِنَا',
            'رَسُولُنَا'], 
   'بناتي': [
           'بَنَاتِي'], 
   'أنيب': [
          'أُنِيبُ'], 
   'ونفخ': [
          'وَنُفِخَ',
          'وَنَفَخَ'], 
   'غيركم': [
           'غَيْرَكُمْ',
           'غَيْرِكُمْ'], 
   'خاشعين': [
            'خَاشِعِينَ'], 
   'يصدر': [
          'يُصْدِرَ',
          'يَصْدُرُ'], 
   'راعنا': [
           'رَاعِنَا'], 
   'هديناه': [
            'هَدَيْنَاهُ'], 
   'نقرؤه': [
           'نَقْرَؤُهُ'], 
   'تعجبك': [
           'تُعْجِبْكَ',
           'تُعْجِبُكَ'], 
   'بإخراج': [
            'بِإِخْرَاجِ'], 
   'والأولى': [
             'وَالْأُولَى'], 
   'فانهار': [
            'فَانْهَارَ'], 
   'ويزكيهم': [
             'وَيُزَكِّيهِمْ'], 
   'مختلفون': [
             'مُخْتَلِفُونَ'], 
   'وأجل': [
          'وَأَجَلٍ',
          'وَأَجَلٌ'], 
   'متنا': [
          'مِتْنَا'], 
   'لرءوف': [
           'لَرَءُوفٌ'], 
   'واجعله': [
            'وَاجْعَلْهُ'], 
   'بغيظهم': [
            'بِغَيْظِهِمْ'], 
   'يحل': [
         'يَحِلُّ',
         'يَحِلَّ'], 
   'اضربوه': [
            'اضْرِبُوهُ'], 
   'وأنثى': [
           'وَأُنْثَى'], 
   'اللاتي': [
            'اللَّاتِي'], 
   'وسليمان': [
             'وَسُلَيْمَانَ'], 
   'والحمد': [
            'وَالْحَمْدُ'], 
   'ظنا': [
         'ظَنًّا',
         'ظَنَّا'], 
   'وأتموا': [
            'وَأَتِمُّوا'], 
   'فأولى': [
           'فَأَوْلَى'], 
   'باق': [
         'بَاقٍ'], 
   'لجعلهم': [
            'لَجَعَلَهُمْ'], 
   'لوالديه': [
             'لِوَالِدَيْهِ'], 
   'تصلحوا': [
            'تُصْلِحُوا'], 
   'يسومونكم': [
              'يَسُومُونَكُمْ'], 
   'لعلم': [
          'لَعِلْمٌ'], 
   'لعله': [
          'لَعَلَّهُ'], 
   'نورنا': [
           'نُورَنَا'], 
   'لعلك': [
          'لَعَلَّكَ'], 
   'بالبخل': [
            'بِالْبُخْلِ'], 
   'تزرعونه': [
             'تَزْرَعُونَهُ'], 
   'خائفين': [
            'خَائِفِينَ'], 
   'أفتهلكنا': [
              'أَفَتُهْلِكُنَا'], 
   'لعلى': [
          'لَعَلَى'], 
   'تدهن': [
          'تُدْهِنُ'], 
   'لعلي': [
          'لَعَلِّي',
          'لَعَلِيٌّ'], 
   'المغضوب': [
             'الْمَغْضُوبِ'], 
   'نعاسا': [
           'نُعَاسًا'], 
   'يدسه': [
          'يَدُسُّهُ'], 
   'بنهر': [
          'بِنَهَرٍ'], 
   'فاستحبوا': [
              'فَاسْتَحَبُّوا'], 
   'وزرك': [
          'وِزْرَكَ'], 
   'فجمعناهم': [
              'فَجَمَعْنَاهُمْ'], 
   'لقال': [
          'لَقَالَ'], 
   'بغرور': [
           'بِغُرُورٍ'], 
   'يضرونك': [
            'يَضُرُّونَكَ'], 
   'رحمه': [
          'رَحِمَهُ'], 
   'أبكم': [
          'أَبْكَمُ'], 
   'تعرفهم': [
            'تَعْرِفُهُمْ'], 
   'وآباؤنا': [
             'وَآبَاؤُنَا'], 
   'تهوي': [
          'تَهْوِي'], 
   'غطاء': [
          'غِطَاءٍ'], 
   'تدعوهم': [
            'تَدْعُوهُمْ'], 
   'يغاث': [
          'يُغَاثُ'], 
   'وداوود': [
            'وَدَاوُودَ'], 
   'رحمة': [
          'رَحْمَةً',
          'رَحْمَةِ',
          'رَحْمَةٍ',
          'رَحْمَةَ',
          'رَحْمَةٌ'], 
   'أخرتن': [
           'أَخَّرْتَنِ'], 
   'رحمت': [
          'رَحْمَتَ',
          'رَحْمَتِ',
          'رَحْمَتُ'], 
   'بخمرهن': [
            'بِخُمُرِهِنَّ'], 
   'شاكلته': [
            'شَاكِلَتِهِ'], 
   'المشركات': [
              'الْمُشْرِكَاتِ'], 
   'حرمهما': [
            'حَرَّمَهُمَا'], 
   'عرشها': [
           'عَرْشَهَا'], 
   'أستغفر': [
            'أَسْتَغْفِرُ'], 
   'سترا': [
          'سِتْرًا'], 
   'رحما': [
          'رُحْمًا'], 
   'ليدخلنهم': [
              'لَيُدْخِلَنَّهُمْ'], 
   'سألقي': [
           'سَأُلْقِي'], 
   'وبال': [
          'وَبَالَ'], 
   'ونسكي': [
           'وَنُسُكِي'], 
   'رحمتنا': [
            'رَحْمَتِنَا'], 
   'أتيا': [
          'أَتَيَا'], 
   'صاغرين': [
            'صَاغِرِينَ'], 
   'ومثلا': [
           'وَمَثَلًا'], 
   'فثبتوا': [
            'فَثَبِّتُوا'], 
   'جنوده': [
           'جُنُودُهُ'], 
   'والرسول': [
             'وَالرَّسُولَ',
             'وَالرَّسُولِ',
             'وَالرَّسُولُ'], 
   'أنهكما': [
            'أَنْهَكُمَا'], 
   'تختانون': [
             'تَخْتَانُونَ'], 
   'واليوم': [
            'وَالْيَوْمِ',
            'وَالْيَوْمَ'], 
   'الأموات': [
             'الْأَمْوَاتُ'], 
   'ومتعناهم': [
              'وَمَتَّعْنَاهُمْ'], 
   'فاطلع': [
           'فَاطَّلَعَ'], 
   'خشب': [
         'خُشُبٌ'], 
   'لموسى': [
           'لِمُوسَى'], 
   'حميدا': [
           'حَمِيدًا'], 
   'نديا': [
          'نَدِيًّا'], 
   'والموعظة': [
              'وَالْمَوْعِظَةِ'], 
   'شهدنا': [
           'شَهِدْنَا'], 
   'يأذن': [
          'يَأْذَنَ',
          'يَأْذَنْ'], 
   'مزاجها': [
            'مِزَاجُهَا'], 
   'توفاهم': [
            'تَوَفَّاهُمُ'], 
   'وليلبسوا': [
              'وَلِيَلْبِسُوا'], 
   'الملقين': [
             'الْمُلْقِينَ'], 
   'ويؤمن': [
           'وَيُؤْمِنْ',
           'وَيُؤْمِنُ'], 
   'بهجة': [
          'بَهْجَةٍ'], 
   'غلت': [
         'غُلَّتْ'], 
   'والشهداء': [
              'وَالشُّهَدَاءِ',
              'وَالشُّهَدَاءُ'], 
   'المناد': [
            'الْمُنَادِ'], 
   'وحلوا': [
           'وَحُلُّوا'], 
   'تسبق': [
          'تَسْبِقُ'], 
   'أصابه': [
           'أَصَابَهُ'], 
   'يعرضون': [
            'يُعْرَضُونَ'], 
   'بأرجلهن': [
             'بِأَرْجُلِهِنَّ'], 
   'وهدوا': [
           'وَهُدُوا'], 
   'يدبروا': [
            'يَدَّبَّرُوا'], 
   'ألزمناه': [
             'أَلْزَمْنَاهُ'], 
   'فاعل': [
          'فَاعِلٌ'], 
   'بالهزل': [
            'بِالْهَزْلِ'], 
   'المنام': [
            'الْمَنَامِ'], 
   'أيدينا': [
            'أَيْدِينَا'], 
   'تسبح': [
          'تُسَبِّحُ'], 
   'لمنجوهم': [
             'لَمُنَجُّوهُمْ'], 
   'بلاغ': [
          'بَلَاغٌ'], 
   'ننساهم': [
            'نَنْسَاهُمْ'], 
   'سألها': [
           'سَأَلَهَا'], 
   'فنزل': [
          'فَنُزُلٌ'], 
   'سخرنا': [
           'سَخَّرْنَا'], 
   'وردة': [
          'وَرْدَةً'], 
   'يعرضوا': [
            'يُعْرِضُوا'], 
   'ونتبع': [
           'وَنَتَّبِعِ'], 
   'راق': [
         'رَاقٍ'], 
   'عبادنا': [
            'عِبَادِنَا',
            'عِبَادَنَا'], 
   'المطمئنة': [
              'الْمُطْمَئِنَّةُ'], 
   'بلاء': [
          'بَلَاءٌ',
          'بَلَاءً'], 
   'وردا': [
          'وِرْدًا'], 
   'الفاتحين': [
              'الْفَاتِحِينَ'], 
   'ولعذاب': [
            'وَلَعَذَابُ'], 
   'المرسلون': [
              'الْمُرْسَلُونَ'], 
   'لميقات': [
            'لِمِيقَاتِ'], 
   'بخلاقهم': [
             'بِخَلَاقِهِمْ'], 
   'خشي': [
         'خَشِيَ'], 
   'جثيا': [
          'جِثِيًّا'], 
   'يستويان': [
             'يَسْتَوِيَانِ'], 
   'تقاتل': [
           'تُقَاتِلُ'], 
   'نذورهم': [
            'نُذُورَهُمْ'], 
   'ضراء': [
          'ضَرَّاءَ'], 
   'أوينا': [
           'أَوَيْنَا'], 
   'يعلمه': [
           'يَعْلَمْهُ',
           'يُعَلِّمُهُ',
           'يَعْلَمُهُ',
           'يَعْلَمَهُ'], 
   'قاسية': [
           'قَاسِيَةً'], 
   'تفتنون': [
            'تُفْتَنُونَ'], 
   'عزمت': [
          'عَزَمْتَ'], 
   'نحلة': [
          'نِحْلَةً'], 
   'المستبين': [
              'الْمُسْتَبِينَ'], 
   'عزما': [
          'عَزْمًا'], 
   'الإصباح': [
             'الْإِصْبَاحِ'], 
   'وللرسول': [
             'وَلِلرَّسُولِ'], 
   'فاقتلوهم': [
              'فَاقْتُلُوهُمْ'], 
   'يصيب': [
          'يُصِيبُ'], 
   'وأمهات': [
            'وَأُمَّهَاتُ'], 
   'فاحذروه': [
             'فَاحْذَرُوهُ'], 
   'فتشابه': [
            'فَتَشَابَهَ'], 
   'لشيء': [
          'لَشَيْءٌ',
          'لِشَيْءٍ'], 
   'بلسان': [
           'بِلِسَانِ',
           'بِلِسَانٍ'], 
   'الأبيض': [
            'الْأَبْيَضُ'], 
   'صاغرون': [
            'صَاغِرُونَ'], 
   'مجموع': [
           'مَجْمُوعٌ'], 
   'أطعنا': [
           'أَطَعْنَا'], 
   'يجحد': [
          'يَجْحَدُ'], 
   'وعربي': [
           'وَعَرَبِيٌّ'], 
   'نجازي': [
           'نُجَازِي'], 
   'موضوعة': [
            'مَوْضُوعَةٌ'], 
   'أفاض': [
          'أَفَاضَ'], 
   'الصدور': [
            'الصُّدُورِ',
            'الصُّدُورُ'], 
   'القرآن': [
            'الْقُرْآنَ',
            'الْقُرْآنِ',
            'الْقُرْآنُ'], 
   'النمل': [
           'النَّمْلِ',
           'النَّمْلُ'], 
   'مهلكو': [
           'مُهْلِكُو'], 
   'قعود': [
          'قُعُودٌ'], 
   'الفتية': [
            'الْفِتْيَةُ'], 
   'وينصرون': [
             'وَيَنْصُرُونَ'], 
   'بأيد': [
          'بِأَيْدٍ'], 
   'بالجبت': [
            'بِالْجِبْتِ'], 
   'الشرك': [
           'الشِّرْكَ'], 
   'الفجرة': [
            'الْفَجَرَةُ'], 
   'بنصب': [
          'بِنُصْبٍ'], 
   'مالكون': [
            'مَالِكُونَ'], 
   'نفس': [
         'نَفْسٍ',
         'نَفْسٌ',
         'نَفْسِ'], 
   'نفر': [
         'نَفَرَ',
         'نَفَرٌ'], 
   'وكبره': [
           'وَكَبِّرْهُ'], 
   'لتجري': [
           'لِتَجْرِيَ'], 
   'اخلفني': [
            'اخْلُفْنِي'], 
   'جئتك': [
          'جِئْتُكَ'], 
   'نفخ': [
         'نُفِخَ'], 
   'لنصدقن': [
            'لَنَصَّدَّقَنَّ'], 
   'ليطاع': [
           'لِيُطَاعَ'], 
   'إسرارا': [
            'إِسْرَارًا'], 
   'العالمون': [
              'الْعَالِمُونَ'], 
   'يدرسونها': [
              'يَدْرُسُونَهَا'], 
   'قدروا': [
           'قَدَرُوا'], 
   'فلن': [
         'فَلَنْ'], 
   'ركاما': [
           'رُكَامًا'], 
   'وأسلموا': [
             'وَأَسْلِمُوا'], 
   'يرتدد': [
           'يَرْتَدِدْ'], 
   'سكينة': [
           'سَكِينَةٌ'], 
   'تنقضوا': [
            'تَنْقُضُوا'], 
   'جند': [
         'جُنْدٌ',
         'جُنْدٍ'], 
   'احمل': [
          'احْمِلْ'], 
   'جنة': [
         'جِنَّةٌ',
         'جَنَّةٍ',
         'جَنَّةٌ',
         'جِنَّةٍ',
         'جُنَّةً',
         'جَنَّةُ',
         'جَنَّةِ',
         'جَنَّةَ',
         'جَنَّةً'], 
   'جنب': [
         'جُنُبٍ',
         'جَنْبِ'], 
   'تسكن': [
          'تُسْكَنْ'], 
   'أنذروا': [
            'أُنْذِرُوا',
            'أَنْذِرُوا'], 
   'نجاهم': [
           'نَجَّاهُمْ'], 
   'وعلم': [
          'وَعَلَّمَ',
          'وَعَلِمَ'], 
   'مستقيما': [
             'مُسْتَقِيمًا'], 
   'وعلى': [
          'وَعَلَى'], 
   'زلقا': [
          'زَلَقًا'], 
   'فجزاؤه': [
            'فَجَزَاؤُهُ'], 
   'قاعدا': [
           'قَاعِدًا'], 
   'حاجوك': [
           'حَاجُّوكَ'], 
   'تجهروا': [
            'تَجْهَرُوا'], 
   'وغرابيب': [
             'وَغَرَابِيبُ'], 
   'عسيرا': [
           'عَسِيرًا'], 
   'رهط': [
         'رَهْطٍ'], 
   'طويلا': [
           'طَوِيلًا'], 
   'ينفضوا': [
            'يَنْفَضُّوا'], 
   'آمنوا': [
           'آمَنُوا',
           'آمِنُوا'], 
   'لتولوا': [
            'لَتَوَلَّوْا'], 
   'مبرءون': [
            'مُبَرَّءُونَ'], 
   'فأصابتكم': [
              'فَأَصَابَتْكُمْ'], 
   'يتلى': [
          'يُتْلَى'], 
   'ينصرني': [
            'يَنْصُرُنِي'], 
   'بدأ': [
         'بَدَأَ'], 
   'يمين': [
          'يَمِينٍ'], 
   'حولكم': [
           'حَوْلَكُمْ'], 
   'باطنه': [
           'بَاطِنُهُ'], 
   'ولأخي': [
           'وَلِأَخِي'], 
   'تجعلونه': [
             'تَجْعَلُونَهُ'], 
   'حجرا': [
          'حِجْرًا'], 
   'بالناس': [
            'بِالنَّاسِ'], 
   'فأنجاه': [
            'فَأَنْجَاهُ'], 
   'يهوديا': [
            'يَهُودِيًّا'], 
   'عسر': [
         'عُسْرٍ',
         'عَسِرٌ'], 
   'وصدف': [
          'وَصَدَفَ'], 
   'وصدق': [
          'وَصَدَّقَ',
          'وَصَدَقَ'], 
   'عسى': [
         'عَسَى'], 
   'فعاقبوا': [
             'فَعَاقِبُوا'], 
   'الثرى': [
           'الثَّرَى'], 
   'عسق': [
         'عسق'], 
   'ليئوس': [
           'لَيَئُوسٌ'], 
   'وحدائق': [
            'وَحَدَائِقَ'], 
   'عسل': [
         'عَسَلٍ'], 
   'فارجعوا': [
             'فَارْجِعُوا'], 
   'أتخذناهم': [
              'أَتَّخَذْنَاهُمْ'], 
   'فليعمل': [
            'فَلْيَعْمَلْ',
            'فَلْيَعْمَلِ'], 
   'والذاريات': [
               'وَالذَّارِيَاتِ'], 
   'أكفلنيها': [
              'أَكْفِلْنِيهَا'], 
   'الأخ': [
          'الْأَخِ'], 
   'أزفت': [
          'أَزِفَتِ'], 
   'بربوة': [
           'بِرَبْوَةٍ'], 
   'غدقا': [
          'غَدَقًا'], 
   'وأسقيناكم': [
               'وَأَسْقَيْنَاكُمْ'], 
   'موطئا': [
           'مَوْطِئًا'], 
   'أنزلني': [
            'أَنْزِلْنِي'], 
   'وتحرير': [
            'وَتَحْرِيرُ'], 
   'يؤاخذ': [
           'يُؤَاخِذُ'], 
   'صلوات': [
           'صَلَوَاتٌ'], 
   'تعدل': [
          'تَعْدِلْ'], 
   'ونجيناهم': [
              'وَنَجَّيْنَاهُمْ'], 
   'خمسين': [
           'خَمْسِينَ'], 
   'سيريكم': [
            'سَيُرِيكُمْ'], 
   'ويصرفه': [
            'وَيَصْرِفُهُ'], 
   'تطهرهم': [
            'تُطَهِّرُهُمْ'], 
   'تفكهون': [
            'تَفَكَّهُونَ'], 
   'فقتله': [
           'فَقَتَلَهُ'], 
   'مسكينا': [
            'مِسْكِينًا'], 
   'أهانن': [
           'أَهَانَنِ'], 
   'تذهب': [
          'تَذْهَبْ'], 
   'الرؤيا': [
            'الرُّؤْيَا'], 
   'يغير': [
          'يُغَيِّرُ'], 
   'إسلامهم': [
             'إِسْلَامِهِمْ'], 
   'ولأمة': [
           'وَلَأَمَةٌ'], 
   'برءوسكم': [
             'بِرُءُوسِكُمْ'], 
   'يحذر': [
          'يَحْذَرُ'], 
   'أفنضرب': [
            'أَفَنَضْرِبُ'], 
   'ظنكم': [
          'ظَنُّكُمْ',
          'ظَنُّكُمُ'], 
   'وظلها': [
           'وَظِلُّهَا'], 
   'ويكأنه': [
            'وَيْكَأَنَّهُ'], 
   'بشماله': [
            'بِشِمَالِهِ'], 
   'تحلة': [
          'تَحِلَّةَ'], 
   'ليضيع': [
           'لِيُضِيعَ'], 
   'فسجد': [
          'فَسَجَدَ'], 
   'والكافرين': [
               'وَالْكَافِرِينَ'], 
   'بخلقهن': [
            'بِخَلْقِهِنَّ'], 
   'بشرككم': [
            'بِشِرْكِكُمْ'], 
   'يبعثك': [
           'يَبْعَثَكَ'], 
   'ووالد': [
           'وَوَالِدٍ'], 
   'بئس': [
         'بِئْسَ'], 
   'فرددناه': [
             'فَرَدَدْنَاهُ'], 
   'وعقبى': [
           'وَعُقْبَى'], 
   'زلزالا': [
            'زِلْزَالًا'], 
   'ونراه': [
           'وَنَرَاهُ'], 
   'أدعيائهم': [
              'أَدْعِيَائِهِمْ'], 
   'فاجنح': [
           'فَاجْنَحْ'], 
   'شغلتنا': [
            'شَغَلَتْنَا'], 
   'واشتعل': [
            'وَاشْتَعَلَ'], 
   'لأذقناك': [
             'لَأَذَقْنَاكَ'], 
   'فطرت': [
          'فِطْرَتَ'], 
   'المعز': [
           'الْمَعْزِ'], 
   'وتنهون': [
            'وَتَنْهَوْنَ'], 
   'نعلمهم': [
            'نَعْلَمُهُمْ'], 
   'آمنون': [
           'آمِنُونَ'], 
   'وأكبر': [
           'وَأَكْبَرُ'], 
   'كباسط': [
           'كَبَاسِطِ'], 
   'وجفان': [
           'وَجِفَانٍ'], 
   'وأنيبوا': [
             'وَأَنِيبُوا'], 
   'عائلا': [
           'عَائِلًا'], 
   'مرجون': [
           'مُرْجَوْنَ'], 
   'فأنجيناهم': [
               'فَأَنْجَيْنَاهُمْ'], 
   'ورباع': [
           'وَرُبَاعَ'], 
   'لواحة': [
           'لَوَّاحَةٌ'], 
   'فلعنة': [
           'فَلَعْنَةُ'], 
   'اتخذ': [
          'اتَّخَذَ'], 
   'وفيها': [
           'وَفِيهَا'], 
   'ينجيه': [
           'يُنْجِيهِ'], 
   'وقبل': [
          'وَقَبْلَ'], 
   'فأبين': [
           'فَأَبَيْنَ'], 
   'المتوكلين': [
               'الْمُتَوَكِّلِينَ'], 
   'بأوعيتهم': [
              'بِأَوْعِيَتِهِمْ'], 
   'نبطش': [
          'نَبْطِشُ'], 
   'أفهم': [
          'أَفَهُمْ',
          'أَفَهُمُ'], 
   'وثلاث': [
           'وَثُلَاثَ'], 
   'فصدقت': [
           'فَصَدَقَتْ'], 
   'غلمان': [
           'غِلْمَانٌ'], 
   'تستخفونها': [
               'تَسْتَخِفُّونَهَا'], 
   'وخسر': [
          'وَخَسِرَ'], 
   'يظهروه': [
            'يَظْهَرُوهُ'], 
   'حملوا': [
           'حُمِّلُوا'], 
   'ورأيتهم': [
             'وَرَأَيْتَهُمْ'], 
   'وابتلوا': [
             'وَابْتَلُوا'], 
   'اعترفوا': [
             'اعْتَرَفُوا'], 
   'ضر': [
        'ضُرٍّ',
        'ضُرٌّ'], 
   'ويحرمونه': [
              'وَيُحَرِّمُونَهُ'], 
   'آنست': [
          'آنَسْتُ'], 
   'رزقناه': [
            'رَزَقْنَاهُ'], 
   'اثني': [
          'اثْنَيْ'], 
   'لحسرة': [
           'لَحَسْرَةٌ'], 
   'تبارك': [
           'تَبَارَكَ'], 
   'تنجيكم': [
            'تُنْجِيكُمْ'], 
   'يقنت': [
          'يَقْنُتْ'], 
   'وليخزي': [
            'وَلِيُخْزِيَ'], 
   'تلبثوا': [
            'تَلَبَّثُوا'], 
   'أمنة': [
          'أَمَنَةً'], 
   'وسيجنبها': [
              'وَسَيُجَنَّبُهَا'], 
   'عملك': [
          'عَمَلُكَ'], 
   'يجبى': [
          'يُجْبَى'], 
   'شهيد': [
          'شَهِيدٌ',
          'شَهِيدٍ'], 
   'تقدموا': [
            'تُقَدِّمُوا'], 
   'فاعبده': [
            'فَاعْبُدْهُ'], 
   'فيسقي': [
           'فَيَسْقِي'], 
   'للمقوين': [
             'لِلْمُقْوِينَ'], 
   'فعلنا': [
           'فَعَلْنَا'], 
   'ولقاء': [
           'وَلِقَاءِ'], 
   'ترجمون': [
            'تَرْجُمُونِ'], 
   'واختلفوا': [
              'وَاخْتَلَفُوا'], 
   'والفؤاد': [
             'وَالْفُؤَادَ'], 
   'أبصارنا': [
             'أَبْصَارُنَا'], 
   'للمتوسمين': [
               'لِلْمُتَوَسِّمِينَ'], 
   'ذوقوا': [
           'ذُوقُوا'], 
   'هدا': [
         'هَدًّا'], 
   'فقاتلا': [
            'فَقَاتِلَا'], 
   'ضل': [
        'ضَلَّ'], 
   'فسترضع': [
            'فَسَتُرْضِعُ'], 
   'يظهروا': [
            'يَظْهَرُوا'], 
   'بقادر': [
           'بِقَادِرٍ'], 
   'ويستحيي': [
             'وَيَسْتَحْيِي'], 
   'نوحيه': [
           'نُوحِيهِ'], 
   'لاتبعوك': [
             'لَاتَّبَعُوكَ'], 
   'ليريكم': [
            'لِيُرِيَكُمْ'], 
   'فتلقى': [
           'فَتُلْقَى',
           'فَتَلَقَّى'], 
   'وأنكم': [
           'وَأَنَّكُمْ'], 
   'فأمتعه': [
            'فَأُمَتِّعُهُ'], 
   'مكانتهم': [
             'مَكَانَتِهِمْ'], 
   'أحلنا': [
           'أَحَلَّنَا'], 
   'وخسف': [
          'وَخَسَفَ'], 
   'اثنا': [
          'اثْنَا'], 
   'تبارا': [
           'تَبَارًا'], 
   'فاعتدوا': [
             'فَاعْتَدُوا'], 
   'ويبشر': [
           'وَيُبَشِّرُ',
           'وَيُبَشِّرَ'], 
   'ابتلى': [
           'ابْتَلَى'], 
   'فتطاول': [
            'فَتَطَاوَلَ'], 
   'ووصى': [
          'وَوَصَّى'], 
   'وشراب': [
           'وَشَرَابٍ',
           'وَشَرَابٌ'], 
   'منهمر': [
           'مُنْهَمِرٍ'], 
   'أيود': [
          'أَيَوَدُّ'], 
   'اليوم': [
           'الْيَوْمَ',
           'الْيَوْمُ',
           'الْيَوْمِ'], 
   'وليربط': [
            'وَلِيَرْبِطَ'], 
   'وتصلحوا': [
             'وَتُصْلِحُوا'], 
   'أكرهتنا': [
             'أَكْرَهْتَنَا'], 
   'مرض': [
         'مَرَضٌ'], 
   'مرة': [
         'مَرَّةٍ',
         'مَرَّةً',
         'مِرَّةٍ'], 
   'رضوانه': [
            'رِضْوَانَهُ'], 
   'مرج': [
         'مَرَجَ'], 
   'ووجوه': [
           'وَوُجُوهٌ'], 
   'عصوك': [
          'عَصَوْكَ'], 
   'الراسخون': [
              'الرَّاسِخُونَ'], 
   'ترهقهم': [
            'تَرْهَقُهُمْ'], 
   'خدك': [
         'خَدَّكَ'], 
   'جاهداك': [
            'جَاهَدَاكَ'], 
   'اصطفى': [
           'اصْطَفَى'], 
   'وزينتها': [
             'وَزِينَتَهَا',
             'وَزِينَتُهَا'], 
   'جباههم': [
            'جِبَاهُهُمْ'], 
   'فانبجست': [
             'فَانْبَجَسَتْ'], 
   'زالت': [
          'زَالَتْ'], 
   'خشيته': [
           'خَشْيَتِهِ'], 
   'يفرح': [
          'يَفْرَحُ'], 
   'تكذبان': [
            'تُكَذِّبَانِ'], 
   'فاستكبروا': [
               'فَاسْتَكْبَرُوا'], 
   'شفاعتهم': [
             'شَفَاعَتُهُمْ'], 
   'ترتابوا': [
             'تَرْتَابُوا'], 
   'يفرط': [
          'يَفْرُطَ'], 
   'يعذبنا': [
            'يُعَذِّبُنَا'], 
   'لبغوا': [
           'لَبَغَوْا'], 
   'للغاوين': [
             'لِلْغَاوِينَ'], 
   'يفرق': [
          'يُفْرَقُ'], 
   'كادت': [
          'كَادَتْ'], 
   'آمنت': [
          'آمَنَتْ',
          'آمَنْتُ'], 
   'حقبا': [
          'حُقُبًا'], 
   'ويذهبا': [
            'وَيَذْهَبَا'], 
   'زاهق': [
          'زَاهِقٌ'], 
   'ليعذبهم': [
             'لِيُعَذِّبَهُمْ'], 
   'اقرءوا': [
            'اقْرَءُوا'], 
   'أرحامهن': [
             'أَرْحَامِهِنَّ'], 
   'حديد': [
          'حَدِيدٍ',
          'حَدِيدٌ'], 
   'يبغونكم': [
             'يَبْغُونَكُمُ'], 
   'عموا': [
          'عَمُوا'], 
   'أسماء': [
           'أَسْمَاءٍ',
           'أَسْمَاءٌ',
           'أَسْمَاءً'], 
   'جد': [
        'جَدُّ'], 
   'ترهقها': [
            'تَرْهَقُهَا'], 
   'واعية': [
           'وَاعِيَةٌ'], 
   'ولتستبين': [
              'وَلِتَسْتَبِينَ'], 
   'بالدهن': [
            'بِالدُّهْنِ'], 
   'ورجلك': [
           'وَرَجِلِكَ'], 
   'وأخيه': [
           'وَأَخِيهِ'], 
   'نادانا': [
            'نَادَانَا'], 
   'بياتا': [
           'بَيَاتًا'], 
   'تنزلت': [
           'تَنَزَّلَتْ'], 
   'الأيدي': [
            'الْأَيْدِي'], 
   'والخبيثون': [
               'وَالْخَبِيثُونَ'], 
   'ويا': [
         'وَيَا'], 
   'يأمنوكم': [
             'يَأْمَنُوكُمْ'], 
   'ليسمون': [
            'لَيُسَمُّونَ'], 
   'ليذكروا': [
             'لِيَذَّكَّرُوا',
             'لِيَذْكُرُوا'], 
   'سيدخلهم': [
             'سَيُدْخِلُهُمُ'], 
   'أمضي': [
          'أَمْضِيَ'], 
   'فانشزوا': [
             'فَانْشُزُوا'], 
   'مأواكم': [
            'مَأْوَاكُمُ'], 
   'أفطال': [
           'أَفَطَالَ'], 
   'وبأيمانهم': [
               'وَبِأَيْمَانِهِمْ'], 
   'تقاتلوهم': [
              'تُقَاتِلُوهُمْ'], 
   'إلا': [
         'إِلَّا',
         'إِلًّا'], 
   'أوفي': [
          'أُوفِي'], 
   'لشركائنا': [
              'لِشُرَكَائِنَا'], 
   'أوفى': [
          'أَوْفَى'], 
   'تذليلا': [
            'تَذْلِيلًا'], 
   'المعذبين': [
              'الْمُعَذَّبِينَ'], 
   'خلفكم': [
           'خَلْفَكُمْ'], 
   'ودانية': [
            'وَدَانِيَةً'], 
   'ومستودعها': [
               'وَمُسْتَوْدَعَهَا'], 
   'يمشون': [
           'يَمْشُونَ'], 
   'فنردها': [
            'فَنَرُدَّهَا'], 
   'نصفه': [
          'نِصْفَهُ'], 
   'كتابهم': [
            'كِتَابَهُمْ'], 
   'والإبكار': [
              'وَالْإِبْكَارِ'], 
   'يتلون': [
           'يَتْلُونَ'], 
   'الأختين': [
             'الْأُخْتَيْنِ'], 
   'إله': [
         'إِلَهَ',
         'إِلَهٌ',
         'إِلَهٍ',
         'إِلَهِ'], 
   'إلي': [
         'إِلَيَّ'], 
   'ولتكملوا': [
              'وَلِتُكْمِلُوا'], 
   'فريضة': [
           'فَرِيضَةً'], 
   'إلى': [
         'إِلَى'], 
   'سهولها': [
            'سُهُولِهَا'], 
   'يلمزون': [
            'يَلْمِزُونَ'], 
   'لمهلكهم': [
             'لِمَهْلِكِهِمْ'], 
   'واترك': [
           'وَاتْرُكِ'], 
   'سآوي': [
          'سَآوِي'], 
   'ورجلا': [
           'وَرَجُلًا'], 
   'أعناقهم': [
             'أَعْنَاقِهِمْ',
             'أَعْنَاقُهُمْ'], 
   'الشمال': [
            'الشِّمَالِ'], 
   'نحشرهم': [
            'نَحْشُرُهُمْ'], 
   'بالطاغوت': [
              'بِالطَّاغُوتِ'], 
   'عامهم': [
           'عَامِهِمْ'], 
   'فيصيب': [
           'فَيُصِيبُ'], 
   'أكره': [
          'أُكْرِهَ'], 
   'ويل': [
         'وَيْلٌ'], 
   'سكرت': [
          'سُكِّرَتْ'], 
   'فيقتلون': [
             'فَيَقْتُلُونَ'], 
   'أتريدون': [
             'أَتُرِيدُونَ'], 
   'أسر': [
         'أَسْرِ',
         'أَسَرَّ'], 
   'نؤخره': [
           'نُؤَخِّرُهُ'], 
   'أسس': [
         'أَسَّسَ',
         'أُسِّسَ'], 
   'نسأل': [
          'نُسْأَلُ'], 
   'وآتى': [
          'وَآتَى'], 
   'وليعلموا': [
              'وَلِيَعْلَمُوا'], 
   'وكلبهم': [
            'وَكَلْبُهُمْ'], 
   'وأسروه': [
            'وَأَسَرُّوهُ'], 
   'تبديلا': [
            'تَبْدِيلًا'], 
   'بالشمس': [
            'بِالشَّمْسِ'], 
   'الحمد': [
           'الْحَمْدُ'], 
   'فرعون': [
           'فِرْعَوْنَ',
           'فِرْعَوْنُ'], 
   'طيبة': [
          'طَيِّبَةً',
          'طَيِّبَةٍ',
          'طَيِّبَةٌ'], 
   'ينزفون': [
            'يُنْزِفُونَ',
            'يُنْزَفُونَ'], 
   'الضراء': [
            'الضَّرَّاءُ'], 
   'بحكمه': [
           'بِحُكْمِهِ'], 
   'ضربوا': [
           'ضَرَبُوا'], 
   'ينتظر': [
           'يَنْتَظِرُ'], 
   'بالأذن': [
            'بِالْأُذُنِ'], 
   'وتول': [
          'وَتَوَلَّ'], 
   'تسع': [
         'تِسْعِ',
         'تِسْعَ',
         'تِسْعٌ'], 
   'للشياطين': [
              'لِلشَّيَاطِينِ'], 
   'قلوبنا': [
            'قُلُوبُنَا',
            'قُلُوبِنَا',
            'قُلُوبَنَا'], 
   'تحزن': [
          'تَحْزَنْ',
          'تَحْزَنَ'], 
   'بذكر': [
          'بِذِكْرِ'], 
   'الصدقات': [
             'الصَّدَقَاتِ',
             'الصَّدَقَاتُ'], 
   'أنا': [
         'أَنَا',
         'أَنَّا'], 
   'فأنذرتكم': [
              'فَأَنْذَرْتُكُمْ'], 
   'تقربوها': [
             'تَقْرَبُوهَا'], 
   'تنكرون': [
            'تُنْكِرُونَ'], 
   'قترة': [
          'قَتَرَةٌ'], 
   'منزلا': [
           'مُنْزَلًا'], 
   'يدريك': [
           'يُدْرِيكَ'], 
   'خطبكما': [
            'خَطْبُكُمَا'], 
   'الممترين': [
              'الْمُمْتَرِينَ'], 
   'قضيت': [
          'قُضِيَتِ',
          'قَضَيْتُ',
          'قَضَيْتَ'], 
   'يستهزئون': [
              'يَسْتَهْزِئُونَ'], 
   'أنى': [
         'أَنَّى'], 
   'حرثكم': [
           'حَرْثِكُمْ',
           'حَرْثَكُمْ'], 
   'أنه': [
         'أَنَّهُ'], 
   'الرعد': [
           'الرَّعْدُ'], 
   'أنك': [
         'أَنَّكَ'], 
   'أفصح': [
          'أَفْصَحُ'], 
   'ادعوني': [
            'ادْعُونِي'], 
   'تقربوهن': [
             'تَقْرَبُوهُنَّ'], 
   'جحيم': [
          'جَحِيمٍ'], 
   'أضطره': [
           'أَضْطَرُّهُ'], 
   'وأورثناها': [
               'وَأَوْرَثْنَاهَا'], 
   'بئسما': [
           'بِئْسَمَا'], 
   'تؤزهم': [
           'تَؤُزُّهُمْ'], 
   'ينفوا': [
           'يُنْفَوْا'], 
   'وآتت': [
          'وَآتَتْ'], 
   'ستين': [
          'سِتِّينَ'], 
   'ميعاد': [
           'مِيعَادُ'], 
   'وأسروا': [
            'وَأَسَرُّوا',
            'وَأَسِرُّوا'], 
   'الفرقان': [
             'الْفُرْقَانَ',
             'الْفُرْقَانِ'], 
   'الأقدمون': [
              'الْأَقْدَمُونَ'], 
   'تقسطوا': [
            'تُقْسِطُوا'], 
   'فالمغيرات': [
               'فَالْمُغِيرَاتِ'], 
   'المحرم': [
            'الْمُحَرَّمِ'], 
   'خيفة': [
          'خِيفَةً'], 
   'زنيم': [
          'زَنِيمٍ'], 
   'سلقوكم': [
            'سَلَقُوكُمْ'], 
   'أزواجكم': [
             'أَزْوَاجِكُمْ',
             'أَزْوَاجُكُمْ',
             'أَزْوَاجَكُمُ'], 
   'وعذاب': [
           'وَعَذَابٌ',
           'وَعَذَابٍ'], 
   'أكثركم': [
            'أَكْثَرَكُمْ'], 
   'للمسلمين': [
              'لِلْمُسْلِمِينَ'], 
   'سئل': [
         'سُئِلَ'], 
   'فانتهوا': [
             'فَانْتَهُوا'], 
   'للمكذبين': [
              'لِلْمُكَذِّبِينَ'], 
   'وأنذرهم': [
             'وَأَنْذِرْهُمْ'], 
   'مهدا': [
          'مَهْدًا'], 
   'ظننا': [
          'ظَنَنَّا'], 
   'وودوا': [
           'وَوَدُّوا'], 
   'ويذرهم': [
            'وَيَذَرُهُمْ'], 
   'خطاياكم': [
             'خَطَايَاكُمْ'], 
   'تعمدت': [
           'تَعَمَّدَتْ'], 
   'المخبتين': [
              'الْمُخْبِتِينَ'], 
   'وقياما': [
            'وَقِيَامًا'], 
   'أيديهما': [
             'أَيْدِيَهُمَا'], 
   'واتبعنا': [
             'وَاتَّبَعْنَا'], 
   'طمست': [
          'طُمِسَتْ'], 
   'أنكحك': [
           'أُنْكِحَكَ'], 
   'والقاسية': [
              'وَالْقَاسِيَةِ'], 
   'كاشفة': [
           'كَاشِفَةٌ'], 
   'دأبا': [
          'دَأَبًا'], 
   'الخطاب': [
            'الْخِطَابِ'], 
   'يستضعف': [
            'يَسْتَضْعِفُ'], 
   'بعث': [
         'بَعَثَ'], 
   'بعد': [
         'بَعْدِ',
         'بَعْدَ',
         'بَعْدُ',
         'بُعْدَ'], 
   'انطلقوا': [
             'انْطَلِقُوا'], 
   'نكدا': [
          'نَكِدًا'], 
   'سألتهم': [
            'سَأَلْتَهُمْ'], 
   'بعض': [
         'بَعْضٍ',
         'بَعْضَ',
         'بَعْضُ',
         'بَعْضِ'], 
   'الدين': [
           'الدِّينِ',
           'الدِّينَ',
           'الدِّينُ'], 
   'أمرتني': [
            'أَمَرْتَنِي'], 
   'ستكتب': [
           'سَتُكْتَبُ'], 
   'استبدال': [
             'اسْتِبْدَالَ'], 
   'المسجونين': [
               'الْمَسْجُونِينَ'], 
   'يحييكم': [
            'يُحْيِيكُمْ'], 
   'فضله': [
          'فَضْلِهِ',
          'فَضْلَهُ'], 
   'واستيقنتها': [
                'وَاسْتَيْقَنَتْهَا'], 
   'زينا': [
          'زَيَّنَّا'], 
   'مفروضا': [
            'مَفْرُوضًا'], 
   'إلينا': [
           'إِلَيْنَا'], 
   'يتخافتون': [
              'يَتَخَافَتُونَ'], 
   'زينة': [
          'زِينَةَ',
          'زِينَةً',
          'زِينَةِ',
          'زِينَةُ'], 
   'تستقسموا': [
              'تَسْتَقْسِمُوا'], 
   'طائرهم': [
            'طَائِرُهُمْ'], 
   'فانطلقوا': [
              'فَانْطَلَقُوا'], 
   'ابتلاه': [
            'ابْتَلَاهُ'], 
   'ولتأت': [
           'وَلْتَأْتِ'], 
   'المحصنات': [
              'الْمُحْصَنَاتِ'], 
   'مرضية': [
           'مَرْضِيَّةً'], 
   'مرضيا': [
           'مَرْضِيًّا'], 
   'فزع': [
         'فُزِّعَ',
         'فَزَعٍ'], 
   'كذلكم': [
           'كَذَلِكُمْ'], 
   'إني': [
         'إِنِّي'], 
   'بأهوائهم': [
              'بِأَهْوَائِهِمْ'], 
   'ابنه': [
          'ابْنَهُ'], 
   'عسير': [
          'عَسِيرٌ'], 
   'لنجعلها': [
             'لِنَجْعَلَهَا'], 
   'كارهين': [
            'كَارِهِينَ'], 
   'سنلقي': [
           'سَنُلْقِي'], 
   'كاشفو': [
           'كَاشِفُو'], 
   'مبطلون': [
            'مُبْطِلُونَ'], 
   'نفقاتهم': [
             'نَفَقَاتُهُمْ'], 
   'ألفت': [
          'أَلَّفْتَ'], 
   'يومكم': [
           'يَوْمِكُمْ',
           'يَوْمُكُمُ'], 
   'فاسقين': [
            'فَاسِقِينَ'], 
   'بيوتهم': [
            'بُيُوتُهُمْ',
            'بُيُوتَهُمْ'], 
   'فذاقت': [
           'فَذَاقَتْ'], 
   'وفرشا': [
           'وَفَرْشًا'], 
   'للخير': [
           'لِلْخَيْرِ'], 
   'والمرجفون': [
               'وَالْمُرْجِفُونَ'], 
   'تأمرك': [
           'تَأْمُرُكَ'], 
   'بخلق': [
          'بِخَلْقٍ'], 
   'يثقفوكم': [
             'يَثْقَفُوكُمْ'], 
   'الطيبات': [
             'الطَّيِّبَاتِ',
             'الطَّيِّبَاتُ'], 
   'وللدار': [
            'وَلَلدَّارُ'], 
   'ناقة': [
          'نَاقَةُ',
          'نَاقَةَ',
          'نَاقَةٌ'], 
   'فريقان': [
            'فَرِيقَانِ'], 
   'ليسوا': [
           'لَيْسُوا'], 
   'كثيبا': [
           'كَثِيبًا'], 
   'الميثاق': [
             'الْمِيثَاقَ'], 
   'فاتقون': [
            'فَاتَّقُونِ'], 
   'أخرنا': [
           'أَخِّرْنَا',
           'أَخَّرْنَا'], 
   'يذوقوا': [
            'يَذُوقُوا'], 
   'النبيون': [
             'النَّبِيُّونَ'], 
   'وأحصى': [
           'وَأَحْصَى'], 
   'وإلهنا': [
            'وَإِلَهُنَا'], 
   'ترين': [
          'تَرَيِنَّ'], 
   'أدراكم': [
            'أَدْرَاكُمْ'], 
   'أضغانكم': [
             'أَضْغَانَكُمْ'], 
   'فانطلقا': [
             'فَانْطَلَقَا'], 
   'لحافظون': [
             'لَحَافِظُونَ'], 
   'يأفكون': [
            'يَأْفِكُونَ'], 
   'وأهديك': [
            'وَأَهْدِيَكَ'], 
   'فلكم': [
          'فَلَكُمْ',
          'فَلَكُمُ'], 
   'أهدكم': [
           'أَهْدِكُمْ'], 
   'فاتقوا': [
            'فَاتَّقُوا'], 
   'عاليها': [
            'عَالِيَهَا'], 
   'يذوقون': [
            'يَذُوقُونَ'], 
   'اكتسبن': [
            'اكْتَسَبْنَ'], 
   'والعافين': [
              'وَالْعَافِينَ'], 
   'فيصبحوا': [
             'فَيُصْبِحُوا'], 
   'فمنها': [
           'فَمِنْهَا'], 
   'تريد': [
          'تُرِيدُ'], 
   'إصلاحها': [
             'إِصْلَاحِهَا'], 
   'تؤمن': [
          'تُؤْمِنْ',
          'تُؤْمِنَ'], 
   'برجلك': [
           'بِرِجْلِكَ'], 
   'وإثما': [
           'وَإِثْمًا'], 
   'المسبحين': [
              'الْمُسَبِّحِينَ'], 
   'الثابت': [
            'الثَّابِتِ'], 
   'وأهش': [
          'وَأَهُشُّ'], 
   'جدر': [
         'جُدُرٍ'], 
   'يتخيرون': [
             'يَتَخَيَّرُونَ'], 
   'لنغرينك': [
             'لَنُغْرِيَنَّكَ'], 
   'بالأحقاف': [
              'بِالْأَحْقَافِ'], 
   'أوذينا': [
            'أُوذِينَا'], 
   'موتوا': [
           'مُوتُوا'], 
   'ويقبضن': [
            'وَيَقْبِضْنَ'], 
   'أتوه': [
          'أَتَوْهُ'], 
   'كتب': [
         'كُتِبَ',
         'كَتَبَ',
         'كُتُبٍ',
         'كُتُبٌ'], 
   'يغوث': [
          'يَغُوثَ'], 
   'خوف': [
         'خَوْفٌ',
         'خَوْفٍ'], 
   'المكذبين': [
              'الْمُكَذِّبِينَ'], 
   'فلعلك': [
           'فَلَعَلَّكَ'], 
   'يثنون': [
           'يَثْنُونَ'], 
   'محكمة': [
           'مُحْكَمَةٌ'], 
   'أفما': [
          'أَفَمَا'], 
   'واستكبر': [
             'وَاسْتَكْبَرَ'], 
   'جاءتها': [
            'جَاءَتْهَا'], 
   'الناصرين': [
              'النَّاصِرِينَ'], 
   'الخوالف': [
             'الْخَوَالِفِ'], 
   'كفلين': [
           'كِفْلَيْنِ'], 
   'برهان': [
           'بُرْهَانَ',
           'بُرْهَانٌ'], 
   'ق': [
       'ق'], 
   'يسرناه': [
            'يَسَّرْنَاهُ'], 
   'نسبحك': [
           'نُسَبِّحَكَ'], 
   'وأحيط': [
           'وَأُحِيطَ'], 
   'سحابا': [
           'سَحَابًا'], 
   'وأنتم': [
           'وَأَنْتُمْ',
           'وَأَنْتُمُ'], 
   'والقواعد': [
              'وَالْقَوَاعِدُ'], 
   'خيرا': [
          'خَيْرًا'], 
   'حجوركم': [
            'حُجُورِكُمْ'], 
   'بجناحيه': [
             'بِجَنَاحَيْهِ'], 
   'وتستخرجوا': [
               'وَتَسْتَخْرِجُوا'], 
   'وامرأتان': [
              'وَامْرَأَتَانِ'], 
   'ووقاهم': [
            'وَوَقَاهُمْ'], 
   'يطوفون': [
            'يَطُوفُونَ'], 
   'ويزكيكم': [
             'وَيُزَكِّيكُمْ'], 
   'السير': [
           'السَّيْرَ'], 
   'تراءى': [
           'تَرَاءَى'], 
   'فتوكلوا': [
             'فَتَوَكَّلُوا'], 
   'ننساكم': [
            'نَنْسَاكُمْ'], 
   'كبارا': [
           'كُبَّارًا'], 
   'توابا': [
           'تَوَّابًا'], 
   'وتستخرجون': [
               'وَتَسْتَخْرِجُونَ'], 
   'أنبتت': [
           'أَنْبَتَتْ'], 
   'تداينتم': [
             'تَدَايَنْتُمْ'], 
   'فبأي': [
          'فَبِأَيِّ'], 
   'نبعث': [
          'نَبْعَثُ',
          'نَبْعَثَ'], 
   'حرصت': [
          'حَرَصْتَ'], 
   'وقتل': [
          'وَقَتَلَ'], 
   'وأهلي': [
           'وَأَهْلِي'], 
   'مبصرا': [
           'مُبْصِرًا'], 
   'الآمرون': [
             'الْآمِرُونَ'], 
   'يضربون': [
            'يَضْرِبُونَ'], 
   'ونفضل': [
           'وَنُفَضِّلُ'], 
   'أفمن': [
          'أَفَمَنْ',
          'أَفَمِنْ',
          'أَفَمَنِ'], 
   'يخلف': [
          'يُخْلِفُ',
          'يُخْلِفَ'], 
   'يخلق': [
          'يَخْلُقُ',
          'يَخْلُقَ',
          'يُخْلَقْ'], 
   'للإسلام': [
             'لِلْإِسْلَامِ'], 
   'تقيموا': [
            'تُقِيمُوا'], 
   'مبصرة': [
           'مُبْصِرَةً'], 
   'والحرث': [
            'وَالْحَرْثِ'], 
   'يهلكنا': [
            'يُهْلِكُنَا'], 
   'إصري': [
          'إِصْرِي'], 
   'عنقك': [
          'عُنُقِكَ'], 
   'يأكله': [
           'يَأْكُلُهُ',
           'يَأْكُلَهُ'], 
   'يأكلن': [
           'يَأْكُلْنَ'], 
   'عنقه': [
          'عُنُقِهِ'], 
   'استطعتم': [
             'اسْتَطَعْتُمْ'], 
   'الآن': [
          'الْآنَ'], 
   'ربهما': [
           'رَبُّهُمَا',
           'رَبَّهُمَا'], 
   'مطهرة': [
           'مُطَهَّرَةٌ',
           'مُطَهَّرَةٍ',
           'مُطَهَّرَةً'], 
   'مسته': [
          'مَسَّتْهُ'], 
   'فعلوه': [
           'فَعَلُوهُ'], 
   'عاقبة': [
           'عَاقِبَةُ',
           'عَاقِبَةَ'], 
   'أملا': [
          'أَمَلًا'], 
   'ويطوف': [
           'وَيَطُوفُ'], 
   'شهوة': [
          'شَهْوَةً'], 
   'دمر': [
         'دَمَّرَ'], 
   'للفقراء': [
             'لِلْفُقَرَاءِ'], 
   'دمت': [
         'دُمْتُ',
         'دُمْتَ'], 
   'ونبلوكم': [
             'وَنَبْلُوكُمْ'], 
   'ويمسك': [
           'وَيُمْسِكُ'], 
   'الكبر': [
           'الْكِبَرُ',
           'الْكِبَرِ',
           'الْكِبَرَ',
           'الْكُبَرِ'], 
   'فاثبتوا': [
             'فَاثْبُتُوا'], 
   'يسيروا': [
            'يَسِيرُوا'], 
   'فعلوا': [
           'فَعَلُوا'], 
   'مكرمة': [
           'مُكَرَّمَةٍ'], 
   'ورأى': [
          'وَرَأَى'], 
   'تبذيرا': [
            'تَبْذِيرًا'], 
   'أملك': [
          'أَمْلِكُ'], 
   'بألسنة': [
            'بِأَلْسِنَةٍ'], 
   'النفس': [
           'النَّفْسَ',
           'النَّفْسُ'], 
   'أفاق': [
          'أَفَاقَ'], 
   'يهديني': [
            'يَهْدِيَنِي'], 
   'شاقوا': [
           'شَاقُّوا'], 
   'وإياكم': [
            'وَإِيَّاكُمْ'], 
   'كرب': [
         'كَرْبٍ'], 
   'تبصرة': [
           'تَبْصِرَةً'], 
   'نكثوا': [
           'نَكَثُوا'], 
   'الثواب': [
            'الثَّوَابِ',
            'الثَّوَابُ'], 
   'توصون': [
           'تُوصُونَ'], 
   'المنظرين': [
              'الْمُنْظَرِينَ'], 
   'وأخاف': [
           'وَأَخَافُ'], 
   'وأخاه': [
           'وَأَخَاهُ'], 
   'الإيمان': [
             'الْإِيمَانِ',
             'الْإِيمَانُ',
             'الْإِيمَانَ'], 
   'مؤمنة': [
           'مُؤْمِنَةٍ',
           'مُؤْمِنَةٌ',
           'مُؤْمِنَةً'], 
   'فليضحكوا': [
              'فَلْيَضْحَكُوا'], 
   'مؤمنا': [
           'مُؤْمِنًا'], 
   'العاجلة': [
             'الْعَاجِلَةَ'], 
   'تختلفون': [
             'تَخْتَلِفُونَ'], 
   'اركب': [
          'ارْكَبْ'], 
   'فطمسنا': [
            'فَطَمَسْنَا'], 
   'لتقولون': [
             'لَتَقُولُونَ'], 
   'أبناءنا': [
             'أَبْنَاءَنَا'], 
   'يرتع': [
          'يَرْتَعْ'], 
   'يستأخرون': [
              'يَسْتَأْخِرُونَ'], 
   'كالذين': [
            'كَالَّذِينَ'], 
   'استأذنوك': [
              'اسْتَأْذَنُوكَ'], 
   'للأبرار': [
             'لِلْأَبْرَارِ'], 
   'وباطنه': [
            'وَبَاطِنَهُ'], 
   'وغركم': [
           'وَغَرَّكُمْ'], 
   'فعدلك': [
           'فَعَدَلَكَ'], 
   'أنجيناكم': [
              'أَنْجَيْنَاكُمْ'], 
   'مبنية': [
           'مَبْنِيَّةٌ'], 
   'مسد': [
         'مَسَدٍ'], 
   'للحق': [
          'لِلْحَقِّ',
          'لَلْحَقُّ'], 
   'حبل': [
         'حَبْلِ',
         'حَبْلٌ'], 
   'تفتروا': [
            'تَفْتَرُوا'], 
   'يرتد': [
          'يَرْتَدَّ',
          'يَرْتَدُّ'], 
   'وطعامكم': [
             'وَطَعَامُكُمْ'], 
   'وهاجا': [
           'وَهَّاجًا'], 
   'وتؤتوها': [
             'وَتُؤْتُوهَا'], 
   'تظهرون': [
            'تُظْهِرُونَ'], 
   'أربعة': [
           'أَرْبَعَةِ',
           'أَرْبَعَةَ',
           'أَرْبَعَةً',
           'أَرْبَعَةٌ'], 
   'زلفى': [
          'زُلْفَى'], 
   'نمد': [
         'نُمِدُّ'], 
   'ويسقين': [
            'وَيَسْقِينِ'], 
   'عم': [
        'عَمَّ'], 
   'عن': [
        'عَنْ',
        'عَنِ'], 
   'فتوبوا': [
            'فَتُوبُوا'], 
   'رأي': [
         'رَأْيَ'], 
   'ظالمي': [
           'ظَالِمِي'], 
   'يأتينك': [
            'يَأْتِينَكَ'], 
   'المشأمة': [
             'الْمَشْأَمَةِ'], 
   'يأتيني': [
            'يَأْتِيَنِي',
            'يَأْتِينِي'], 
   'نمن': [
         'نَمُنَّ'], 
   'غليظ': [
          'غَلِيظٍ',
          'غَلِيظَ',
          'غَلِيظٌ'], 
   'هادوا': [
           'هَادُوا'], 
   'يسلمون': [
            'يُسْلِمُونَ'], 
   'ليا': [
         'لَيًّا'], 
   'زلفة': [
          'زُلْفَةً'], 
   'يتفرقا': [
            'يَتَفَرَّقَا'], 
   'يسطون': [
           'يَسْطُونَ'], 
   'يريكهم': [
            'يُرِيكَهُمُ'], 
   'وكفروا': [
            'وَكَفَرُوا'], 
   'لك': [
        'لَكَ',
        'لَكِ'], 
   'بديع': [
          'بَدِيعُ'], 
   'يأتينا': [
            'يَأْتِيَنَا',
            'يَأْتِينَا'], 
   'جعلكم': [
           'جَعَلَكُمْ'], 
   'ظالمة': [
           'ظَالِمَةٌ',
           'ظَالِمَةً'], 
   'أحببت': [
           'أَحْبَبْتُ',
           'أَحْبَبْتَ'], 
   'مسهم': [
          'مَسَّهُمْ'], 
   'نصارى': [
           'نَصَارَى'], 
   'لرادك': [
           'لَرَادُّكَ'], 
   'يحلفون': [
            'يَحْلِفُونَ'], 
   'وينهاهم': [
             'وَيَنْهَاهُمْ'], 
   'الحلقوم': [
             'الْحُلْقُومَ'], 
   'ليت': [
         'لَيْتَ'], 
   'الجميل': [
            'الْجَمِيلَ'], 
   'فإذا': [
          'فَإِذَا',
          'فَإِذًا'], 
   'وفرعون': [
            'وَفِرْعَوْنَ',
            'وَفِرْعَوْنُ'], 
   'أصابعهم': [
             'أَصَابِعَهُمْ'], 
   'فصبروا': [
            'فَصَبَرُوا'], 
   'والناهون': [
              'وَالنَّاهُونَ'], 
   'مسه': [
         'مَسَّهُ'], 
   'مسك': [
         'مِسْكٌ'], 
   'تأمرهم': [
            'تَأْمُرُهُمْ'], 
   'والمؤتون': [
              'وَالْمُؤْتُونَ'], 
   'ويخزهم': [
            'وَيُخْزِهِمْ'], 
   'وتأبى': [
           'وَتَأْبَى'], 
   'ويؤخركم': [
             'وَيُؤَخِّرْكُمْ',
             'وَيُؤَخِّرَكُمْ'], 
   'تفترون': [
            'تَفْتَرُونَ'], 
   'واعلموا': [
             'وَاعْلَمُوا'], 
   'وباطنة': [
            'وَبَاطِنَةً'], 
   'اهبطا': [
           'اهْبِطَا'], 
   'الصواعق': [
             'الصَّوَاعِقِ',
             'الصَّوَاعِقَ'], 
   'معقب': [
          'مُعَقِّبَ'], 
   'جهادا': [
           'جِهَادًا'], 
   'امشوا': [
           'امْشُوا'], 
   'ليسجننه': [
             'لَيَسْجُنُنَّهُ'], 
   'انصرفوا': [
             'انْصَرَفُوا'], 
   'أفترى': [
           'أَفْتَرَى'], 
   'بينكم': [
           'بَيْنَكُمْ',
           'بَيْنِكُمْ',
           'بَيْنَكُمُ'], 
   'المجاهدين': [
               'الْمُجَاهِدِينَ'], 
   'يختلفون': [
             'يَخْتَلِفُونَ'], 
   'وأعظم': [
           'وَأَعْظَمَ'], 
   'حاذرون': [
            'حَاذِرُونَ'], 
   'بأحكم': [
           'بِأَحْكَمِ'], 
   'الآيات': [
            'الْآيَاتِ',
            'الْآيَاتُ'], 
   'بالعدل': [
            'بِالْعَدْلِ'], 
   'نفوسكم': [
            'نُفُوسِكُمْ'], 
   'للعابدين': [
              'لِلْعَابِدِينَ'], 
   'لفي': [
         'لَفِي'], 
   'مثلكم': [
           'مِثْلُكُمْ',
           'مِثْلَكُمْ'], 
   'أسوأ': [
          'أَسْوَأَ'], 
   'والدتك': [
            'وَالِدَتِكَ'], 
   'اعتدوا': [
            'اعْتَدَوْا'], 
   'ولنعلمه': [
             'وَلِنُعَلِّمَهُ'], 
   'يونس': [
          'يُونُسَ'], 
   'وجهة': [
          'وِجْهَةٌ'], 
   'وأصلحا': [
            'وَأَصْلَحَا'], 
   'أسوة': [
          'أُسْوَةٌ'], 
   'النادمين': [
              'النَّادِمِينَ'], 
   'يسطرون': [
            'يَسْطُرُونَ'], 
   'والنهار': [
             'وَالنَّهَارِ',
             'وَالنَّهَارَ',
             'وَالنَّهَارُ'], 
   'شنآن': [
          'شَنَآنُ'], 
   'استرق': [
           'اسْتَرَقَ'], 
   'أوزارهم': [
             'أَوْزَارَهُمْ'], 
   'معاجزين': [
             'مُعَاجِزِينَ'], 
   'اليتيم': [
            'الْيَتِيمَ',
            'الْيَتِيمِ'], 
   'وجهه': [
          'وَجْهَهُ',
          'وَجْهِهِ',
          'وَجْهُهُ'], 
   'كمشكاة': [
            'كَمِشْكَاةٍ'], 
   'وجهك': [
          'وَجْهَكَ',
          'وَجْهِكَ'], 
   'مرتقبون': [
             'مُرْتَقِبُونَ'], 
   'اجعلني': [
            'اجْعَلْنِي'], 
   'فكهين': [
           'فَكِهِينَ'], 
   'وجهي': [
          'وَجْهِيَ'], 
   'خولناكم': [
             'خَوَّلْنَاكُمْ'], 
   'تؤمر': [
          'تُؤْمَرُ'], 
   'أدخلوا': [
            'أَدْخِلُوا'], 
   'صلبوه': [
           'صَلَبُوهُ'], 
   'جهاده': [
           'جِهَادِهِ'], 
   'بذكرهم': [
            'بِذِكْرِهِمْ'], 
   'شهداء': [
           'شُهَدَاءَ',
           'شُهَدَاءُ'], 
   'وبلوناهم': [
              'وَبَلَوْنَاهُمْ'], 
   'فدعا': [
          'فَدَعَا'], 
   'خبيرا': [
           'خَبِيرًا'], 
   'الرسل': [
           'الرُّسُلُ',
           'الرُّسُلِ',
           'الرُّسُلَ'], 
   'وأقرضتم': [
             'وَأَقْرَضْتُمُ'], 
   'نجعلها': [
            'نَجْعَلُهَا'], 
   'تأخذه': [
           'تَأْخُذُهُ'], 
   'الأعز': [
           'الْأَعَزُّ'], 
   'وأنبئكم': [
             'وَأُنَبِّئُكُمْ'], 
   'أحلامهم': [
             'أَحْلَامُهُمْ'], 
   'أقبلنا': [
            'أَقْبَلْنَا'], 
   'والرجز': [
            'وَالرُّجْزَ'], 
   'أضغاث': [
           'أَضْغَاثُ'], 
   'نستبق': [
           'نَسْتَبِقُ'], 
   'وبشرى': [
           'وَبُشْرَى'], 
   'ويتلوه': [
            'وَيَتْلُوهُ'], 
   'رقيبا': [
           'رَقِيبًا'], 
   'يرغبوا': [
            'يَرْغَبُوا'], 
   'ومقتا': [
           'وَمَقْتًا'], 
   'خلقتك': [
           'خَلَقْتُكَ'], 
   'خلقته': [
           'خَلَقْتَهُ'], 
   'بعالمين': [
             'بِعَالِمِينَ'], 
   'بهن': [
         'بِهِنَّ'], 
   'يعزب': [
          'يَعْزُبُ'], 
   'بهم': [
         'بِهِمْ',
         'بِهِمُ'], 
   'يرهبون': [
            'يَرْهَبُونَ'], 
   'ألم': [
         'أَلَمْ'], 
   'ألن': [
         'أَلَّنْ',
         'أَلَنْ'], 
   'ألف': [
         'أَلْفَ',
         'أَلْفِ',
         'أَلْفٍ',
         'أَلْفٌ',
         'أَلَّفَ'], 
   'ألق': [
         'أَلْقِ'], 
   'ناعمة': [
           'نَاعِمَةٌ'], 
   'أعجميا': [
            'أَعْجَمِيًّا'], 
   'ولتبلغوا': [
              'وَلِتَبْلُغُوا'], 
   'المهتدي': [
             'الْمُهْتَدِي'], 
   'المأوى': [
            'الْمَأْوَى'], 
   'فذلك': [
          'فَذَلِكَ'], 
   'تصيبوا': [
            'تُصِيبُوا'], 
   'بها': [
         'بِهَا'], 
   'قرة': [
         'قُرَّةِ',
         'قُرَّةَ'], 
   'وبعولتهن': [
              'وَبُعُولَتُهُنَّ'], 
   'جمعوا': [
           'جَمَعُوا'], 
   'بكلمة': [
           'بِكَلِمَةٍ'], 
   'ويعلمه': [
            'وَيُعَلِّمُهُ'], 
   'لعنة': [
          'لَعْنَةُ',
          'لَعْنَةً',
          'لَعْنَةَ'], 
   'تصل': [
         'تُصَلِّ',
         'تَصِلُ'], 
   'غورا': [
          'غَوْرًا'], 
   'أحكم': [
          'أَحْكَمُ'], 
   'أأنزل': [
           'أَأُنْزِلَ'], 
   'لعنا': [
          'لَعْنًا',
          'لَعَنَّا'], 
   'تستغفر': [
            'تَسْتَغْفِرْ'], 
   'رحالهم': [
            'رِحَالِهِمْ'], 
   'تبرأ': [
          'تَبَرَّأَ'], 
   'أنجانا': [
            'أَنْجَانَا'], 
   'أوزارها': [
             'أَوْزَارَهَا'], 
   'لمحيطة': [
            'لَمُحِيطَةٌ'], 
   'حامية': [
           'حَامِيَةٌ',
           'حَامِيَةً'], 
   'ونادى': [
           'وَنَادَى'], 
   'لنبذ': [
          'لَنُبِذَ'], 
   'الطالب': [
            'الطَّالِبُ'], 
   'أهلهن': [
           'أَهْلِهِنَّ'], 
   'أخرجتم': [
            'أُخْرِجْتُمْ'], 
   'بهما': [
          'بِهِمَا'], 
   'الأجلين': [
             'الْأَجَلَيْنِ'], 
   'معاشا': [
           'مَعَاشًا'], 
   'والنجوم': [
             'وَالنُّجُومُ',
             'وَالنُّجُومَ'], 
   'لأخراهم': [
             'لِأُخْرَاهُمْ'], 
   'فتنادوا': [
             'فَتَنَادَوْا'], 
   'وشاركهم': [
             'وَشَارِكْهُمْ'], 
   'شفعاء': [
           'شُفَعَاءَ',
           'شُفَعَاءُ'], 
   'جئتم': [
          'جِئْتُمْ'], 
   'حسابا': [
           'حِسَابًا'], 
   'مقيلا': [
           'مَقِيلًا'], 
   'أكله': [
          'أُكُلُهُ',
          'أَكَلَهُ'], 
   'أكلم': [
          'أُكَلِّمَ'], 
   'تقوموا': [
            'تَقُومُوا'], 
   'ويشرب': [
           'وَيَشْرَبُ'], 
   'فتعاطى': [
            'فَتَعَاطَى'], 
   'برزوا': [
           'بَرَزُوا'], 
   'بالكتاب': [
             'بِالْكِتَابِ'], 
   'غمرة': [
          'غَمْرَةٍ'], 
   'وتاب': [
          'وَتَابَ'], 
   'اشهدوا': [
            'اشْهَدُوا'], 
   'فذكر': [
          'فَذَكِّرْ'], 
   'وهبت': [
          'وَهَبَتْ'], 
   'فالعاصفات': [
               'فَالْعَاصِفَاتِ'], 
   'حسابه': [
           'حِسَابُهُ',
           'حِسَابَهُ'], 
   'وليبينن': [
             'وَلَيُبَيِّنَنَّ'], 
   'حسابك': [
           'حِسَابِكَ'], 
   'وبكيا': [
           'وَبُكِيًّا'], 
   'ينصرنا': [
            'يَنْصُرُنَا'], 
   'شرقيا': [
           'شَرْقِيًّا'], 
   'تبوء': [
          'تَبُوءَ'], 
   'ويجعل': [
           'وَيَجْعَلْ',
           'وَيَجْعَلُ',
           'وَيَجْعَلَ'], 
   'آووا': [
          'آوَوْا'], 
   'فضرب': [
          'فَضُرِبَ',
          'فَضَرْبَ'], 
   'آباؤهم': [
            'آبَاؤُهُمْ'], 
   'افتراء': [
            'افْتِرَاءً'], 
   'فأتت': [
          'فَأَتَتْ'], 
   'وننشئكم': [
             'وَنُنْشِئَكُمْ'], 
   'فاستجبنا': [
              'فَاسْتَجَبْنَا'], 
   'بررة': [
          'بَرَرَةٍ'], 
   'فأصلحوا': [
             'فَأَصْلِحُوا'], 
   'غنيا': [
          'غَنِيًّا'], 
   'طلعها': [
           'طَلْعُهَا',
           'طَلْعِهَا'], 
   'الجبار': [
            'الْجَبَّارُ'], 
   'ظلمناهم': [
             'ظَلَمْنَاهُمْ'], 
   'دافع': [
          'دَافِعٍ',
          'دَافِعٌ'], 
   'فقدموا': [
            'فَقَدِّمُوا'], 
   'أننا': [
          'أَنَّنَا'], 
   'مودة': [
          'مَوَدَّةً',
          'مَوَدَّةَ',
          'مَوَدَّةٌ'], 
   'فليفرحوا': [
              'فَلْيَفْرَحُوا'], 
   'وأزواج': [
            'وَأَزْوَاجٌ'], 
   'للطيبات': [
             'لِلطَّيِّبَاتِ'], 
   'لجعلكم': [
            'لَجَعَلَكُمْ'], 
   'واهجروهن': [
              'وَاهْجُرُوهُنَّ'], 
   'سكرة': [
          'سَكْرَةُ'], 
   'للقوم': [
           'لِلْقَوْمِ'], 
   'اجتباه': [
            'اجْتَبَاهُ'], 
   'أنصار': [
           'أَنْصَارٍ',
           'أَنْصَارُ',
           'أَنْصَارَ'], 
   'المغشي': [
            'الْمَغْشِيِّ'], 
   'يوبقهن': [
            'يُوبِقْهُنَّ'], 
   'مسئولا': [
            'مَسْئُولًا'], 
   'لرب': [
         'لِرَبِّ'], 
   'سكرا': [
          'سَكَرًا'], 
   'يكون': [
          'يَكُونُ',
          'يَكُونَ'], 
   'وأهل': [
          'وَأَهْلُ'], 
   'ورزقكم': [
            'وَرَزَقَكُمْ'], 
   'أرأيتكم': [
             'أَرَأَيْتَكُمْ'], 
   'مصبحين': [
            'مُصْبِحِينَ'], 
   'يضار': [
          'يُضَارَّ'], 
   'لنهدينهم': [
              'لَنَهْدِيَنَّهُمْ'], 
   'الدوائر': [
             'الدَّوَائِرَ'], 
   'ترون': [
          'تَرَوْنَ'], 
   'فاهجر': [
           'فَاهْجُرْ'], 
   'ونمد': [
          'وَنَمُدُّ'], 
   'عالين': [
           'عَالِينَ'], 
   'ويجادل': [
            'وَيُجَادِلُ'], 
   'فيطمع': [
           'فَيَطْمَعَ'], 
   'عابد': [
          'عَابِدٌ'], 
   'العشير': [
            'الْعَشِيرُ'], 
   'تنكحوا': [
            'تَنْكِحُوا',
            'تُنْكِحُوا'], 
   'فكذبت': [
           'فَكَذَّبْتَ',
           'فَكَذَبَتْ'], 
   'غلاما': [
           'غُلَامًا'], 
   'تروا': [
          'تَرَوْا'], 
   'المسحرين': [
              'الْمُسَحَّرِينَ'], 
   'وألفيا': [
            'وَأَلْفَيَا'], 
   'عالية': [
           'عَالِيَةٍ'], 
   'مقترنين': [
             'مُقْتَرِنِينَ'], 
   'تسوروا': [
            'تَسَوَّرُوا'], 
   'وتشاور': [
            'وَتَشَاوُرٍ'], 
   'العظام': [
            'الْعِظَامَ',
            'الْعِظَامِ'], 
   'الغائبين': [
              'الْغَائِبِينَ'], 
   'ينسينك': [
            'يُنْسِيَنَّكَ'], 
   'لتركبن': [
            'لَتَرْكَبُنَّ'], 
   'خلقه': [
          'خَلَقَهُ',
          'خَلْقَهُ'], 
   'سواعا': [
           'سُوَاعًا'], 
   'يكور': [
          'يُكَوِّرُ'], 
   'كثرت': [
          'كَثُرَتْ'], 
   'رجعك': [
          'رَجَعَكَ'], 
   'وأرجلكم': [
             'وَأَرْجُلَكُمْ'], 
   'تتمارى': [
            'تَتَمَارَى'], 
   'تظاهرون': [
             'تُظَاهِرُونَ',
             'تَظَاهَرُونَ'], 
   'فانكحوا': [
             'فَانْكِحُوا'], 
   'ويرسل': [
           'وَيُرْسِلُ',
           'وَيُرْسِلَ'], 
   'بذنوبنا': [
             'بِذُنُوبِنَا'], 
   'فاسألوا': [
             'فَاسْأَلُوا'], 
   'إيانا': [
           'إِيَّانَا'], 
   'والشعراء': [
              'وَالشُّعَرَاءُ'], 
   'دافق': [
          'دَافِقٍ'], 
   'واحصروهم': [
              'وَاحْصُرُوهُمْ'], 
   'فاسقون': [
            'فَاسِقُونَ'], 
   'للأنام': [
            'لِلْأَنَامِ'], 
   'يعوذون': [
            'يَعُوذُونَ'], 
   'رفع': [
         'رَفَعَ'], 
   'أعتدنا': [
            'أَعْتَدْنَا'], 
   'فالمقسمات': [
               'فَالْمُقَسِّمَاتِ'], 
   'أسكنوهن': [
             'أَسْكِنُوهُنَّ'], 
   'الداخلين': [
              'الدَّاخِلِينَ'], 
   'بآنية': [
           'بِآنِيَةٍ'], 
   'تفجيرا': [
            'تَفْجِيرًا'], 
   'واتقين': [
            'وَاتَّقِينَ'], 
   'رفث': [
         'رَفَثَ'], 
   'طه': [
        'طه'], 
   'حجتنا': [
           'حُجَّتُنَا'], 
   'يترقب': [
           'يَتَرَقَّبُ'], 
   'تحبونهم': [
             'تُحِبُّونَهُمْ'], 
   'حفيا': [
          'حَفِيًّا'], 
   'رأوهم': [
           'رَأَوْهُمْ'], 
   'غائبة': [
           'غَائِبَةٍ'], 
   'الشوكة': [
            'الشَّوْكَةِ'], 
   'حفيظ': [
          'حَفِيظٌ',
          'حَفِيظٍ'], 
   'أبعث': [
          'أُبْعَثُ',
          'أَبَعَثَ'], 
   'ليسكن': [
           'لِيَسْكُنَ'], 
   'واستشهدوا': [
               'وَاسْتَشْهِدُوا'], 
   'عصبة': [
          'عُصْبَةٌ'], 
   'ويعلمك': [
            'وَيُعَلِّمُكَ'], 
   'فتكونون': [
             'فَتَكُونُونَ'], 
   'والعزى': [
            'وَالْعُزَّى'], 
   'تحبونها': [
             'تُحِبُّونَهَا'], 
   'أتيت': [
          'أَتَيْتَ'], 
   'وذكرا': [
           'وَذِكْرًا'], 
   'لتبين': [
           'لِتُبَيِّنَ'], 
   'جزيتهم': [
            'جَزَيْتُهُمُ'], 
   'لنبين': [
           'لِنُبَيِّنَ'], 
   'طس': [
        'طس'], 
   'استمسك': [
            'اسْتَمْسَكَ'], 
   'مقتصد': [
           'مُقْتَصِدٌ'], 
   'شهداءكم': [
             'شُهَدَاءَكُمْ',
             'شُهَدَاءَكُمُ'], 
   'قصصنا': [
           'قَصَصْنَا'], 
   'الثلث': [
           'الثُّلُثِ',
           'الثُّلُثُ'], 
   'سفينة': [
           'سَفِينَةٍ'], 
   'وأبناءكم': [
              'وَأَبْنَاءَكُمْ'], 
   'ولأجر': [
           'وَلَأَجْرُ'], 
   'ببغيهم': [
            'بِبَغْيِهِمْ'], 
   'تقصروا': [
            'تَقْصُرُوا'], 
   'لوقتها': [
            'لِوَقْتِهَا'], 
   'وإما': [
          'وَإِمَّا'], 
   'الظالمون': [
              'الظَّالِمُونَ'], 
   'ظالم': [
          'ظَالِمٌ'], 
   'تعضلوهن': [
             'تَعْضُلُوهُنَّ']}