# uncompyle6 version 3.7.4
# Python bytecode 2.7 (62211)
# Decompiled from: Python 3.6.9 (default, Apr 18 2020, 01:56:04) 
# [GCC 8.4.0]
# Embedded file name: build/bdist.linux-i686/egg/alfanous/dynamic_resources/synonymes_dyn.py
# Compiled at: 2015-06-30 07:26:27
syndict = {'ضيع': ['خسر',
         'سفه',
         'ضيع'], 
   'أيقن': [
          'تبين',
          'يئس',
          'أيقن'], 
   'عطية': [
          'صدقة',
          'عطية',
          'نحلة',
          'هبة',
          'هدية'], 
   'حق': [
        'حق',
        'صدق'], 
   'رهط': [
         'ركن',
         'رهط'], 
   'ضيز': [
         'جور',
         'رهق',
         'ضيز',
         'ظلم',
         'هضم'], 
   'ثقف': [
         'ثقف',
         'ألفى',
         'لقي',
         'وجد'], 
   'تثريب': [
           'تثريب',
           'لوم'], 
   'ضاق': [
         'حرج',
         'حصر',
         'ضاق'], 
   'زيادة': [
           'بركة',
           'زيادة'], 
   'أدى': [
         'أدى',
         'أبلغ',
         'أوصل'], 
   'قتل': [
         'بخع',
         'عبد',
         'قتل'], 
   'نحت': [
         'جاب',
         'نحت'], 
   'زهق': [
         'تردى',
         'زهق',
         'مات',
         'هلك'], 
   'فضل': [
         'طول',
         'فضل'], 
   'خوف': [
         'خشية',
         'خوف',
         'رجاء',
         'رهبة',
         'فزع',
         'وجف',
         'وجل'], 
   'أدبر': [
          'أدبر',
          'عسعس'], 
   'سرمد': [
          'خالد',
          'دائم',
          'سرمد',
          'مستمر',
          'واصب'], 
   'حساب': [
          'أجر',
          'ثواب',
          'جزاء',
          'حساب',
          'دين'], 
   'خطيئة': [
           'إثم',
           'جرم',
           'حنث',
           'حوب',
           'ذنب',
           'خطيئة',
           'معصية',
           'عنت',
           'وزر'], 
   'لاأزال': [
            'لاأبرح',
            'لاأزال'], 
   'طائره': [
           'طائره',
           'عمله'], 
   'كوب': [
         'كأس',
         'كوب'], 
   'جارية': [
           'جارية',
           'سفينة',
           'فلك',
           'ماخرة'], 
   'النقيض': [
            'الضد',
            'النقيض'], 
   'سجر': [
         'سجر',
         'فجر'], 
   'بعير': [
          'بعير',
          'حمار'], 
   'بعيد': [
          'بعيد',
          'قاص',
          'ناء'], 
   'زبر': [
         'زبر',
         'كتب',
         'نسخ'], 
   'مراء': [
          'جدال',
          'حجاج',
          'مراء'], 
   'قنط': [
         'بلس',
         'قنط',
         'خاب',
         'يئس'], 
   'نهى': [
         'حجر',
         'حلم',
         'عقل',
         'فؤاد',
         'قلب',
         'لب',
         'نهى'], 
   'أطفأ': [
          'خمد',
          'أطفأ'], 
   'ضياء': [
          'ضياء',
          'نور'], 
   'حزب': [
         'ثبات',
         'ثلة',
         'حزب',
         'رهط',
         'زمرة',
         'شرذمة',
         'طائفة',
         'عصبة',
         'فئة',
         'فريق',
         'فوج',
         'نفر',
         'موالي'], 
   'إنا': [
         'إنا',
         'صهر',
         'نضج'], 
   'روح': [
         'روح',
         'نفس'], 
   'ملجأ': [
          'ملجأ',
          'ملتحد',
          'مناص',
          'موئل',
          'وزر'], 
   'بئيس': [
          'بئيس',
          'رابية',
          'شديد',
          'عصيب',
          'وبيل'], 
   'طلاق': [
          'سراح',
          'طلاق',
          'فراق'], 
   'ركبان': [
           'ركبان',
           'أفئدة'], 
   'نغض': [
         'حرك',
         'نغض'], 
   'هم': [
        'غم',
        'هم'], 
   'فراش': [
          'فراش',
          'مهاد'], 
   'غنيمة': [
           'ربح',
           'غنيمة',
           'فيء',
           'كسب'], 
   'دان': [
         'دان',
         'قريب'], 
   'ارتد': [
          'آب',
          'حار',
          'رجع',
          'ارتد',
          'عاد',
          'فاء',
          'انقلب',
          'نكص'], 
   'أغطش': [
          'أظلم',
          'أغطش'], 
   'وقت': [
         'دهر',
         'زمان',
         'عصر',
         'وقت'], 
   'الكرسي': [
            'العرش',
            'الكرسي'], 
   'ألوان': [
           'أطوار',
           'ألوان'], 
   'رأفة': [
          'رأفة',
          'رحمة'], 
   'انشقت': [
           'انشقت',
           'فرجت',
           'انفطرت',
           'كشطت',
           'مارت'], 
   'غضب': [
         'أسف',
         'غضب'], 
   'سطح': [
         'سطح',
         'طحا',
         'مد'], 
   'عورة': [
          'سوءة',
          'عورة'], 
   'غي': [
        'خبال',
        'رهق',
        'غي'], 
   'بأساء': [
           'بأساء',
           'ضراء'], 
   'بحر': [
         'بحر',
         'يم'], 
   'غم': [
        'غم',
        'هم'], 
   'وبيل': [
          'بئيس',
          'رابية',
          'شديد',
          'عصيب',
          'وبيل'], 
   'أفضى': [
          'رفث',
          'أفضى'], 
   'حب': [
        'حب',
        'ود'], 
   'ذهب': [
         'ذهب',
         'زخرف'], 
   'غمرة': [
          'سهو',
          'نسيان',
          'غفلة',
          'غمرة',
          'ضلال'], 
   'سؤال': [
          'دعاء',
          'سؤال',
          'طلب'], 
   'حسبان': [
           'برد',
           'حسبان'], 
   'حض': [
        'حث',
        'حرض',
        'حض'], 
   'انفضوا': [
            'ذهبوا',
            'انفضوا',
            'مضوا'], 
   'نحل': [
         'فرض',
         'كتب',
         'نحل'], 
   'رهق': [
         'خبال',
         'رهق',
         'غي'], 
   'قدرة': [
          'استطاعة',
          'طاقة',
          'قبل',
          'قوة',
          'قدرة',
          'مرة'], 
   'أب': [
        'أب',
        'والد'], 
   'الحريق': [
            'الجحيم',
            'الحريق',
            'السعير',
            'النار'], 
   'خفت': [
         'ثقلت',
         'خفت'], 
   'شاهد': [
          'شاهد',
          'مهين'], 
   'أهطع': [
          'بادر',
          'أسرع',
          'قصد',
          'أهطع',
          'أوفض'], 
   'حلف': [
         'آتى',
         'ائتلى',
         'حلف',
         'أقسم',
         'يمين'], 
   'نظر': [
         'آنس',
         'أبصر',
         'رآى',
         'نظر'], 
   'قبل': [
         'استطاعة',
         'طاقة',
         'قبل',
         'قوة',
         'قدرة',
         'مرة'], 
   'أوزع': [
          'ألهم',
          'أوحى',
          'أوزع'], 
   'حلم': [
         'حلم',
         'سكينة',
         'وقار'], 
   'أعطى': [
          'آتى',
          'أعطى'], 
   'اشترى': [
           'باع',
           'اشترى'], 
   'آثر': [
         'آثر',
         'اختار',
         'اصطفى',
         'فضل'], 
   'مطر': [
         'رزق',
         'مطر',
         'غيث',
         'ودق'], 
   'كمل': [
         'تم',
         'كمل'], 
   'صرهن': [
          'صرهن',
          'قطعهن'], 
   'بئر': [
         'بئر',
         'جب',
         'رس'], 
   'قسط': [
         'عدل',
         'قسط',
         'وسط'], 
   'هوى': [
         'شهوة',
         'هوى'], 
   'صنع': [
         'صنع',
         'فعل',
         'عمل'], 
   'زوج': [
         'زوج',
         'صاحبة',
         'امرأة'], 
   'فاحشة': [
           'إفك',
           'بهتان',
           'خرص',
           'اختلاط',
           'شطط',
           'ظاهر',
           'القول',
           'فاحشة',
           'افتراء',
           'كذب'], 
   'مناص': [
          'ملجأ',
          'ملتحد',
          'مناص',
          'موئل',
          'وزر'], 
   'فاسد': [
          'باطل',
          'فاسد'], 
   'قريب': [
          'دان',
          'قريب'], 
   'مساكن': [
           'بيوت',
           'ديار',
           'مساكن',
           'صرح',
           'أكنان'], 
   'خاشعة': [
           'خاشعة',
           'مقشعرة'], 
   'أسباط': [
           'أسباط',
           'قبائل'], 
   'عين': [
         'عين',
         'ينبوع'], 
   'قترة': [
          'غبرة',
          'قترة'], 
   'زنا': [
         'زنا',
         'سفاح',
         'مرض'], 
   'شرعة': [
          'شرعة',
          'منهاج'], 
   'طمع': [
         'حرص',
         'رجاء',
         'طمع'], 
   'عاديات': [
            'جياد',
            'خير',
            'خيل',
            'عاديات'], 
   'بركة': [
          'بركة',
          'زيادة'], 
   'رحمة': [
          'رأفة',
          'رحمة'], 
   'غدق': [
         'جم',
         'غدق',
         'كثير',
         'لبد'], 
   'ميمنة': [
           'ميمنة',
           'يمين'], 
   'الجحيم': [
            'الجحيم',
            'الحريق',
            'السعير',
            'النار'], 
   'أم': [
        'أم',
        'والدة'], 
   'تبنا': [
          'تبنا',
          'أنبنا',
          'هدنا'], 
   'أمام': [
          'أمام',
          'وراء'], 
   'دهق': [
         'دهق',
         'سجر',
         'ملأ'], 
   'فتن': [
         'حرق',
         'فتن',
         'لوح'], 
   'أظهر': [
          'أطلع',
          'أظهر'], 
   'قبر': [
         'جدث',
         'قبر'], 
   'متعمد': [
           'متجانف',
           'متعمد'], 
   'مسغبة': [
           'جوع',
           'مخمصة',
           'مسغبة',
           'إملاق'], 
   'والد': [
          'أب',
          'والد'], 
   'بغضاء': [
           'بغضاء',
           'شنآن',
           'قلى',
           'كره',
           'مقت'], 
   'حجة': [
         'برهان',
         'بيان',
         'حجة',
         'دليل',
         'سلطان'], 
   'ظلم': [
         'جور',
         'رهق',
         'ضيز',
         'ظلم',
         'هضم'], 
   'بغي': [
         'بغي',
         'حسد'], 
   'ربا': [
         'ربا',
         'زاد',
         'غلا'], 
   'مهاد': [
          'فراش',
          'مهاد'], 
   'الجحد': [
           'الجحد',
           'الإنكار'], 
   'ربح': [
         'ربح',
         'غنيمة',
         'فيء',
         'كسب'], 
   'غطاء': [
          'برزخ',
          'حجاب',
          'حاجز',
          'ستر',
          'غطاء'], 
   'شجر': [
         'زرع',
         'شجر',
         'نبات',
         'نجم'], 
   'الريب': [
           'الجرم',
           'الحرج',
           'الحسبان',
           'الرجم',
           'الريب',
           'الزعم',
           'الظن',
           'المرض',
           'المرية'], 
   'لهو': [
         'لهو'], 
   'السلم': [
           'السلم',
           'الصلح'], 
   'كره': [
         'بغضاء',
         'شنآن',
         'قلى',
         'كره',
         'مقت'], 
   'العثو': [
           'العثو',
           'الفساد'], 
   'لعب': [
         'لعب',
         'لهو',
         'هزل'], 
   'رقم': [
         'ختم',
         'رقم',
         'طبع'], 
   'برد': [
         'برد',
         'نوم'], 
   'عمر': [
         'أجل',
         'أمد',
         'عمر'], 
   'رقي': [
         'رفع',
         'رقي',
         'صعد',
         'عرج',
         'علا'], 
   'مدين': [
          'مبعوث',
          'مدين'], 
   'قصد': [
         'حرد',
         'قصد'], 
   'شياطين': [
            'جن',
            'شياطين'], 
   'كف': [
        'كف',
        'أمسك'], 
   'مكث': [
         'ثوى',
         'لبث',
         'مكث'], 
   'عمل': [
         'صنع',
         'فعل',
         'عمل'], 
   'فلق': [
         'شق',
         'فلق'], 
   'فلك': [
         'جارية',
         'سفينة',
         'فلك',
         'ماخرة'], 
   'مكر': [
         'خدع',
         'غر',
         'مكر'], 
   'سلك': [
         'دخل',
         'سلك'], 
   'عيلة': [
          'خصاصة',
          'عيلة',
          'فقر',
          'إملاق'], 
   'اختلاط': [
            'إفك',
            'بهتان',
            'خرص',
            'اختلاط',
            'شطط',
            'ظاهر',
            'القول',
            'فاحشة',
            'افتراء',
            'كذب'], 
   'عذاب': [
          'رجز',
          'عذاب',
          'عقاب'], 
   'فتيان': [
           'غلمان',
           'فتيان',
           'ولدان'], 
   'خلاق': [
          'خلاق',
          'ذنوب',
          'كفل',
          'نصيب'], 
   'البهل': [
           'البهل',
           'الرجم',
           'الطرد',
           'الكبت',
           'اللعن'], 
   'بهتان': [
           'إفك',
           'بهتان',
           'خرص',
           'اختلاط',
           'شطط',
           'ظاهر',
           'القول',
           'فاحشة',
           'افتراء',
           'كذب'], 
   'خلال': [
          'خلال',
          'سحاب',
          'ظلة',
          'عارض',
          'معصرات',
          'غمامة',
          'مزن'], 
   'أنظر': [
          'أمهل',
          'أنظر',
          'انتظر'], 
   'أطلع': [
          'أطلع',
          'أظهر'], 
   'مفاتيح': [
            'مفاتيح',
            'مقاليد'], 
   'أبق': [
         'أبق',
         'فر',
         'ناص',
         'هرب'], 
   'هضم': [
         'جور',
         'رهق',
         'ضيز',
         'ظلم',
         'هضم'], 
   'هلك': [
         'تردى',
         'زهق',
         'مات',
         'هلك'], 
   'نكص': [
         'آب',
         'حار',
         'رجع',
         'ارتد',
         'عاد',
         'فاء',
         'انقلب',
         'نكص'], 
   'ربي': [
         'ربي',
         'رجل',
         'امرؤ'], 
   'سقاية': [
           'آنية',
           'سقاية',
           'صحاف',
           'صواع'], 
   'يرسل': [
          'يرسل',
          'يزجي',
          'يفتح'], 
   'أنام': [
          'أنام',
          'بشر',
          'برية',
          'جبلة',
          'خلق',
          'ناس'], 
   'بذر': [
         'بذر',
         'أسرف'], 
   'مهان': [
          'خاسئ',
          'ذليل',
          'مستكين',
          'صاغر',
          'مهان'], 
   'فرجت': [
          'انشقت',
          'فرجت',
          'انفطرت',
          'كشطت',
          'مارت'], 
   'خمد': [
         'خمد',
         'أطفأ'], 
   'أخبر': [
          'أخبر',
          'أعلم',
          'أنبأ'], 
   'الضد': [
          'الضد',
          'العدو'], 
   'مرض': [
         'زنا',
         'سفاح',
         'مرض'], 
   'مرة': [
         'تارة',
         'مرة'], 
   'برزخ': [
          'برزخ',
          'حجاب',
          'حاجز',
          'ستر',
          'غطاء'], 
   'نسأ': [
         'أخر',
         'نسأ'], 
   'دعاء': [
          'دعاء',
          'سؤال',
          'طلب'], 
   'عنت': [
         'إثم',
         'جرم',
         'حنث',
         'حوب',
         'ذنب',
         'خطيئة',
         'معصية',
         'عنت',
         'وزر'], 
   'مقتدر': [
           'مقتدر',
           'مقيت'], 
   'أخبت': [
          'أخبت',
          'خشع',
          'خضع',
          'نزل',
          'هبط'], 
   'تبين': [
          'تبين',
          'يئس',
          'أيقن'], 
   'صدقة': [
          'صدقة',
          'عطية',
          'نحلة',
          'هبة',
          'هدية'], 
   'غلا': [
         'ربا',
         'زاد',
         'غلا'], 
   'خمر': [
         'خمر',
         'عنب'], 
   'اصطفى': [
           'آثر',
           'اختار',
           'اصطفى',
           'فضل'], 
   'حضر': [
         'أتى',
         'جاء',
         'حضر',
         'أقبل'], 
   'لوح': [
         'إمام',
         'رقيم',
         'مسطور',
         'سفر',
         'قط',
         'كتاب',
         'لوح'], 
   'فرض': [
         'فرض',
         'كتب',
         'نحل'], 
   'الجرم': [
           'الجرم',
           'الحرج',
           'الحسبان',
           'الرجم',
           'الريب',
           'الزعم',
           'الظن',
           'المرض',
           'المرية'], 
   'أراد': [
          'أراد',
          'كاد'], 
   'أوحى': [
          'ألهم',
          'أوحى',
          'أوزع'], 
   'ناص': [
         'أبق',
         'فر',
         'ناص',
         'هرب'], 
   'جدد': [
         'جدد',
         'حبك',
         'ريع',
         'سبيل',
         'صراط',
         'طريق',
         'فج',
         'نجد'], 
   'وسوس': [
          'نزغ',
          'وسوس'], 
   'جب': [
        'بئر',
        'جب',
        'رس'], 
   'ناس': [
         'أنام',
         'بشر',
         'برية',
         'جبلة',
         'خلق',
         'ناس'], 
   'أفئدة': [
           'ركبان',
           'أفئدة'], 
   'واصب': [
          'خالد',
          'دائم',
          'سرمد',
          'مستمر',
          'واصب'], 
   'أصاب': [
          'ابتغى',
          'أراد',
          'شاء',
          'أصاب'], 
   'جذ': [
        'جذ',
        'قطع'], 
   'يفرط': [
          'يبقي',
          'يترك',
          'يفرط',
          'يدع',
          'يذر'], 
   'فرح': [
         'حبور',
         'سرور',
         'فرح',
         'مرح'], 
   'جمع': [
         'جمع',
         'ركم',
         'سجر',
         'أقت'], 
   'ثبات': [
          'ثبات',
          'ثلة',
          'حزب',
          'رهط',
          'زمرة',
          'شرذمة',
          'طائفة',
          'عصبة',
          'فئة',
          'فريق',
          'فوج',
          'نفر',
          'موالي'], 
   'ناء': [
         'بعيد',
         'قاص',
         'ناء'], 
   'عجب': [
         'إمر',
         'عجب'], 
   'جن': [
        'جن',
        'شياطين'], 
   'امرؤ': [
          'ربي',
          'رجل',
          'امرؤ'], 
   'لوم': [
         'تثريب',
         'لوم'], 
   'فاء': [
         'آب',
         'حار',
         'رجع',
         'ارتد',
         'عاد',
         'فاء',
         'انقلب',
         'نكص'], 
   'سلام': [
          'تحية',
          'سلام'], 
   'شاء': [
         'ابتغى',
         'أراد',
         'شاء',
         'أصاب'], 
   'الشبه': [
           'الشبه',
           'الشكل'], 
   'سلطان': [
           'سلطان',
           'ملك'], 
   'فرق': [
         'حكم',
         'فتح',
         'فرق',
         'فصل',
         'قضى'], 
   'تدبر': [
          'تدبر',
          'تفكر'], 
   'وثن': [
         'رجز',
         'صنم',
         'طاغوت',
         'تمثال',
         'وثن'], 
   'نصب': [
         'إعياء',
         'لغوب',
         'نصب'], 
   'أمسك': [
          'كف',
          'أمسك'], 
   'أرب': [
         'أرب',
         'حاجة'], 
   'اشمأز': [
           'اشمأز',
           'نفر'], 
   'بارئ': [
          'بديع',
          'بارئ',
          'جاعل',
          'خالق',
          'ذارئ',
          'صانع',
          'فاطر'], 
   'يغني': [
          'يغني',
          'يتمتع'], 
   'عصر': [
         'دهر',
         'زمان',
         'عصر',
         'وقت'], 
   'عثر': [
         'عثر',
         'اطلع'], 
   'زيل': [
         'زيل',
         'ماز',
         'عزل'], 
   'العدو': [
           'الضد',
           'العدو'], 
   'يدع': [
         'يبقي',
         'يترك',
         'يفرط',
         'يدع',
         'يذر'], 
   'عقاب': [
          'رجز',
          'عذاب',
          'عقاب'], 
   'زاد': [
         'ربا',
         'زاد',
         'غلا'], 
   'صحة': [
         'سلامة',
         'صحة'], 
   'غلق': [
         'سكر',
         'غلق',
         'أوصد'], 
   'طول': [
         'طول',
         'فضل'], 
   'معصية': [
           'إثم',
           'جرم',
           'حنث',
           'حوب',
           'ذنب',
           'خطيئة',
           'معصية',
           'عنت',
           'وزر'], 
   'ينبوع': [
           'عين',
           'ينبوع'], 
   'أسي': [
         'أسي',
         'ابتأس',
         'بث',
         'حزن',
         'كرب'], 
   'أسف': [
         'أسف',
         'غضب'], 
   'الزعم': [
           'الجرم',
           'الحرج',
           'الحسبان',
           'الرجم',
           'الريب',
           'الزعم',
           'الظن',
           'المرض',
           'المرية'], 
   'خالق': [
          'بديع',
          'بارئ',
          'جاعل',
          'خالق',
          'ذارئ',
          'صانع',
          'فاطر'], 
   'جرم': [
         'إثم',
         'جرم',
         'حنث',
         'حوب',
         'ذنب',
         'خطيئة',
         'معصية',
         'عنت',
         'وزر'], 
   'سجن': [
         'أثبت',
         'حبس',
         'أحصر',
         'سجن',
         'عكف',
         'عضل'], 
   'والدة': [
           'أم',
           'والدة'], 
   'رزق': [
         'رزق',
         'مطر',
         'غيث',
         'ودق'], 
   'ذنب': [
         'إثم',
         'جرم',
         'حنث',
         'حوب',
         'ذنب',
         'خطيئة',
         'معصية',
         'عنت',
         'وزر'], 
   'آية': [
         'آية',
         'سمة',
         'علامة'], 
   'آناء': [
          'آناء',
          'ساعات'], 
   'أحصر': [
          'أثبت',
          'حبس',
          'أحصر',
          'سجن',
          'عكف',
          'عضل'], 
   'غفلة': [
          'سهو',
          'نسيان',
          'غفلة',
          'غمرة',
          'ضلال'], 
   'موالي': [
           'ثبات',
           'ثلة',
           'حزب',
           'رهط',
           'زمرة',
           'شرذمة',
           'طائفة',
           'عصبة',
           'فئة',
           'فريق',
           'فوج',
           'نفر',
           'موالي'], 
   'أشعل': [
          'سجر',
          'سعر',
          'أشعل',
          'أوقد'], 
   'مارت': [
          'انشقت',
          'فرجت',
          'انفطرت',
          'كشطت',
          'مارت'], 
   'مضت': [
         'خلت',
         'مضت'], 
   'شريعة': [
           'دين',
           'شريعة',
           'ملة'], 
   'جزاء': [
          'أجر',
          'ثواب',
          'جزاء',
          'حساب',
          'دين'], 
   'سنة': [
         'حجة',
         'حول',
         'سنة',
         'عام'], 
   'مزجاة': [
           'مزجاة',
           'قليلة',
           'يسيرة'], 
   'طرد': [
         'دحر',
         'طرد'], 
   'ابن': [
         'ابن',
         'ولد'], 
   'متجانف': [
            'متجانف',
            'متعمد'], 
   'أوفض': [
          'بادر',
          'أسرع',
          'قصد',
          'أهطع',
          'أوفض'], 
   'لباس': [
          'ثياب',
          'لباس'], 
   'أنبنا': [
           'تبنا',
           'أنبنا',
           'هدنا'], 
   'السموات': [
             'السموات',
             'الطرائق'], 
   'خالد': [
          'خالد',
          'دائم',
          'سرمد',
          'مستمر',
          'واصب'], 
   'حقب': [
         'حقب',
         'دهر'], 
   'ميثاق': [
           'إصر',
           'بيعة',
           'عقد',
           'عهد',
           'ميثاق'], 
   'غار': [
         'غار',
         'غاص',
         'نقص',
         'هضم'], 
   'طود': [
         'جبل',
         'صدف',
         'طود',
         'طور'], 
   'غاص': [
         'غار',
         'غاص',
         'نقص',
         'هضم'], 
   'نخلة': [
          'لينة',
          'نخلة'], 
   'غاب': [
         'أفل',
         'عزب',
         'غاب'], 
   'قص': [
        'تبع',
        'أتبع',
        'اتبع',
        'قص',
        'قفا',
        'لحق'], 
   'أجذاع': [
           'أعجاز',
           'أجذاع'], 
   'قط': [
        'إمام',
        'رقيم',
        'مسطور',
        'سفر',
        'قط',
        'كتاب',
        'لوح'], 
   'صب': [
        'سفح',
        'سكب',
        'صب'], 
   'صهر': [
         'إنا',
         'صهر',
         'نضج'], 
   'النار': [
           'الجحيم',
           'الحريق',
           'السعير',
           'النار'], 
   'افتراء': [
            'إفك',
            'بهتان',
            'خرص',
            'اختلاط',
            'شطط',
            'ظاهر',
            'القول',
            'فاحشة',
            'افتراء',
            'كذب'], 
   'حنث': [
         'إثم',
         'جرم',
         'حنث',
         'حوب',
         'ذنب',
         'خطيئة',
         'معصية',
         'عنت',
         'وزر'], 
   'شمال': [
          'مشأمة',
          'شمال'], 
   'عنق': [
         'جيد',
         'رقبة',
         'عنق'], 
   'أجل': [
         'أجل',
         'أمد',
         'عمر'], 
   'طغى': [
         'طغى',
         'عتا'], 
   'خضع': [
         'أخبت',
         'خشع',
         'خضع',
         'نزل',
         'هبط'], 
   'جم': [
        'جم',
        'غدق',
        'كثير',
        'لبد'], 
   'حسر': [
         'حسر',
         'قطع'], 
   'صاحبة': [
           'زوج',
           'صاحبة',
           'امرأة'], 
   'ثرى': [
         'تراب',
         'ثرى'], 
   'بسطة': [
          'بسطة',
          'سعة'], 
   'طبع': [
         'ختم',
         'رقم',
         'طبع'], 
   'صعد': [
         'رفع',
         'رقي',
         'صعد',
         'عرج',
         'علا'], 
   'حسد': [
         'بغي',
         'حسد'], 
   'أصفاد': [
           'أصفاد',
           'أغلال'], 
   'أول': [
         'أول',
         'فسر'], 
   'حمأ': [
         'حمأ',
         'سجيل',
         'صلصال',
         'طين'], 
   'حمد': [
         'حمد',
         'شكر'], 
   'مثل': [
         'مثل',
         'ند'], 
   'معتر': [
          'بائس',
          'مسكين',
          'معتر',
          'عائل',
          'فقير',
          'قانع',
          'مملق'], 
   'شقاق': [
          'شقاق',
          'ضلال',
          'غواية',
          'فتنة'], 
   'بخس': [
         'ألت',
         'بخس',
         'خسر',
         'نقص',
         'هضم',
         'وتر'], 
   'ميزان': [
           'قسطاس',
           'ميزان'], 
   'زمرة': [
          'ثبات',
          'ثلة',
          'حزب',
          'رهط',
          'زمرة',
          'شرذمة',
          'طائفة',
          'عصبة',
          'فئة',
          'فريق',
          'فوج',
          'نفر',
          'موالي'], 
   'ثعبان': [
           'ثعبان',
           'جان'], 
   'بخع': [
         'بخع',
         'عبد',
         'قتل'], 
   'مقاليد': [
            'مفاتيح',
            'مقاليد'], 
   'هنيء': [
          'مريء',
          'هنيء'], 
   'ارتقب': [
           'تربص',
           'ارتقب',
           'انتظر'], 
   'همز': [
         'غمز',
         'لمز',
         'همز'], 
   'جيد': [
         'جيد',
         'رقبة',
         'عنق'], 
   'أطوار': [
           'أطوار',
           'ألوان'], 
   'أوب': [
         'أوب',
         'أطاع'], 
   'أنف': [
         'أنف',
         'خرطوم'], 
   'فريق': [
          'ثبات',
          'ثلة',
          'حزب',
          'رهط',
          'زمرة',
          'شرذمة',
          'طائفة',
          'عصبة',
          'فئة',
          'فريق',
          'فوج',
          'نفر',
          'موالي'], 
   'وليجة': [
           'بطاتة',
           'وليجة'], 
   'قال': [
         'شهد',
         'قال'], 
   'تفنيد': [
           'سخرية',
           'استهزاء',
           'تفنيد'], 
   'أرشد': [
          'أرشد',
          'هدى'], 
   'قبائل': [
           'أسباط',
           'قبائل'], 
   'ائتلى': [
           'آتى',
           'ائتلى',
           'حلف',
           'أقسم',
           'يمين'], 
   'يهرعون': [
            'يزفون',
            'يسعون',
            'يهرعون'], 
   'بطن': [
         'بطن',
         'جوف'], 
   'المرض': [
           'الجرم',
           'الحرج',
           'الحسبان',
           'الرجم',
           'الريب',
           'الزعم',
           'الظن',
           'المرض',
           'المرية'], 
   'رجاء': [
          'خشية',
          'خوف',
          'رجاء',
          'رهبة',
          'فزع',
          'وجف',
          'وجل'], 
   'عنب': [
         'خمر',
         'عنب'], 
   'ظل': [
        'صار',
        'ظل'], 
   'جاعل': [
          'بديع',
          'بارئ',
          'جاعل',
          'خالق',
          'ذارئ',
          'صانع',
          'فاطر'], 
   'أعرض': [
          'صدف',
          'أعرض'], 
   'مسطور': [
           'إمام',
           'رقيم',
           'مسطور',
           'سفر',
           'قط',
           'كتاب',
           'لوح'], 
   'خسران': [
           'تباب',
           'خسران'], 
   'إصر': [
         'إصر',
         'بيعة',
         'عقد',
         'عهد',
         'ميثاق'], 
   'أجر': [
         'أجر',
         'ثواب',
         'جزاء',
         'حساب',
         'دين'], 
   'سمة': [
         'آية',
         'سمة',
         'علامة'], 
   'أفل': [
         'أفل',
         'عزب',
         'غاب'], 
   'أسرع': [
          'بادر',
          'أسرع',
          'قصد',
          'أهطع',
          'أوفض'], 
   'ملأ': [
         'دهق',
         'سجر',
         'ملأ'], 
   'الظن': [
          'الجرم',
          'الحرج',
          'الحسبان',
          'الرجم',
          'الريب',
          'الزعم',
          'الظن',
          'المرض',
          'المرية'], 
   'أخطأ': [
          'أخطأ',
          'مال'], 
   'انفروا': [
            'أفيضوا',
            'انفروا'], 
   'مضوا': [
          'ذهبوا',
          'انفضوا',
          'مضوا'], 
   'ملة': [
         'دين',
         'شريعة',
         'ملة'], 
   'رهبة': [
          'خشية',
          'خوف',
          'رجاء',
          'رهبة',
          'فزع',
          'وجف',
          'وجل'], 
   'دهر': [
         'دهر',
         'زمان',
         'عصر',
         'وقت'], 
   'طمست': [
          'طمست',
          'انكدرت'], 
   'القوة': [
           'العزم',
           'القوة'], 
   'صاحب': [
          'حميم',
          'خدن',
          'خليل',
          'صاحب',
          'صديق',
          'قرين',
          'ولي'], 
   'متاع': [
          'عرض',
          'متاع'], 
   'ختم': [
         'ختم',
         'رقم',
         'طبع'], 
   'مقيت': [
          'مقتدر',
          'مقيت'], 
   'مرح': [
         'خلط',
         'شوب',
         'لبس',
         'مرح',
         'مزج'], 
   'بعث': [
         'بعث',
         'أرسل'], 
   'بعد': [
         'بعد',
         'بوار',
         'تبار',
         'تدمير',
         'هلاك'], 
   'سابق': [
          'معجز',
          'سابق'], 
   'مزن': [
         'خلال',
         'سحاب',
         'ظلة',
         'عارض',
         'معصرات',
         'غمامة',
         'مزن'], 
   'نكل': [
         'شرد',
         'نكل'], 
   'الصاعقة': [
             'الصاعقة',
             'الموتة'], 
   'سبب': [
         'حبل',
         'سبب'], 
   'الظهور': [
            'البدو',
            'الظهور',
            'الإعلان'], 
   'سعة': [
         'بسطة',
         'سعة'], 
   'كلام': [
          'قول',
          'كلام',
          'نطق'], 
   'لقاء': [
          'اجتماع',
          'لقاء'], 
   'نكس': [
         'أقمح',
         'أقنع',
         'نكس'], 
   'بعل': [
         'بعل',
         'زوج'], 
   'سفيه': [
          'جاهل',
          'سفيه'], 
   'ثقلت': [
          'ثقلت',
          'خفت'], 
   'رضا': [
         'رضا',
         'تسليم',
         'تفويض'], 
   'قليلة': [
           'مزجاة',
           'قليلة',
           'يسيرة'], 
   'تلقاء': [
           'شطر',
           'تلقاء'], 
   'وقار': [
          'حلم',
          'سكينة',
          'وقار'], 
   'شديد': [
          'بخيل',
          'شحيح',
          'شديد',
          'ضنين'], 
   'ديار': [
          'بيوت',
          'ديار',
          'مساكن',
          'صرح',
          'أكنان'], 
   'النبي': [
           'الرسول',
           'النبي'], 
   'خرطوم': [
           'أنف',
           'خرطوم'], 
   'مزج': [
         'خلط',
         'شوب',
         'لبس',
         'مرح',
         'مزج'], 
   'صار': [
         'صار',
         'ظل'], 
   'نكث': [
         'نقض',
         'نكث'], 
   'عصيب': [
          'بئيس',
          'رابية',
          'شديد',
          'عصيب',
          'وبيل'], 
   'عكف': [
         'أثبت',
         'حبس',
         'أحصر',
         'سجن',
         'عكف',
         'عضل'], 
   'أتبع': [
          'تبع',
          'أتبع',
          'اتبع',
          'قص',
          'قفا',
          'لحق'], 
   'يدعون': [
           'يدعون',
           'يشتهون',
           'يتمنون'], 
   'رس': [
        'بئر',
        'جب',
        'رس'], 
   'بادر': [
          'بادر',
          'أسرع',
          'قصد',
          'أهطع',
          'أوفض'], 
   'وتر': [
         'ألت',
         'بخس',
         'خسر',
         'نقص',
         'هضم',
         'وتر'], 
   'كاهن': [
          'ساحر',
          'عالم',
          'كاهن'], 
   'فزع': [
         'خشية',
         'خوف',
         'رجاء',
         'رهبة',
         'فزع',
         'وجف',
         'وجل'], 
   'يشتهون': [
            'يدعون',
            'يشتهون',
            'يتمنون'], 
   'امرأة': [
           'امرأة'], 
   'سعر': [
         'جنة',
         'سعر',
         'سفاهة',
         'سوء'], 
   'سبح': [
         'سبح',
         'قدس'], 
   'القول': [
           'إفك',
           'بهتان',
           'خرص',
           'اختلاط',
           'شطط',
           'ظاهر',
           'القول',
           'فاحشة',
           'افتراء',
           'كذب'], 
   'ذنوب': [
          'خلاق',
          'ذنوب',
          'كفل',
          'نصيب'], 
   'السعير': [
            'الجحيم',
            'الحريق',
            'السعير',
            'النار'], 
   'ركن': [
         'جنح',
         'جنف',
         'ركن',
         'زاغ',
         'صغى',
         'عال',
         'ماد',
         'مال'], 
   'يزجي': [
          'يرسل',
          'يزجي',
          'يفتح'], 
   'أسرف': [
          'بذر',
          'أسرف'], 
   'رب': [
        'بعل',
        'رب'], 
   'أقبل': [
          'أتى',
          'جاء',
          'حضر',
          'أقبل'], 
   'ثاقب': [
          'ثاقب',
          'دري',
          'مضيء'], 
   'رد': [
        'رد',
        'رجع'], 
   'قوة': [
         'استطاعة',
         'طاقة',
         'قبل',
         'قوة',
         'قدرة',
         'مرة'], 
   'كند': [
         'ستر',
         'صفح',
         'عفا',
         'غطى',
         'كفر',
         'كند',
         'محا'], 
   'أمل': [
         'أمد',
         'أمل',
         'رجاء',
         'طمع'], 
   'البدو': [
           'البدو',
           'الظهور',
           'الإعلان'], 
   'خيل': [
         'جياد',
         'خير',
         'خيل',
         'عاديات'], 
   'جياد': [
          'جياد',
          'خير',
          'خيل',
          'عاديات'], 
   'عارض': [
          'خلال',
          'سحاب',
          'ظلة',
          'عارض',
          'معصرات',
          'غمامة',
          'مزن'], 
   'بيان': [
          'برهان',
          'بيان',
          'حجة',
          'دليل',
          'سلطان'], 
   'خلت': [
         'خلت',
         'مضت'], 
   'علامة': [
           'آية',
           'سمة',
           'علامة'], 
   'كفل': [
         'ضعف',
         'كفل'], 
   'قطر': [
         'قطر',
         'نحاس'], 
   'شحيح': [
          'بخيل',
          'شحيح',
          'شديد',
          'ضنين'], 
   'قطعهن': [
           'صرهن',
           'قطعهن'], 
   'قطع': [
         'حسر',
         'قطع'], 
   'سفاهة': [
           'جنة',
           'سعر',
           'سفاهة',
           'سوء'], 
   'سحاب': [
          'خلال',
          'سحاب',
          'ظلة',
          'عارض',
          'معصرات',
          'غمامة',
          'مزن'], 
   'بطاتة': [
           'بطاتة',
           'وليجة'], 
   'دليل': [
          'برهان',
          'بيان',
          'حجة',
          'دليل',
          'سلطان'], 
   'زلزلة': [
           'رجفة',
           'زلزلة'], 
   'وسط': [
         'عدل',
         'قسط',
         'وسط'], 
   'ظعن': [
         'سافر',
         'رحل',
         'ظعن'], 
   'رحل': [
         'سافر',
         'رحل',
         'ظعن'], 
   'مال': [
         'أخطأ',
         'مال'], 
   'تميز': [
          'تمزق',
          'تميز'], 
   'ماز': [
         'زيل',
         'ماز',
         'عزل'], 
   'حرك': [
         'حرك',
         'نغض'], 
   'خسئ': [
         'خسئ',
         'خزي'], 
   'بوار': [
          'بعد',
          'بوار',
          'تبار',
          'تدمير',
          'هلاك'], 
   'مات': [
         'تردى',
         'زهق',
         'مات',
         'هلك'], 
   'عال': [
         'جنح',
         'جنف',
         'ركن',
         'زاغ',
         'صغى',
         'عال',
         'ماد',
         'مال'], 
   'ماد': [
         'جنح',
         'جنف',
         'ركن',
         'زاغ',
         'صغى',
         'عال',
         'ماد',
         'مال'], 
   'بشر': [
         'أنام',
         'بشر',
         'برية',
         'جبلة',
         'خلق',
         'ناس'], 
   'خسر': [
         'ألت',
         'بخس',
         'خسر',
         'نقص',
         'هضم',
         'وتر'], 
   'عفا': [
         'ستر',
         'صفح',
         'عفا',
         'غطى',
         'كفر',
         'كند',
         'محا'], 
   'شق': [
        'شق',
        'فلق'], 
   'عبد': [
         'بخع',
         'عبد',
         'قتل'], 
   'قوى': [
         'أيد',
         'قوى'], 
   'فتح': [
         'حكم',
         'فتح',
         'فرق',
         'فصل',
         'قضى'], 
   'الرسول': [
            'الرسول',
            'النبي'], 
   'أمد': [
         'أمد',
         'أمل',
         'رجاء',
         'طمع'], 
   'نساء': [
          'أزواج',
          'نساء'], 
   'كفر': [
         'ستر',
         'صفح',
         'عفا',
         'غطى',
         'كفر',
         'كند',
         'محا'], 
   'قول': [
         'قول',
         'كلام',
         'نطق'], 
   'أمة': [
         'أمة',
         'ضلال',
         'نسيان'], 
   'قفا': [
         'تبع',
         'أتبع',
         'اتبع',
         'قص',
         'قفا',
         'لحق'], 
   'خير': [
         'خير',
         'مال'], 
   'آتى': [
         'آتى',
         'ائتلى',
         'حلف',
         'أقسم',
         'يمين'], 
   'اعترف': [
           'اعترف',
           'أقر'], 
   'ولدان': [
           'غلمان',
           'فتيان',
           'ولدان'], 
   'كتب': [
         'زبر',
         'كتب',
         'نسخ'], 
   'شيطان': [
           'إبليس',
           'جبت',
           'شيطان'], 
   'غيث': [
         'رزق',
         'مطر',
         'غيث',
         'ودق'], 
   'فئة': [
         'ثبات',
         'ثلة',
         'حزب',
         'رهط',
         'زمرة',
         'شرذمة',
         'طائفة',
         'عصبة',
         'فئة',
         'فريق',
         'فوج',
         'نفر',
         'موالي'], 
   'أوقد': [
          'سجر',
          'سعر',
          'أشعل',
          'أوقد'], 
   'سبيل': [
          'مخرج',
          'سبيل',
          'فرقان'], 
   'أهل': [
         'أهل',
         'آل',
         'ذرية'], 
   'زرع': [
         'زرع',
         'شجر',
         'نبات',
         'نجم'], 
   'أتى': [
         'أتى',
         'جاء',
         'حضر',
         'أقبل'], 
   'عرف': [
         'عرف',
         'علم',
         'فهم'], 
   'حمار': [
          'بعير',
          'حمار'], 
   'غيظ': [
         'غضب',
         'غيظ'], 
   'حصون': [
          'حصون',
          'صياصي'], 
   'يم': [
        'بحر',
        'يم'], 
   'برهان': [
           'برهان',
           'بيان',
           'حجة',
           'دليل',
           'سلطان'], 
   'هدنا': [
          'تبنا',
          'أنبنا',
          'هدنا'], 
   'معجز': [
          'معجز',
          'سابق'], 
   'فؤاد': [
          'حجر',
          'حلم',
          'عقل',
          'فؤاد',
          'قلب',
          'لب',
          'نهى'], 
   'برية': [
          'أنام',
          'بشر',
          'برية',
          'جبلة',
          'خلق',
          'ناس'], 
   'يتمتع': [
           'يغني',
           'يتمتع'], 
   'رياء': [
          'رياء',
          'نفاق'], 
   'نسل': [
         'خرج',
         'نسل'], 
   'صغى': [
         'جنح',
         'جنف',
         'ركن',
         'زاغ',
         'صغى',
         'عال',
         'ماد',
         'مال'], 
   'عتا': [
         'طغى',
         'عتا'], 
   'جبين': [
          'جبين',
          'جبهة'], 
   'أوصد': [
          'سكر',
          'غلق',
          'أوصد'], 
   'رجع': [
         'رد',
         'رجع'], 
   'وصب': [
         'ألم',
         'وصب'], 
   'غمز': [
         'غمز',
         'لمز',
         'همز'], 
   'مملق': [
          'بائس',
          'مسكين',
          'معتر',
          'عائل',
          'فقير',
          'قانع',
          'مملق'], 
   'حجر': [
         'حجر',
         'صفوان'], 
   'ضنين': [
          'بخيل',
          'شحيح',
          'شديد',
          'ضنين'], 
   'دائم': [
          'خالد',
          'دائم',
          'سرمد',
          'مستمر',
          'واصب'], 
   'ساق': [
         'شطء',
         'ساق'], 
   'مقشعرة': [
            'خاشعة',
            'مقشعرة'], 
   'دلوك': [
          'دلوك',
          'زوال'], 
   'ملك': [
         'سلطان',
         'ملك'], 
   'أوصل': [
          'أدى',
          'أبلغ',
          'أوصل'], 
   'صاغر': [
          'خاسئ',
          'ذليل',
          'مستكين',
          'صاغر',
          'مهان'], 
   'خرص': [
         'إفك',
         'بهتان',
         'خرص',
         'اختلاط',
         'شطط',
         'ظاهر',
         'القول',
         'فاحشة',
         'افتراء',
         'كذب'], 
   'انفطرت': [
            'انشقت',
            'فرجت',
            'انفطرت',
            'كشطت',
            'مارت'], 
   'رجز': [
         'رجز',
         'صنم',
         'طاغوت',
         'تمثال',
         'وثن'], 
   'ابتأس': [
           'أسي',
           'ابتأس',
           'بث',
           'حزن',
           'كرب'], 
   'تفويض': [
           'رضا',
           'تسليم',
           'تفويض'], 
   'ذليل': [
          'خاسئ',
          'ذليل',
          'مستكين',
          'صاغر',
          'مهان'], 
   'ملتحد': [
           'ملجأ',
           'ملتحد',
           'مناص',
           'موئل',
           'وزر'], 
   'قرين': [
          'حميم',
          'خدن',
          'خليل',
          'صاحب',
          'صديق',
          'قرين',
          'ولي'], 
   'زين': [
         'زين',
         'سول'], 
   'انقلب': [
           'آب',
           'حار',
           'رجع',
           'ارتد',
           'عاد',
           'فاء',
           'انقلب',
           'نكص'], 
   'آنية': [
          'آنية',
          'سقاية',
          'صحاف',
          'صواع'], 
   'المرية': [
            'الجرم',
            'الحرج',
            'الحسبان',
            'الرجم',
            'الريب',
            'الزعم',
            'الظن',
            'المرض',
            'المرية'], 
   'رجفة': [
          'رجفة',
          'زلزلة'], 
   'ذهبوا': [
           'ذهبوا',
           'انفضوا',
           'مضوا'], 
   'خرج': [
         'خرج',
         'نسل'], 
   'فورهم': [
           'فورهم',
           'وجههم'], 
   'فاطر': [
          'بديع',
          'بارئ',
          'جاعل',
          'خالق',
          'ذارئ',
          'صانع',
          'فاطر'], 
   'أقمح': [
          'أقمح',
          'أقنع',
          'نكس'], 
   'تسليم': [
           'رضا',
           'تسليم',
           'تفويض'], 
   'بزغ': [
         'بزغ',
         'طلع'], 
   'يسيرة': [
           'مزجاة',
           'قليلة',
           'يسيرة'], 
   'كتم': [
         'أخفى',
         'أسر',
         'كتم',
         'أكن'], 
   'حنذ': [
         'حنذ',
         'شوى'], 
   'أخفى': [
          'أخفى',
          'أسر',
          'كتم',
          'أكن'], 
   'لينة': [
          'لينة',
          'نخلة'], 
   'يد': [
        'جناح',
        'يد'], 
   'الحسبان': [
             'الجرم',
             'الحرج',
             'الحسبان',
             'الرجم',
             'الريب',
             'الزعم',
             'الظن',
             'المرض',
             'المرية'], 
   'خشية': [
          'خشية',
          'خوف',
          'رجاء',
          'رهبة',
          'فزع',
          'وجف',
          'وجل'], 
   'ألهم': [
          'ألهم',
          'أوحى',
          'أوزع'], 
   'عائل': [
          'بائس',
          'مسكين',
          'معتر',
          'عائل',
          'فقير',
          'قانع',
          'مملق'], 
   'إفك': [
         'إفك',
         'بهتان',
         'خرص',
         'اختلاط',
         'شطط',
         'ظاهر',
         'القول',
         'فاحشة',
         'افتراء',
         'كذب'], 
   'يمين': [
          'آتى',
          'ائتلى',
          'حلف',
          'أقسم',
          'يمين'], 
   'نداء': [
          'دعاء',
          'نداء'], 
   'نسيان': [
           'سهو',
           'نسيان',
           'غفلة',
           'غمرة',
           'ضلال'], 
   'ولي': [
         'حميم',
         'خدن',
         'خليل',
         'صاحب',
         'صديق',
         'قرين',
         'ولي'], 
   'الرجم': [
           'الجرم',
           'الحرج',
           'الحسبان',
           'الرجم',
           'الريب',
           'الزعم',
           'الظن',
           'المرض',
           'المرية'], 
   'عرج': [
         'رفع',
         'رقي',
         'صعد',
         'عرج',
         'علا'], 
   'عام': [
         'حجة',
         'حول',
         'سنة',
         'عام'], 
   'حرق': [
         'حرق',
         'فتن',
         'لوح'], 
   'شهوة': [
          'شهوة',
          'هوى'], 
   'الكبت': [
           'البهل',
           'الرجم',
           'الطرد',
           'الكبت',
           'اللعن'], 
   'عهد': [
         'إصر',
         'بيعة',
         'عقد',
         'عهد',
         'ميثاق'], 
   'تحسس': [
          'تجسس',
          'تحسس'], 
   'استطاعة': [
             'استطاعة',
             'طاقة',
             'قبل',
             'قوة',
             'قدرة',
             'مرة'], 
   'قلب': [
         'حجر',
         'حلم',
         'عقل',
         'فؤاد',
         'قلب',
         'لب',
         'نهى'], 
   'أعجاز': [
           'أعجاز',
           'أجذاع'], 
   'عاد': [
         'آب',
         'حار',
         'رجع',
         'ارتد',
         'عاد',
         'فاء',
         'انقلب',
         'نكص'], 
   'وجف': [
         'خشية',
         'خوف',
         'رجاء',
         'رهبة',
         'فزع',
         'وجف',
         'وجل'], 
   'نبات': [
          'زرع',
          'شجر',
          'نبات',
          'نجم'], 
   'عرض': [
         'عرض',
         'متاع'], 
   'يترك': [
          'يبقي',
          'يترك',
          'يفرط',
          'يدع',
          'يذر'], 
   'ركم': [
         'جمع',
         'ركم',
         'سجر',
         'أقت'], 
   'خلط': [
         'خلط',
         'شوب',
         'لبس',
         'مرح',
         'مزج'], 
   'الحرج': [
           'الجرم',
           'الحرج',
           'الحسبان',
           'الرجم',
           'الريب',
           'الزعم',
           'الظن',
           'المرض',
           'المرية'], 
   'غمامة': [
           'خلال',
           'سحاب',
           'ظلة',
           'عارض',
           'معصرات',
           'غمامة',
           'مزن'], 
   'قلى': [
         'بغضاء',
         'شنآن',
         'قلى',
         'كره',
         'مقت'], 
   'ليس': [
         'لات',
         'ليس'], 
   'حرد': [
         'حرد',
         'قصد'], 
   'صنم': [
         'رجز',
         'صنم',
         'طاغوت',
         'تمثال',
         'وثن'], 
   'نصيب': [
          'خلاق',
          'ذنوب',
          'كفل',
          'نصيب'], 
   'حرص': [
         'حرص',
         'رجاء',
         'طمع'], 
   'حرض': [
         'حث',
         'حرض',
         'حض'], 
   'خصاصة': [
           'خصاصة',
           'عيلة',
           'فقر',
           'إملاق'], 
   'حطب': [
         'حصب',
         'حطب'], 
   'ثلة': [
         'ثبات',
         'ثلة',
         'حزب',
         'رهط',
         'زمرة',
         'شرذمة',
         'طائفة',
         'عصبة',
         'فئة',
         'فريق',
         'فوج',
         'نفر',
         'موالي'], 
   'لمز': [
         'غمز',
         'لمز',
         'همز'], 
   'ابتغى': [
           'ابتغى',
           'أراد',
           'شاء',
           'أصاب'], 
   'خاب': [
         'بلس',
         'قنط',
         'خاب',
         'يئس'], 
   'جبلة': [
          'أنام',
          'بشر',
          'برية',
          'جبلة',
          'خلق',
          'ناس'], 
   'أرسل': [
          'بعث',
          'أرسل'], 
   'حرج': [
         'حرج',
         'حصر',
         'ضاق'], 
   'مشأمة': [
           'مشأمة',
           'شمال'], 
   'ولد': [
         'ابن',
         'ولد'], 
   'نحاس': [
          'قطر',
          'نحاس'], 
   'تمثال': [
           'رجز',
           'صنم',
           'طاغوت',
           'تمثال',
           'وثن'], 
   'نقض': [
         'نقض',
         'نكث'], 
   'نقص': [
         'ألت',
         'بخس',
         'خسر',
         'نقص',
         'هضم',
         'وتر'], 
   'أنبأ': [
          'أخبر',
          'أعلم',
          'أنبأ'], 
   'الإعلان': [
             'البدو',
             'الظهور',
             'الإعلان'], 
   'انتظر': [
           'أمهل',
           'أنظر',
           'انتظر'], 
   'وزر': [
         'إثم',
         'جرم',
         'حنث',
         'حوب',
         'ذنب',
         'خطيئة',
         'معصية',
         'عنت',
         'وزر'], 
   'جبت': [
         'إبليس',
         'جبت',
         'شيطان'], 
   'قرض': [
         'دين',
         'قرض'], 
   'صدق': [
         'حق',
         'صدق'], 
   'صدف': [
         'جبل',
         'صدف',
         'طود',
         'طور'], 
   'حدب': [
         'جانب',
         'حدب'], 
   'فراق': [
          'سراح',
          'طلاق',
          'فراق'], 
   'غبرة': [
          'غبرة',
          'قترة'], 
   'قضى': [
         'حكم',
         'فتح',
         'فرق',
         'فصل',
         'قضى'], 
   'طاغوت': [
           'رجز',
           'صنم',
           'طاغوت',
           'تمثال',
           'وثن'], 
   'رؤية': [
          'رؤية',
          'علم'], 
   'فسر': [
         'أول',
         'فسر'], 
   'حميم': [
          'حميم',
          'خدن',
          'خليل',
          'صاحب',
          'صديق',
          'قرين',
          'ولي'], 
   'كاد': [
         'أراد',
         'كاد'], 
   'عمله': [
          'طائره',
          'عمله'], 
   'نطق': [
         'قول',
         'كلام',
         'نطق'], 
   'نوم': [
         'برد',
         'نوم'], 
   'زوال': [
          'دلوك',
          'زوال'], 
   'تحية': [
          'تحية',
          'سلام'], 
   'حبور': [
          'حبور',
          'سرور',
          'فرح',
          'مرح'], 
   'حبس': [
         'أثبت',
         'حبس',
         'أحصر',
         'سجن',
         'عكف',
         'عضل'], 
   'وجههم': [
           'فورهم',
           'وجههم'], 
   'مستكين': [
            'خاسئ',
            'ذليل',
            'مستكين',
            'صاغر',
            'مهان'], 
   'جميعا': [
           'جميعا',
           'لفيفا'], 
   'آذن': [
         'آذن',
         'أعلم'], 
   'إمر': [
         'إمر',
         'عجب'], 
   'حبل': [
         'حبل',
         'سبب'], 
   'قدس': [
         'سبح',
         'قدس'], 
   'تدمير': [
           'بعد',
           'بوار',
           'تبار',
           'تدمير',
           'هلاك'], 
   'حبك': [
         'جدد',
         'حبك',
         'ريع',
         'سبيل',
         'صراط',
         'طريق',
         'فج',
         'نجد'], 
   'بديع': [
          'بديع',
          'بارئ',
          'جاعل',
          'خالق',
          'ذارئ',
          'صانع',
          'فاطر'], 
   'الفساد': [
            'العثو',
            'الفساد'], 
   'فصل': [
         'حكم',
         'فتح',
         'فرق',
         'فصل',
         'قضى'], 
   'ذرية': [
          'أهل',
          'آل',
          'ذرية'], 
   'أبصر': [
          'آنس',
          'أبصر',
          'رآى',
          'نظر'], 
   'يئس': [
         'تبين',
         'يئس',
         'أيقن'], 
   'عسعس': [
          'أدبر',
          'عسعس'], 
   'قرأ': [
         'سفر',
         'قرأ'], 
   'ألت': [
         'ألت',
         'بخس',
         'خسر',
         'نقص',
         'هضم',
         'وتر'], 
   'نفاق': [
          'رياء',
          'نفاق'], 
   'دحر': [
         'دحر',
         'طرد'], 
   'اتبع': [
          'تبع',
          'أتبع',
          'اتبع',
          'قص',
          'قفا',
          'لحق'], 
   'لقي': [
         'ثقف',
         'ألفى',
         'لقي',
         'وجد'], 
   'هدى': [
         'أرشد',
         'هدى'], 
   'ضراء': [
          'بأساء',
          'ضراء'], 
   'الرحمن': [
            'الرحمن',
            'الرحيم'], 
   'إبل': [
         'إبل',
         'عير'], 
   'غرام': [
          'ابتلاء',
          'اختبار',
          'غرام',
          'تمحيص'], 
   'غواية': [
           'شقاق',
           'ضلال',
           'غواية',
           'فتنة'], 
   'نحلة': [
          'صدقة',
          'عطية',
          'نحلة',
          'هبة',
          'هدية'], 
   'عيش': [
         'حياة',
         'عيش'], 
   'الظل': [
          'الظل',
          'الفيء'], 
   'الطرد': [
           'البهل',
           'الرجم',
           'الطرد',
           'الكبت',
           'اللعن'], 
   'باطل': [
          'باطل',
          'فاسد'], 
   'ند': [
        'مثل',
        'ند'], 
   'جاب': [
         'جاب',
         'نحت'], 
   'لمس': [
         'لمس',
         'مس'], 
   'كتاب': [
          'إمام',
          'رقيم',
          'مسطور',
          'سفر',
          'قط',
          'كتاب',
          'لوح'], 
   'مبعوث': [
           'مبعوث',
           'مدين'], 
   'أطاع': [
          'أوب',
          'أطاع'], 
   'جاء': [
         'أتى',
         'جاء',
         'حضر',
         'أقبل'], 
   'سفه': [
         'خسر',
         'سفه',
         'ضيع'], 
   'تفكر': [
          'تدبر',
          'تفكر'], 
   'ثوى': [
         'ثوى',
         'لبث',
         'مكث'], 
   'يسير': [
          'يسير',
          'يمشي'], 
   'تارة': [
          'تارة',
          'مرة'], 
   'رابية': [
           'بئيس',
           'رابية',
           'شديد',
           'عصيب',
           'وبيل'], 
   'زمان': [
          'دهر',
          'زمان',
          'عصر',
          'وقت'], 
   'عقد': [
         'إصر',
         'بيعة',
         'عقد',
         'عهد',
         'ميثاق'], 
   'دفع': [
         'دع',
         'دفع',
         'رد'], 
   'آل': [
        'أهل',
        'آل',
        'ذرية'], 
   'جانب': [
          'جانب',
          'حدب'], 
   'سفاح': [
          'زنا',
          'سفاح',
          'مرض'], 
   'نعماء': [
           'سراء',
           'نعماء'], 
   'نسخ': [
         'زبر',
         'كتب',
         'نسخ'], 
   'أقت': [
         'جمع',
         'ركم',
         'سجر',
         'أقت'], 
   'مستمر': [
           'خالد',
           'دائم',
           'سرمد',
           'مستمر',
           'واصب'], 
   'رقيم': [
          'إمام',
          'رقيم',
          'مسطور',
          'سفر',
          'قط',
          'كتاب',
          'لوح'], 
   'صحاف': [
          'آنية',
          'سقاية',
          'صحاف',
          'صواع'], 
   'فقير': [
          'بائس',
          'مسكين',
          'معتر',
          'عائل',
          'فقير',
          'قانع',
          'مملق'], 
   'وراء': [
          'أمام',
          'وراء'], 
   'تراب': [
          'تراب',
          'ثرى'], 
   'أقر': [
         'اعترف',
         'أقر'], 
   'سول': [
         'زين',
         'سول'], 
   'سوم': [
         'سوم',
         'رعي'], 
   'اللعن': [
           'البهل',
           'الرجم',
           'الطرد',
           'الكبت',
           'اللعن'], 
   'صياصي': [
           'حصون',
           'صياصي'], 
   'فيء': [
         'ربح',
         'غنيمة',
         'فيء',
         'كسب'], 
   'نجم': [
         'كوكب',
         'نجم'], 
   'عصا': [
         'عصا',
         'منسأة'], 
   'كذب': [
         'إفك',
         'بهتان',
         'خرص',
         'اختلاط',
         'شطط',
         'ظاهر',
         'القول',
         'فاحشة',
         'افتراء',
         'كذب'], 
   'سور': [
         'جدار',
         'سور'], 
   'نام': [
         'نام',
         'هجع'], 
   'شنآن': [
          'بغضاء',
          'شنآن',
          'قلى',
          'كره',
          'مقت'], 
   'عالم': [
          'ساحر',
          'عالم',
          'كاهن'], 
   'ظاهر': [
          'إفك',
          'بهتان',
          'خرص',
          'اختلاط',
          'شطط',
          'ظاهر',
          'القول',
          'فاحشة',
          'افتراء',
          'كذب'], 
   'آب': [
        'آب',
        'حار',
        'رجع',
        'ارتد',
        'عاد',
        'فاء',
        'انقلب',
        'نكص'], 
   'حث': [
        'حث',
        'حرض',
        'حض'], 
   'طور': [
         'جبل',
         'صدف',
         'طود',
         'طور'], 
   'سوء': [
         'جنة',
         'سعر',
         'سفاهة',
         'سوء'], 
   'لغوب': [
          'إعياء',
          'لغوب',
          'نصب'], 
   'زخرف': [
          'ذهب',
          'زخرف'], 
   'نجد': [
         'جدد',
         'حبك',
         'ريع',
         'سبيل',
         'صراط',
         'طريق',
         'فج',
         'نجد'], 
   'إعياء': [
           'إعياء',
           'لغوب',
           'نصب'], 
   'قيمة': [
          'ثمن',
          'قيمة'], 
   'بيوت': [
          'بيوت',
          'ديار',
          'مساكن',
          'صرح',
          'أكنان'], 
   'صلصال': [
           'حمأ',
           'سجيل',
           'صلصال',
           'طين'], 
   'خزي': [
         'خسئ',
         'خزي'], 
   'شطء': [
         'شطء',
         'ساق'], 
   'سفح': [
         'سفح',
         'سكب',
         'صب'], 
   'زاغ': [
         'جنح',
         'جنف',
         'ركن',
         'زاغ',
         'صغى',
         'عال',
         'ماد',
         'مال'], 
   'جان': [
         'ثعبان',
         'جان'], 
   'ظلة': [
         'خلال',
         'سحاب',
         'ظلة',
         'عارض',
         'معصرات',
         'غمامة',
         'مزن'], 
   'منهاج': [
           'شرعة',
           'منهاج'], 
   'سفع': [
         'أخذ',
         'سفع'], 
   'شطر': [
         'شطر',
         'تلقاء'], 
   'المفردات': [
              'المفردات'], 
   'شطط': [
         'إفك',
         'بهتان',
         'خرص',
         'اختلاط',
         'شطط',
         'ظاهر',
         'القول',
         'فاحشة',
         'افتراء',
         'كذب'], 
   'دع': [
        'دع',
        'دفع',
        'رد'], 
   'سفر': [
         'إمام',
         'رقيم',
         'مسطور',
         'سفر',
         'قط',
         'كتاب',
         'لوح'], 
   'عقل': [
         'حجر',
         'حلم',
         'عقل',
         'فؤاد',
         'قلب',
         'لب',
         'نهى'], 
   'ثياب': [
          'ثياب',
          'لباس'], 
   'خاسئ': [
          'خاسئ',
          'ذليل',
          'مستكين',
          'صاغر',
          'مهان'], 
   'ستر': [
         'برزخ',
         'حجاب',
         'حاجز',
         'ستر',
         'غطاء'], 
   'حيلة': [
          'حيلة',
          'مكر'], 
   'صرح': [
         'بيوت',
         'ديار',
         'مساكن',
         'صرح',
         'أكنان'], 
   'غلمان': [
           'غلمان',
           'فتيان',
           'ولدان'], 
   'حليم': [
          'حليم',
          'سيد',
          'صابر'], 
   'حاجة': [
          'أرب',
          'حاجة'], 
   'فهم': [
         'عرف',
         'علم',
         'فهم'], 
   'عزل': [
         'زيل',
         'ماز',
         'عزل'], 
   'قاتلهم': [
            'البهل',
            'الرجم',
            'الطرد',
            'الكبت',
            'اللعن'], 
   'فوج': [
         'ثبات',
         'ثلة',
         'حزب',
         'رهط',
         'زمرة',
         'شرذمة',
         'طائفة',
         'عصبة',
         'فئة',
         'فريق',
         'فوج',
         'نفر',
         'موالي'], 
   'دين': [
         'دين',
         'قرض'], 
   'حاجز': [
          'برزخ',
          'حجاب',
          'حاجز',
          'ستر',
          'غطاء'], 
   'يسعون': [
           'يزفون',
           'يسعون',
           'يهرعون'], 
   'نزغ': [
         'نزغ',
         'وسوس'], 
   'العرش': [
           'العرش',
           'الكرسي'], 
   'ألفى': [
          'ثقف',
          'ألفى',
          'لقي',
          'وجد'], 
   'لفيفا': [
           'جميعا',
           'لفيفا'], 
   'أثبت': [
          'أثبت',
          'حبس',
          'أحصر',
          'سجن',
          'عكف',
          'عضل'], 
   'جوف': [
         'بطن',
         'جوف'], 
   'فقر': [
         'خصاصة',
         'عيلة',
         'فقر',
         'إملاق'], 
   'استهزاء': [
             'سخرية',
             'استهزاء',
             'تفنيد'], 
   'تمحيص': [
           'ابتلاء',
           'اختبار',
           'غرام',
           'تمحيص'], 
   'يذر': [
         'يبقي',
         'يترك',
         'يفرط',
         'يدع',
         'يذر'], 
   'دخل': [
         'دخل',
         'سلك'], 
   'معصرات': [
            'خلال',
            'سحاب',
            'ظلة',
            'عارض',
            'معصرات',
            'غمامة',
            'مزن'], 
   'كثير': [
          'جم',
          'غدق',
          'كثير',
          'لبد'], 
   'صراط': [
          'جدد',
          'حبك',
          'ريع',
          'سبيل',
          'صراط',
          'طريق',
          'فج',
          'نجد'], 
   'جوع': [
         'جوع',
         'مخمصة',
         'مسغبة',
         'إملاق'], 
   'شوى': [
         'حنذ',
         'شوى'], 
   'اجتماع': [
            'اجتماع',
            'لقاء'], 
   'ألم': [
         'ألم',
         'وصب'], 
   'محا': [
         'ستر',
         'صفح',
         'عفا',
         'غطى',
         'كفر',
         'كند',
         'محا'], 
   'جبل': [
         'جبل',
         'صدف',
         'طود',
         'طور'], 
   'مستقر': [
           'مثوى',
           'مستقر',
           'مستودع'], 
   'صيام': [
          'سياحة',
          'صيام',
          'صوم'], 
   'يفتح': [
          'يرسل',
          'يزجي',
          'يفتح'], 
   'سخرية': [
           'سخرية',
           'استهزاء',
           'تفنيد'], 
   'تمزق': [
          'تمزق',
          'تميز'], 
   'بث': [
        'أسي',
        'ابتأس',
        'بث',
        'حزن',
        'كرب'], 
   'عقيم': [
          'عاقر',
          'عقيم'], 
   'ضعف': [
         'ضعف',
         'وهن'], 
   'سيد': [
         'حليم',
         'سيد',
         'صابر'], 
   'جور': [
         'جور',
         'رهق',
         'ضيز',
         'ظلم',
         'هضم'], 
   'شوب': [
         'خلط',
         'شوب',
         'لبس',
         'مرح',
         'مزج'], 
   'غسلين': [
           'آنية',
           'حامية',
           'غسلين'], 
   'إبليس': [
           'إبليس',
           'جبت',
           'شيطان'], 
   'ذارئ': [
          'بديع',
          'بارئ',
          'جاعل',
          'خالق',
          'ذارئ',
          'صانع',
          'فاطر'], 
   'عزب': [
         'أفل',
         'عزب',
         'غاب'], 
   'طريق': [
          'جدد',
          'حبك',
          'ريع',
          'سبيل',
          'صراط',
          'طريق',
          'فج',
          'نجد'], 
   'سكب': [
         'سفح',
         'سكب',
         'صب'], 
   'نزل': [
         'أخبت',
         'خشع',
         'خضع',
         'نزل',
         'هبط'], 
   'إل': [
        'إل',
        'قرابة'], 
   'شرد': [
         'شرد',
         'نكل'], 
   'موئل': [
          'ملجأ',
          'ملتحد',
          'مناص',
          'موئل',
          'وزر'], 
   'دساها': [
           'دساها',
           'أفسدها'], 
   'كشطت': [
          'انشقت',
          'فرجت',
          'انفطرت',
          'كشطت',
          'مارت'], 
   'هزل': [
         'لعب',
         'لهو',
         'هزل'], 
   'تكذيب': [
           'زور',
           'تفنيد',
           'تكذيب'], 
   'رجل': [
         'ربي',
         'رجل',
         'امرؤ'], 
   'ضلال': [
          'شقاق',
          'ضلال',
          'غواية',
          'فتنة'], 
   'سكر': [
         'سكر',
         'غلق',
         'أوصد'], 
   'منسأة': [
           'عصا',
           'منسأة'], 
   'تربص': [
          'تربص',
          'ارتقب',
          'انتظر'], 
   'سجيل': [
          'حمأ',
          'سجيل',
          'صلصال',
          'طين'], 
   'لبد': [
         'جم',
         'غدق',
         'كثير',
         'لبد'], 
   'أبلغ': [
          'أدى',
          'أبلغ',
          'أوصل'], 
   'لبث': [
         'ثوى',
         'لبث',
         'مكث'], 
   'مضيء': [
          'ثاقب',
          'دري',
          'مضيء'], 
   'طين': [
         'حمأ',
         'سجيل',
         'صلصال',
         'طين'], 
   'الصلح': [
           'السلم',
           'الصلح'], 
   'عدل': [
         'عدل',
         'قسط',
         'وسط'], 
   'الفيء': [
           'الظل',
           'الفيء'], 
   'قانع': [
          'بائس',
          'مسكين',
          'معتر',
          'عائل',
          'فقير',
          'قانع',
          'مملق'], 
   'خبال': [
          'خبال',
          'رهق',
          'غي'], 
   'خدع': [
         'خدع',
         'غر',
         'مكر'], 
   'يزفون': [
           'يزفون',
           'يسعون',
           'يهرعون'], 
   'أفيضوا': [
            'أفيضوا',
            'انفروا'], 
   'تبار': [
          'بعد',
          'بوار',
          'تبار',
          'تدمير',
          'هلاك'], 
   'لبس': [
         'خلط',
         'شوب',
         'لبس',
         'مرح',
         'مزج'], 
   'أعلم': [
          'أخبر',
          'أعلم',
          'أنبأ'], 
   'مخرج': [
          'مخرج',
          'سبيل',
          'فرقان'], 
   'مثوى': [
          'مثوى',
          'مستقر',
          'مستودع'], 
   'مد': [
        'سطح',
        'طحا',
        'مد'], 
   'الشكل': [
           'الشبه',
           'الشكل'], 
   'أظلم': [
          'أظلم',
          'أغطش'], 
   'ساعات': [
           'آناء',
           'ساعات'], 
   'قرابة': [
           'إل',
           'قرابة'], 
   'الطرائق': [
             'السموات',
             'الطرائق'], 
   'لات': [
         'لات',
         'ليس'], 
   'صد': [
        'صد',
        'منع'], 
   'مستودع': [
            'مثوى',
            'مستقر',
            'مستودع'], 
   'سياحة': [
           'سياحة',
           'صيام',
           'صوم'], 
   'تجسس': [
          'تجسس',
          'تحسس'], 
   'دري': [
         'ثاقب',
         'دري',
         'مضيء'], 
   'مس': [
        'لمس',
        'مس'], 
   'ماخرة': [
           'جارية',
           'سفينة',
           'فلك',
           'ماخرة'], 
   'غطى': [
         'ستر',
         'صفح',
         'عفا',
         'غطى',
         'كفر',
         'كند',
         'محا'], 
   'تردى': [
          'تردى',
          'زهق',
          'مات',
          'هلك'], 
   'جسد': [
         'بدن',
         'جسم',
         'جسد'], 
   'يتمنون': [
            'يدعون',
            'يشتهون',
            'يتمنون'], 
   'آنس': [
         'آنس',
         'أبصر',
         'رآى',
         'نظر'], 
   'هجع': [
         'نام',
         'هجع'], 
   'سلامة': [
           'سلامة',
           'صحة'], 
   'كأس': [
         'كأس',
         'كوب'], 
   'ثواب': [
          'أجر',
          'ثواب',
          'جزاء',
          'حساب',
          'دين'], 
   'رآى': [
         'آنس',
         'أبصر',
         'رآى',
         'نظر'], 
   'حزن': [
         'أسي',
         'ابتأس',
         'بث',
         'حزن',
         'كرب'], 
   'صواع': [
          'آنية',
          'سقاية',
          'صحاف',
          'صواع'], 
   'بدن': [
         'بدن',
         'جسم',
         'جسد'], 
   'يمشي': [
          'يسير',
          'يمشي'], 
   'اطلع': [
          'عثر',
          'اطلع'], 
   'ودق': [
         'رزق',
         'مطر',
         'غيث',
         'ودق'], 
   'سرور': [
          'حبور',
          'سرور',
          'فرح',
          'مرح'], 
   'باع': [
         'باع',
         'اشترى'], 
   'أسر': [
         'أخفى',
         'أسر',
         'كتم',
         'أكن'], 
   'خدن': [
         'حميم',
         'خدن',
         'خليل',
         'صاحب',
         'صديق',
         'قرين',
         'ولي'], 
   'كوكب': [
          'كوكب',
          'نجم'], 
   'أكنان': [
           'بيوت',
           'ديار',
           'مساكن',
           'صرح',
           'أكنان'], 
   'شهد': [
         'شهد',
         'قال'], 
   'ساحر': [
          'ساحر',
          'عالم',
          'كاهن'], 
   'اختبار': [
            'ابتلاء',
            'اختبار',
            'غرام',
            'تمحيص'], 
   'مهين': [
          'شاهد',
          'مهين'], 
   'ود': [
        'حب',
        'ود'], 
   'بخيل': [
          'بخيل',
          'شحيح',
          'شديد',
          'ضنين'], 
   'رعي': [
         'سوم',
         'رعي'], 
   'زور': [
         'زور',
         'تفنيد',
         'تكذيب'], 
   'رقبة': [
          'جيد',
          'رقبة',
          'عنق'], 
   'سنون': [
          'أمة',
          'سنون'], 
   'فجر': [
         'سجر',
         'فجر'], 
   'خشع': [
         'أخبت',
         'خشع',
         'خضع',
         'نزل',
         'هبط'], 
   'هدية': [
          'صدقة',
          'عطية',
          'نحلة',
          'هبة',
          'هدية'], 
   'نضج': [
         'إنا',
         'صهر',
         'نضج'], 
   'جدار': [
          'جدار',
          'سور'], 
   'طلب': [
         'دعاء',
         'سؤال',
         'طلب'], 
   'أمهل': [
          'أمهل',
          'أنظر',
          'انتظر'], 
   'جاهل': [
          'جاهل',
          'سفيه'], 
   'علم': [
         'عرف',
         'علم',
         'فهم'], 
   'ربانيون': [
             'ربانيون',
             'علماء'], 
   'عضل': [
         'أثبت',
         'حبس',
         'أحصر',
         'سجن',
         'عكف',
         'عضل'], 
   'سهو': [
         'سهو',
         'نسيان',
         'غفلة',
         'غمرة',
         'ضلال'], 
   'حار': [
         'آب',
         'حار',
         'رجع',
         'ارتد',
         'عاد',
         'فاء',
         'انقلب',
         'نكص'], 
   'تباب': [
          'تباب',
          'خسران'], 
   'رؤيا': [
          'حلم',
          'رؤيا'], 
   'طلع': [
         'بزغ',
         'طلع'], 
   'انكدرت': [
            'طمست',
            'انكدرت'], 
   'خليل': [
          'حميم',
          'خدن',
          'خليل',
          'صاحب',
          'صديق',
          'قرين',
          'ولي'], 
   'العزم': [
           'العزم',
           'القوة'], 
   'أقنع': [
          'أقمح',
          'أقنع',
          'نكس'], 
   'صفوان': [
           'حجر',
           'صفوان'], 
   'أغلال': [
           'أصفاد',
           'أغلال'], 
   'اختار': [
           'آثر',
           'اختار',
           'اصطفى',
           'فضل'], 
   'صانع': [
          'بديع',
          'بارئ',
          'جاعل',
          'خالق',
          'ذارئ',
          'صانع',
          'فاطر'], 
   'تبع': [
         'تبع',
         'أتبع',
         'اتبع',
         'قص',
         'قفا',
         'لحق'], 
   'بلس': [
         'بلس',
         'قنط',
         'خاب',
         'يئس'], 
   'طوبى': [
          'جنة',
          'طوبى'], 
   'صوم': [
         'سياحة',
         'صيام',
         'صوم'], 
   'سافر': [
          'سافر',
          'رحل',
          'ظعن'], 
   'أيد': [
         'أيد',
         'قوى'], 
   'هرب': [
         'أبق',
         'فر',
         'ناص',
         'هرب'], 
   'حكم': [
         'حكم',
         'فتح',
         'فرق',
         'فصل',
         'قضى'], 
   'مسكين': [
           'بائس',
           'مسكين',
           'معتر',
           'عائل',
           'فقير',
           'قانع',
           'مملق'], 
   'ثمن': [
         'ثمن',
         'قيمة'], 
   'حامية': [
           'آنية',
           'حامية',
           'غسلين'], 
   'قاص': [
         'بعيد',
         'قاص',
         'ناء'], 
   'علماء': [
           'ربانيون',
           'علماء'], 
   'إملاق': [
           'خصاصة',
           'عيلة',
           'فقر',
           'إملاق'], 
   'ابتلاء': [
            'ابتلاء',
            'اختبار',
            'غرام',
            'تمحيص'], 
   'بيعة': [
          'إصر',
          'بيعة',
          'عقد',
          'عهد',
          'ميثاق'], 
   'لب': [
        'حجر',
        'حلم',
        'عقل',
        'فؤاد',
        'قلب',
        'لب',
        'نهى'], 
   'أخذ': [
         'أخذ',
         'سفع'], 
   'أخر': [
         'أخر',
         'نسأ'], 
   'علا': [
         'رفع',
         'رقي',
         'صعد',
         'عرج',
         'علا'], 
   'شكر': [
         'حمد',
         'شكر'], 
   'جدال': [
          'جدال',
          'حجاج',
          'مراء'], 
   'غر': [
        'خدع',
        'غر',
        'مكر'], 
   'جدث': [
         'جدث',
         'قبر'], 
   'مخمصة': [
           'جوع',
           'مخمصة',
           'مسغبة',
           'إملاق'], 
   'أكن': [
         'أخفى',
         'أسر',
         'كتم',
         'أكن'], 
   'طحا': [
         'سطح',
         'طحا',
         'مد'], 
   'كرب': [
         'أسي',
         'ابتأس',
         'بث',
         'حزن',
         'كرب'], 
   'جنف': [
         'جنح',
         'جنف',
         'ركن',
         'زاغ',
         'صغى',
         'عال',
         'ماد',
         'مال'], 
   'بائس': [
          'بائس',
          'مسكين',
          'معتر',
          'عائل',
          'فقير',
          'قانع',
          'مملق'], 
   'صديق': [
          'حميم',
          'خدن',
          'خليل',
          'صاحب',
          'صديق',
          'قرين',
          'ولي'], 
   'سفينة': [
           'جارية',
           'سفينة',
           'فلك',
           'ماخرة'], 
   'تلا': [
         'تلا',
         'قرأ'], 
   'رفع': [
         'رفع',
         'رقي',
         'صعد',
         'عرج',
         'علا'], 
   'الرحيم': [
            'الرحمن',
            'الرحيم'], 
   'مقت': [
         'بغضاء',
         'شنآن',
         'قلى',
         'كره',
         'مقت'], 
   'أزواج': [
           'أزواج',
           'نساء'], 
   'عير': [
         'إبل',
         'عير'], 
   'فرقان': [
           'مخرج',
           'سبيل',
           'فرقان'], 
   'قسطاس': [
           'قسطاس',
           'ميزان'], 
   'فتنة': [
          'شقاق',
          'ضلال',
          'غواية',
          'فتنة'], 
   'وجل': [
         'خشية',
         'خوف',
         'رجاء',
         'رهبة',
         'فزع',
         'وجف',
         'وجل'], 
   'رفث': [
         'رفث',
         'أفضى'], 
   'طاقة': [
          'استطاعة',
          'طاقة',
          'قبل',
          'قوة',
          'قدرة',
          'مرة'], 
   'لحق': [
         'تبع',
         'أتبع',
         'اتبع',
         'قص',
         'قفا',
         'لحق'], 
   'هلاك': [
          'بعد',
          'بوار',
          'تبار',
          'تدمير',
          'هلاك'], 
   'جبهة': [
          'جبين',
          'جبهة'], 
   'خلق': [
         'أنام',
         'بشر',
         'برية',
         'جبلة',
         'خلق',
         'ناس'], 
   'حول': [
         'حجة',
         'حول',
         'سنة',
         'عام'], 
   'عاقر': [
          'عاقر',
          'عقيم'], 
   'فج': [
        'جدد',
        'حبك',
        'ريع',
        'سبيل',
        'صراط',
        'طريق',
        'فج',
        'نجد'], 
   'يبقي': [
          'يبقي',
          'يترك',
          'يفرط',
          'يدع',
          'يذر'], 
   'فر': [
        'أبق',
        'فر',
        'ناص',
        'هرب'], 
   'ريع': [
         'جدد',
         'حبك',
         'ريع',
         'سبيل',
         'صراط',
         'طريق',
         'فج',
         'نجد'], 
   'سراح': [
          'سراح',
          'طلاق',
          'فراق'], 
   'سراء': [
          'سراء',
          'نعماء'], 
   'تم': [
        'تم',
        'كمل'], 
   'عصبة': [
          'ثبات',
          'ثلة',
          'حزب',
          'رهط',
          'زمرة',
          'شرذمة',
          'طائفة',
          'عصبة',
          'فئة',
          'فريق',
          'فوج',
          'نفر',
          'موالي'], 
   'عزم': [
         'عزم',
         'هم'], 
   'إمام': [
          'إمام',
          'رقيم',
          'مسطور',
          'سفر',
          'قط',
          'كتاب',
          'لوح'], 
   'شرذمة': [
           'ثبات',
           'ثلة',
           'حزب',
           'رهط',
           'زمرة',
           'شرذمة',
           'طائفة',
           'عصبة',
           'فئة',
           'فريق',
           'فوج',
           'نفر',
           'موالي'], 
   'صابر': [
          'حليم',
          'سيد',
          'صابر'], 
   'إثم': [
         'إثم',
         'جرم',
         'حنث',
         'حوب',
         'ذنب',
         'خطيئة',
         'معصية',
         'عنت',
         'وزر'], 
   'هبط': [
         'أخبت',
         'خشع',
         'خضع',
         'نزل',
         'هبط'], 
   'حوب': [
         'إثم',
         'جرم',
         'حنث',
         'حوب',
         'ذنب',
         'خطيئة',
         'معصية',
         'عنت',
         'وزر'], 
   'منع': [
         'صد',
         'منع'], 
   'الإنكار': [
             'الجحد',
             'الإنكار'], 
   'نفس': [
         'روح',
         'نفس'], 
   'جناح': [
          'جناح',
          'يد'], 
   'نفر': [
         'اشمأز',
         'نفر'], 
   'حرام': [
          'حرام',
          'سحت'], 
   'طائفة': [
           'ثبات',
           'ثلة',
           'حزب',
           'رهط',
           'زمرة',
           'شرذمة',
           'طائفة',
           'عصبة',
           'فئة',
           'فريق',
           'فوج',
           'نفر',
           'موالي'], 
   'جسم': [
         'بدن',
         'جسم',
         'جسد'], 
   'أقسم': [
          'آتى',
          'ائتلى',
          'حلف',
          'أقسم',
          'يمين'], 
   'وهن': [
         'ضعف',
         'وهن'], 
   'حجاج': [
          'جدال',
          'حجاج',
          'مراء'], 
   'سوءة': [
          'سوءة',
          'عورة'], 
   'كسب': [
         'ربح',
         'غنيمة',
         'فيء',
         'كسب'], 
   'هبة': [
         'صدقة',
         'عطية',
         'نحلة',
         'هبة',
         'هدية'], 
   'حجاب': [
          'برزخ',
          'حجاب',
          'حاجز',
          'ستر',
          'غطاء'], 
   'حصر': [
         'حرج',
         'حصر',
         'ضاق'], 
   'سكينة': [
           'حلم',
           'سكينة',
           'وقار'], 
   'أفسدها': [
            'دساها',
            'أفسدها'], 
   'جنح': [
         'جنح',
         'جنف',
         'ركن',
         'زاغ',
         'صغى',
         'عال',
         'ماد',
         'مال'], 
   'فعل': [
         'صنع',
         'فعل',
         'عمل'], 
   'سحت': [
         'حرام',
         'سحت'], 
   'جنة': [
         'جنة',
         'سعر',
         'سفاهة',
         'سوء'], 
   'حياة': [
          'حياة',
          'عيش'], 
   'وجد': [
         'ثقف',
         'ألفى',
         'لقي',
         'وجد'], 
   'الموتة': [
            'الصاعقة',
            'الموتة'], 
   'صفح': [
         'ستر',
         'صفح',
         'عفا',
         'غطى',
         'كفر',
         'كند',
         'محا'], 
   'مريء': [
          'مريء',
          'هنيء'], 
   'لاأبرح': [
            'لاأبرح',
            'لاأزال'], 
   'نور': [
         'ضياء',
         'نور'], 
   'حصب': [
         'حصب',
         'حطب']}