# uncompyle6 version 3.7.4
# Python bytecode 2.4 (62061)
# Decompiled from: Python 3.6.9 (default, Apr 18 2020, 01:56:04) 
# [GCC 8.4.0]
# Embedded file name: build\bdist.win32\egg\turbogears\i18n\data\fa_AF.py
# Compiled at: 2011-03-26 09:19:59
languages = {'nl': 'هالندی', 'pt': 'پرتگالی', 'no': 'نارویژی', 'hr': 'کروشیایی', 'ne': 'نیپالی', 'is': 'آیسلندی', 'mn': 'مغلی', 'ko': 'کوریایی', 'it': 'ایتالوی', 'ja': 'جاپانی', 'fa': 'دری', 'pl': 'پولندی', 'ga': 'آیرلندی', 'tg': 'تاجکی', 'fi': 'فنلندی', 'ky': 'قرغزی', 'sv': 'سویدنی', 'id': 'اندونیزیایی', 'es': 'هسپانوی'}
countries = {'BD': 'بنگله\u200cدیش', 'BE': 'بلجیم', 'BG': 'بلغاریا', 'BA': 'بوسنیا و هرزه\u200cگوینا', 'BN': 'برونی', 'BO': 'بولیویا', 'JP': 'جاپان', 'WS': 'ساموآی غربی', 'BR': 'برازیل', 'BS': 'بهاماس', 'BY': 'روسیهٔ سفید', 'RW': 'روآندا', 'RO': 'رومانیا', 'GW': 'گینیا بیسائو', 'GT': 'گواتیمالا', 'GQ': 'گینیا استوایی', 'GY': 'گیانا', 'GD': 'گرینادا', 'GN': 'گینیا', 'HR': 'کروشیا', 'HT': 'هایتی', 'SV': 'السلوادور', 'HN': 'هاندوراس', 'VE': 'ونزویلا', 'PT': 'پرتگال', 'PY': 'پاراگوای', 'PA': 'پانامه', 'PG': 'پاپوا نیو گینیا', 'PE': 'پیرو', 'PL': 'پولند', 'EE': 'استونیا', 'ZA': 'افریقای جنوبی', 'EC': 'اکوادور', 'ET': 'ایتوپیا', 'ZW': 'زیمبابوی', 'ES': 'هسپانیه', 'ER': 'اریتریا', 'MG': 'مادغاسکر', 'UY': 'یوروگوای', 'MN': 'منگولیا', 'US': 'ایالات متحدهٔ امریکا', 'MT': 'مالتا', 'MR': 'موریتانیا', 'MY': 'مالیزیا', 'MX': 'مکسیکو', 'MZ': 'موزمبیق', 'FI': 'فنلند', 'FM': 'میکرونزیا', 'NI': 'نیکاراگوا', 'NL': 'هالند', 'NO': 'ناروی', 'NG': 'نیجریا', 'NZ': 'زیلاند جدید', 'NP': 'نیپال', 'CH': 'سویس', 'CO': 'کولمبیا', 'CL': 'چلی', 'CG': 'کانگو', 'CF': 'افریقای مرکزی', 'CD': 'جمهوری دموکراتیک کانگو', 'CR': 'کاستریکا', 'CU': 'کیوبا', 'KG': 'قرغزستان', 'KE': 'کینیا', 'KH': 'کمپوچیا', 'KN': 'سنت کیتس و نیویس', 'KM': 'کومور', 'ST': 'سائو تومه و پرینسیپ', 'SK': 'سلواکیا', 'KR': 'کوریای جنوبی', 'SI': 'سلونیا', 'KP': 'کوریای شمالی', 'SO': 'سومالیه', 'SN': 'سینیگال', 'SL': 'سیرالیون', 'SB': 'جزایر سلومون', 'SG': 'سینگاپور', 'SE': 'سویدن', 'DK': 'دنمارک', 'YU': 'یوگوسلاویا', 'LK': 'سریلانکا', 'LV': 'لاتویا', 'LT': 'لتوانیا', 'TJ': 'تاجکستان', 'LS': 'لیسوتو', 'LY': 'لیبیا', 'VC': 'سنت وینسنت و گرینادین', 'AE': 'امارات متحدهٔ عربی', 'AD': 'اندورا', 'AG': 'انتیگوا و باربودا', 'IS': 'آیسلند', 'AL': 'البانیا', 'AO': 'انگولا', 'AR': 'ارجنتاین', 'AU': 'آسترالیا', 'IE': 'آیرلند', 'ID': 'اندونیزیا', 'UA': 'اکراین'}
months = [
 'جنوری', 'فبروری', 'مارچ', 'اپریل', 'می', 'جون', 'جولای', 'اگست', 'سپتمبر', 'اکتوبر', 'نومبر', 'دسمبر']
abbrMonths = [
 'جنو', 'فبر', 'مار', 'اپر', 'مـی', 'جون', 'جول', 'اگس', 'سپت', 'اکت', 'نوم', 'دسم']
days = [
 'دوشنبه', 'سه\u200cشنبه', 'چهارشنبه', 'پنج\u200cشنبه', 'جمعه', 'شنبه', 'یک\u200cشنبه']
abbrDays = [
 'د.', 'س.', 'چ.', 'پ.', 'ج.', 'ش.', 'ی.']
dateFormats = {'medium': '%Y/%m/%d', 'full': '%%(dayname)s، %d %%(monthname)s %Y', 'long': '%d %%(monthname)s %Y', 'short': '%Y/%m/%d'}
numericSymbols = {'group': '٬', 'nativeZeroDigit': '۰', 'exponential': '×۱۰^', 'perMille': '‰', 'nan': '�', 'decimal': '٫', 'percentSign': '٪', 'list': ';', 'patternDigit': '#', 'plusSign': '+', 'infinity': '∞', 'minusSign': '−'}