# uncompyle6 version 3.7.4
# Python bytecode 2.4 (62061)
# Decompiled from: Python 3.6.9 (default, Apr 18 2020, 01:56:04) 
# [GCC 8.4.0]
# Embedded file name: build\bdist.win32\egg\turbogears\i18n\data\ps_AF.py
# Compiled at: 2011-03-26 09:19:59
languages = {'el': 'یوناني', 'en': 'انګلیسي', 'zh': 'چیني', 'it': 'ایټالوي', 'ar': 'عربي', 'et': 'حبشي', 'ine': 'هند و اروپایي', 'ps': 'پښتو', 'pt': 'پورتګالي', 'la': 'لاتیني', 'tt': 'تاتار', 'tk': 'ترکمني', 'tg': 'تاجک', 'pl': 'پولنډي', 'fr': 'فرانسوي', 'hy': 'ارمني', 'ku': 'کردي', 'ru': 'روسي', 'de': 'الماني', 'fa': 'فارسي', 'hi': 'هندي', 'fi': 'فینلنډي', 'ja': 'جاپانی', 'he': 'عبري', 'mg': 'ملغاسي', 'uz': 'ازبکي', 'sa': 'سنسکریټ', 'mn': 'مغولي', 'sv': 'سویډنی', 'mk': 'مقدوني', 'ms': 'ملایا', 'bal': 'بلوڅي'}
countries = {'BD': 'بنګله\u200cدیش', 'FR': 'فرانسه', 'BG': 'بلغاریه', 'DK': 'ډنمارک', 'RU': 'روسیه', 'NO': 'ناروې', 'DE': 'المان', 'JP': 'جاپان', 'HU': 'مجارستان', 'HK': 'هانکانګ', 'GT': 'ګواتیمالا', 'DZ': 'الجزایر', 'GN': 'ګیانا', 'FI': 'فنلینډ', 'GR': 'یونان', 'IS': 'آیسلینډ', 'NI': 'نکاراګوا', 'RW': 'روندا', 'LB': 'لبنان', 'PT': 'پورتګال', 'LA': 'لاوس', 'NG': 'نایجیریا', 'NZ': 'نیوزیلنډ', 'LR': 'لایبریا', 'CU': 'کیوبا', 'MN': 'مغولستان', 'NL': 'هالېنډ', 'NP': 'نیپال', 'PK': 'پاکستان', 'YE': 'یمن', 'EG': 'مصر', 'PL': 'پولنډ', 'LY': 'لیبیا', 'CH': 'سویس', 'CO': 'کولمبیا', 'CN': 'چین', 'AF': 'افغانستان', 'IQ': 'عراق', 'PS': 'فلسطین', 'CA': 'کاناډا', 'AL': 'البانیه', 'AO': 'انګولا', 'IT': 'ایټالیه', 'AQ': 'انتارکتیکا', 'GB': 'برتانیه', 'IN': 'هند', 'ET': 'حبشه', 'TJ': 'تاجکستان', 'ID': 'اندونیزیا', 'ES': 'هسپانیه', 'GH': 'ګانا', 'SY': 'سوریه', 'MA': 'مراکش', 'JM': 'جمیکا', 'KH': 'کمبودیا', 'SV': 'سالوېډور', 'UY': 'یوروګوای', 'KW': 'کویټ', 'HN': 'هانډوراس', 'SA': 'سعودی عربستان', 'TZ': 'تنزانیا', 'MY': 'مالیزیا', 'SE': 'سویډن', 'AT': 'اتریش'}
months = [
 'جنوري', 'فبروري', 'مارچ', 'اپریل', 'می', 'جون', 'جولای', 'اګست', 'سپتمبر', 'اکتوبر', 'نومبر', 'دسمبر']
abbrMonths = [
 'جنو', 'فبر', 'مار', 'اپر', 'مـی', 'جون', 'جول', 'اګس', 'سپت', 'اکت', 'نوم', 'دسم']
days = [
 'دوشنبه', 'سه\u200cشنبه', 'چهارشنبه', 'پنجشنبه', 'جمعه', 'شنبه', 'یکشنبه']
abbrDays = [
 'د.', 'س.', 'چ.', 'پ.', 'ج.', 'ش.', 'ی.']
dateFormats = {'medium': '%d %%(monthname)s %Y', 'full': '%%(dayname)s د %Y د %%(monthname)s %d', 'long': 'د %Y د %%(monthname)s %d', 'short': '%Y/%m/%d'}
numericSymbols = {'group': '٬', 'nativeZeroDigit': '۰', 'exponential': '×۱۰^', 'perMille': '‰', 'nan': '�', 'decimal': '٫', 'percentSign': '٪', 'list': ';', 'patternDigit': '#', 'plusSign': '+', 'infinity': '∞', 'minusSign': '−'}