# uncompyle6 version 3.7.4
# Python bytecode 2.5 (62131)
# Decompiled from: Python 3.6.9 (default, Apr 18 2020, 01:56:04) 
# [GCC 8.4.0]
# Embedded file name: build\bdist.win32\egg\sorrex\colors.py
# Compiled at: 2009-01-05 20:51:53
import re
dics = {}
dics['html_140'] = [
 [
  '000000', 'f0f8ff', '008b8b', 'ffffe0', 'ff7f50', '696969', 'e6e6fa', '008080', 'fafad2',
  'ff6347', '808080', 'b0c4de', '2f4f4f', 'fffacd', 'ff4500', 'a9a9a9', '778899', '006400',
  'f5deb3', 'ff0000', 'c0c0c0', '708090', '008000', 'deb887', 'dc143c', 'd3d3d3', '4682b4',
  '228b22', 'd2b48c', 'c71585', 'dcdcdc', '4169e1', '2e8b57', 'f0e68c', 'ff1493', 'f5f5f5',
  '191970', '3cb371', 'ffff00', 'ff69b4', 'ffffff', '000080', '66cdaa', 'ffd700', 'db7093',
  'fffafa', '00008b', '8fbc8f', 'ffa500', 'ffc0cb', 'f8f8ff', '0000cd', '7fffd4', 'f4a460',
  'ffb6c1', 'fffaf0', '0000ff', '98fb98', 'ff8c00', 'd8bfd8', 'faf0e6', '1e90ff', '90ee90',
  'daa520', 'ff00ff', 'faebd7', '6495ed', '00ff7f', 'cd853f', 'ff00ff', 'ffefd5', '00bfff',
  '00fa9a', 'b8860b', 'ee82ee', 'ffebcd', '87cefa', '7cfc00', 'd2691e', 'dda0dd', 'ffe4c4',
  '87ceeb', '7fff00', 'a0522d', 'da70d6', 'ffe4b5', 'add8e6', 'adff2f', '8b4513', 'ba55d3',
  'ffdead', 'b0e0e6', '00ff00', '800000', '9932cc', 'ffdab9', 'afeeee', '32cd32', '8b0000',
  '9400d3', 'ffe4e1', 'e0ffff', '9acd32', 'a52a2a', '8b008b', 'fff0f5', '00ffff', '556b2f',
  'b22222', '800080', 'fff5ee', '00ffff', '6b8e23', 'cd5c5c', '4b0082', 'fdf5e6', '40e0d0',
  '808000', 'bc8f8f', '483d8b', 'fffff0', '48d1cc', 'bdb76b', 'e9967a', '8a2be2', 'f0fff0',
  '00ced1', 'eee8aa', 'f08080', '9370db', 'f5fffa', '20b2aa', 'fff8dc', 'fa8072', '6a5acd',
  'f0ffff', '5f9ea0', 'f5f5dc', 'ffa07a', '7b68ee'],
 {'alphabet': [
               {'black': 0, 'aliceblue': 1, 'darkcyan': 2, 'lightyellow': 3, 'coral': 4, 'dimgray': 5, 
                  'lavender': 6, 'teal': 7, 'lightgoldenrodyellow': 8, 'tomato': 9, 'gray': 10, 
                  'lightsteelblue': 11, 'darkslategray': 12, 'lemonchiffon': 13, 'orangered': 14, 
                  'darkgray': 15, 'lightslategray': 16, 'darkgreen': 17, 'wheat': 18, 'red': 19, 
                  'silver': 20, 'slategray': 21, 'green': 22, 'burlywood': 23, 'crimson': 24, 'lightgrey': 25, 
                  'steelblue': 26, 'forestgreen': 27, 'tan': 28, 'mediumvioletred': 29, 'gainsboro': 30, 
                  'royalblue': 31, 'seagreen': 32, 'khaki': 33, 'deeppink': 34, 'whitesmoke': 35, 
                  'midnightblue': 36, 'mediumseagreen': 37, 'yellow': 38, 'hotpink': 39, 
                  'white': 40, 'navy': 41, 'mediumaquamarine': 42, 'gold': 43, 'palevioletred': 44, 
                  'snow': 45, 'darkblue': 46, 'darkseagreen': 47, 'orange': 48, 'pink': 49, 
                  'ghostwhite': 50, 'mediumblue': 51, 'aquamarine': 52, 'sandybrown': 53, 'lightpink': 54, 
                  'floralwhite': 55, 'blue': 56, 'palegreen': 57, 'darkorange': 58, 'thistle': 59, 
                  'linen': 60, 'dodgerblue': 61, 'lightgreen': 62, 'goldenrod': 63, 'magenta': 64, 
                  'antiquewhite': 65, 'cornflowerblue': 66, 'springgreen': 67, 'peru': 68, 'fuchsia': 69, 
                  'papayawhip': 70, 'deepskyblue': 71, 'mediumspringgreen': 72, 'darkgoldenrod': 73, 
                  'violet': 74, 'blanchedalmond': 75, 'lightskyblue': 76, 'lawngreen': 77, 
                  'chocolate': 78, 'plum': 79, 'bisque': 80, 'skyblue': 81, 'chartreuse': 82, 
                  'sienna': 83, 'orchid': 84, 'moccasin': 85, 'lightblue': 86, 'greenyellow': 87, 
                  'saddlebrown': 88, 'mediumorchid': 89, 'navajowhite': 90, 'powderblue': 91, 
                  'lime': 92, 'maroon': 93, 'darkorchid': 94, 'peachpuff': 95, 'paleturquoise': 96, 
                  'limegreen': 97, 'darkred': 98, 'darkviolet': 99, 'mistyrose': 100, 
                  'lightcyan': 101, 'yellowgreen': 102, 'brown': 103, 'darkmagenta': 104, 
                  'lavenderblush': 105, 'cyan': 106, 'darkolivegreen': 107, 'firebrick': 108, 
                  'purple': 109, 'seashell': 110, 'aqua': 111, 'olivedrab': 112, 'indianred': 113, 
                  'indigo': 114, 'oldlace': 115, 'turquoise': 116, 'olive': 117, 'rosybrown': 118, 
                  'darkslateblue': 119, 'ivory': 120, 'mediumturquoise': 121, 'darkkhaki': 122, 
                  'darksalmon': 123, 'blueviolet': 124, 'honeydew': 125, 'darkturquoise': 126, 
                  'palegoldenrod': 127, 'lightcoral': 128, 'mediumpurple': 129, 'mintcream': 130, 
                  'lightseagreen': 131, 'cornsilk': 132, 'salmon': 133, 'slateblue': 134, 'azure': 135, 
                  'cadetblue': 136, 'beige': 137, 'lightsalmon': 138, 'mediumslateblue': 139}], 
    'katakana': [
               {'ブラック': 0, 'アリスブルー': 1, 'ダークシアン': 2, 'ライトイエロー': 3, 'コーラル': 4, 
                  'ディムグレイ': 5, 'ラベンダー': 6, 'テール': 7, 'ライトゴールデンロッドイエロー': 8, 
                  'トマト': 9, 'グレイ': 10, 'ライトスチールブルー': 11, 'ダークステートグレイ': 12, 
                  'レモンシフォン': 13, 'オレンジレッド': 14, 'ダークグレイ': 15, 'ライトステートグレイ': 16, 
                  'ダークグリーン': 17, 'ウィート': 18, 'レッド': 19, 'シルバー': 20, 
                  'ステートグレイ': 21, 'グリーン': 22, 'バーリーウッド': 23, 'クリムゾン': 24, 
                  'ライトグレイ': 25, 'スチールブルー': 26, 'フォレストグリーン': 27, 'タン': 28, 
                  'ミディアムバイオレットレッド': 29, 'ゲインズボロー': 30, 'ロイヤルブルー': 31, 'シーグリーン': 32, 
                  'カーキー': 33, 'ディープピンク': 34, 'ホワイトスモーク': 35, 'ミッドナイトブルー': 36, 
                  'ミディアムシーグリーン': 37, 'イエロー': 38, 'ホットピンク': 39, 'ホワイト': 40, 
                  'ネイビー': 41, 'ミディアムアクアマリン': 42, 'ゴールド': 43, 'ペールバイオレットレッド': 44, 
                  'スノウ': 45, 'ダークブルー': 46, 'ダークシーグリーン': 47, 'オレンジ': 48, 
                  'ピンク': 49, 'ゴーストホワイト': 50, 'ミディアムブルー': 51, 'アクアマリン': 52, 
                  'サンディブラウン': 53, 'ライトピンク': 54, 'フローラルホワイト': 55, 'ブルー': 56, 
                  'ペールグリーン': 57, 'ダークオレンジ': 58, 'シスル': 59, 'リネン': 60, 
                  'ドジャーブルー': 61, 'ライトグリーン': 62, 'ゴールデンロッド': 63, 'マゼンダ': 64, 
                  'アンティークホワイト': 65, 'コーンフラワーブルー': 66, 'スプリンググリーン': 67, 'ペール': 68, 
                  'フクシャ': 69, 'パパイヤホイップ': 70, 'ディープスカイブルー': 71, 'ミディアムスプリンググリーン': 72, 
                  'ダークゴールデンロッド': 73, 'バイオレット': 74, 'ブランチアーモンド': 75, 'ライトスカイブルー': 76, 
                  'ラワングリーン': 77, 'チョコレート': 78, 'プラム': 79, 'ビスク': 80, 
                  'スカイブルー': 81, 'シャトルーズ': 82, 'シェンナ': 83, 'オーキッド': 84, 
                  'モカシン': 85, 'ライトブルー': 86, 'グリーンイエロー': 87, 'サドルブラウン': 88, 
                  'ミディアムオーキッド': 89, 'ナバホホワイト': 90, 'パウダーブルー': 91, 'ライム': 92, 
                  'マルーン': 93, 'ダークオーキッド': 94, 'ピーチパフ': 95, 'ペールターゴイス': 96, 
                  'ライムグリーン': 97, 'ダークレッド': 98, 'ダークバイオレット': 99, 'ミスティローズ': 100, 
                  'ライトシアン': 101, 'イエローグリーン': 102, 'ブラウン': 103, 'ダークマゼンダ': 104, 
                  'ラベンダーブラシ': 105, 'シアン': 106, 'ダークオリーブグリーン': 107, 'ファイアブリック': 108, 
                  'パープル': 109, 'シーシェル': 110, 'アクア': 111, 'オリーブドラブ': 112, 
                  'インディアンレッド': 113, 'インディゴ': 114, 'オールドレース': 115, 'ターゴイス': 116, 
                  'オリーブ': 117, 'ロージーブラウン': 118, 'ダークステートブルー': 119, 'アイボリー': 120, 
                  'ミディアムターゴイス': 121, 'ダークカーキ': 122, 'ダークサーモン': 123, 'ブルーバイオレット': 124, 
                  'ハニーデュー': 125, 'ダークターゴイス': 126, 'ペールゴールデンロッド': 127, 'ライトコーラル': 128, 
                  'ミディアムパープル': 129, 'ミントクリーム': 130, 'ライトシーグリーン': 131, 'コーンシルク': 132, 
                  'サーモン': 133, 'ステートブルー': 134, 'アズール': 135, 'カデットブルー': 136, 
                  'ベージュ': 137, 'ライトサーモン': 138, 'ミディアムステートブルー': 139}]}]
dics['jpTraditional_465_shoku'] = [
 [
  '7b6c3e', '8a3b00', 'dccb18', '683f36', '664032',
  'e9e4d4', 'f3f3f3', 'eae5e3', '74325c', '16160e'],
 {'hiragana': [
               {'こくぼうしょく': 0, 'かっしょく': 1, 'りょくおうしょく': 2, 'せっかっしょく': 3, 'ちゃかっしょく': 4, 'かいはくしょく': 5, 
                  'にゅうはくしょく': 6, 'そしょく': 7, 'あんこうしょく': 8, 'あんこくしょく': 9}], 
    'kanji': [
            {'国防色': 0, 
               '褐色': 1, '緑黄色': 2, '赤褐色': 3, '茶褐色': 4, '灰白色': 5, '乳白色': 6, '素色': 7, 
               '暗紅色': 8, '暗黒色': 9}]}]
dics['jpTraditional_465_iro'] = [
 [
  'fef4f4', '96514d', '006e54', 'deb068', 'd3a243', '38b48b', 'bf794e', 'f6bfbc',
  'bc763c', 'd0af4c', 'f5b1aa', 'efab93', 'b77b57', '767c6b', 'f2a0a1', 'cc7eb1',
  'cca6bf', 'f09199', 'f4b3c2', 'eebbcb', 'a86f4c', '946243', '5b7e91', 'c8c2c6',
  '917347', '426579', 'e5abbe', '726250', 'a69abd', '9d896c', 'a89dac', 'e198b4',
  '94846a', 'd8a373', '95859c', 'cd5e3c', 'd6c6af', '4d4c61', 'c97586', 'c37854',
  'bfa46f', 'c38743', '9e9478', 'eaedf7', '634950', 'c39143', 'e8ecef', 'bf783a',
  'dcd3b2', 'bce2e8', 'b55233', 'a19361', '8f8667', 'abced8', 'e95295', 'a0d8ef',
  'e7609e', '9f563a', '89c3eb', 'd4dcd6', 'd0576b', '84a2d4', 'a69425', 'd3cbc6',
  'e9546b', '965042', 'c8c2be', '965036', '938b4b', '698aab', '95483f', '008899',
  '00a3af', '8f2e14', '726d40', '8a3319', '928c36', '59b9c6', '887f7a', '2ca9e1',
  'd7cf3a', '38a1db', 'c5c56a', 'd3381c', 'c3d825', '2792c3', '8c6450', '762f07',
  'e0ebaf', '752100', 'd8e698', '6c3524', 'c7dc68', '6f514c', 'b7282e', '4c6cb3',
  '7b8d42', '3e62ad', '69821b', '1e50a2', '543f32', '554738', 'b0ca71', 'f8f4e6',
  '640125', 'b9d08b', 'ede4cd', 'f8b862', '839b5c', '165e83', 'f6ad49', 'cee4ae',
  'ebe1a9', 'f08300', 'a8c97f', '223a70', 'fffffc', 'e4dc8a', 'ec6d51', 'f7fcfe',
  'ed6d3d', 'fbfaf5', 'a8bf93', 'ec6800', '769164', 'fff1cf', 'ee7800', 'bbc8e6',
  'fddea5', 'bbbcde', 'fce2c4', '8491c3', 'fde8d0', 'eb6101', 'e49e61', '4d5aaf',
  'e45e32', 'f4dda5', 'a3a3a2', 'f1bf99', 'dd7a56', '5654a2', '9ea1a3', 'f1bf99',
  'db8449', 'efcd9a', '68699b', '949495', 'efcd9a', 'ffd900', '867ba9', 'ffd900',
  '47885e', 'dbd0e6', '7d7d7d', '7b7c7d', 'e0c38c', 'ffec47', '68be8d', '7058a3',
  '727171', 'fef263', 'f7b977', 'fcd575', '007b43', '674196', 'f19072', 'fbd26b',
  '9079ad', '524e4d', 'f19072', 'f5e56b', '92b5a9', 'ee836f', 'eec362', '7ebea5',
  'ebd842', '7ebeab', '522f60', '2b2b2b', '383c3c', 'ffdb4f', 'fbca4d', '3b7960',
  '180614', 'fcc800', 'f8b500', '000b00', 'fabf14', '475950', 'bb5548', '005243',
  '55295b'],
 {'hiragana': [
               {'さくらいろ': 0, 'あずきいろ': 1, 'もえぎいろ': 2, 'あめいろ': 3, 'きくちばいろ': 4, 'ひすいいろ': 5, 
                  'らくだいろ': 6, 'にじいろ': 7, 'つちいろ': 8, 'からしいろ': 9, 'さんごいろ': 10, 
                  'ししいろ': 11, 'はじいろ': 12, 'やまばといろ': 13, 'こうばいいろ': 14, 'あやめいろ': 15, 
                  'べにふじいろ': 16, 'ももいろ': 17, 'ときいろ': 18, 'なでしこいろ': 19, 'くるみいろ': 20, 
                  'しぶかみいろ': 21, 'ますはないろ': 22, 'かすみいろ': 23, 'くちばいろ': 24, 'のしめはないろ': 25, 
                  'せきちくいろ': 26, 'かばちゃいろ': 27, 'はしたいろ': 28, 'うつぶしいろ': 29, 'うすいろ': 30, 
                  'ももはないろ': 31, 'なまかべいろ': 32, 'きゃらいろ': 33, 'はとばいろ': 34, 'かばいろ': 35, 
                  'あまいろ': 36, 'かちいろ': 37, 'ちょうしゅんいろ': 38, 'かわらけいろ': 39, 'はしばみいろ': 40, 
                  'きつねいろ': 41, 'あくいろ': 42, 'しろすみれいろ': 43, 'こきいろ': 44, 'おうどいろ': 45, 
                  'しらはないろ': 46, 'こはくいろ': 47, 'すないろ': 48, 'みずいろ': 49, 'れんがいろ': 50, 
                  'あぶらいろ': 51, 'りきゅういろ': 52, 'ひそくいろ': 53, 'つつじいろ': 54, 'そらいろ': 55, 
                  'ぼたんいろ': 56, 'かきしぶいろ': 57, 'わすれなぐさいろ': 58, 'そばきりいろ': 59, 'いまよういろ': 60, 
                  'あおふじいろ': 61, 'なたねゆいろ': 62, 'かれのいろ': 63, 'ばらいろ': 64, 'ちゃいろ': 65, 
                  'うるみいろ': 66, 'ひわだいろ': 67, 'ねぎしいろ': 68, 'うすはないろ': 69, 'とびいろ': 70, 
                  'なんどいろ': 71, 'あさぎいろ': 72, 'べんがらいろ': 73, 'みるいろ': 74, 'あかさびいろ': 75, 
                  'うぐいすいろ': 76, 'しんばしいろ': 77, 'すすいろ': 78, 'ひわいろ': 80, 
                  'つゆくさいろ': 81, 'まっちゃいろ': 82, 'ひいろ': 83, 'わかくさいろ': 84, 'はなだいろ': 85, 
                  'せんちゃいろ': 86, 'わかめいろ': 88, 'しゃくどういろ': 89, 'わかないろ': 90, 
                  'さびいろ': 91, 'わかなえいろ': 92, 'すすたけいろ': 93, 'あかねいろ': 94, 'ぐんじょういろ': 95, 
                  'くさいろ': 96, 'かきつばたいろ': 97, 'こけいろ': 98, 'るりいろ': 99, 'けんぽういろ': 100, 
                  'くりいろ': 101, 'なえいろ': 102, 'ぞうげいろ': 103, 'えびいろ': 104, 'わかばいろ': 105, 
                  'ねりいろ': 106, 'かんぞういろ': 107, 'まつばいろ': 108, 'あいいろ': 109, 'こうじいろ': 110, 
                  'なつむしいろ': 111, 'むしぐりいろ': 112, 'みかんいろ': 113, 'やなぎいろ': 114, 'こんいろ': 115, 
                  'ごふんいろ': 116, 'かれくさいろ': 117, 'えんたんいろ': 118, 'うのはないろ': 119, 'かきいろ': 120, 
                  'きなりいろ': 121, 'わさびいろ': 122, 'にんじんいろ': 123, 'おいたけいろ': 124, 'とりのこいろ': 125, 
                  'だいだいいろ': 126, 'あわふじいろ': 127, 'はちみついろ': 128, 'ふじいろ': 129, 'はだいろ': 130, 
                  'べにかけそらいろ': 131, 'うすたまごいろ': 132, 'しゅいろ': 133, 'こむぎいろ': 134, 'はないろ': 135, 
                  'にいろ': 136, 'とのこいろ': 137, 'うすずみいろ': 138, 'にくいろ': 139, 'にっけいいろ': 140, 
                  'ききょういろ': 141, 'すずいろ': 142, 'ひといろ': 143, 'あかくちばいろ': 144, 'ちょうじいろ': 145, 
                  'べにかけはないろ': 146, 'ねずみいろ': 147, 'こういろ': 148, 'たんぽぽいろ': 149, 'しおんいろ': 150, 
                  'きいろ': 151, 'ろくしょういろ': 152, 'しらふじいろ': 153, 'はいいろ': 154, 'なまりいろ': 155, 
                  'かれいろ': 156, 'なのはないろ': 157, 'わかたけいろ': 158, 'すみれいろ': 159, 'にびいろ': 160, 
                  'きはだいろ': 161, 'あんずいろ': 162, 'たまごいろ': 163, 'ときわいろ': 164, 'しょうぶいろ': 165, 
                  'しののめいろ': 166, 'はなばいろ': 167, 'りんどういろ': 168, 'けしずみいろ': 169, 'あけぼのいろ': 170, 
                  'かりやすいろ': 171, 'ちぐさいろ': 172, 'さんごしゅいろ': 173, 'とうもろこしいろ': 174, 'せいじいろ': 175, 
                  'かなりあいろ': 176, 'あおたけいろ': 177, 'ぶどういろ': 178, 'ろういろ': 179, 'ようかんいろ': 180, 
                  'きくちなしいろ': 181, 'くちなしいろ': 182, 'とくさいろ': 183, 'からすばいろ': 184, 'ひまわりいろ': 185, 
                  'やまぶきいろ': 186, 'ぬればいろ': 187, 'うこんいろ': 188, 'かわいろ': 189, 'べにかばいろ': 190, 
                  'てついろ': 191, 'くわのみいろ': 192}, {'あまいろ': 79, 'くりいろ': 87}], 
    'kanji': [
            {'桜色': 0, '小豆色': 1, '萌葱色': 2, '飴色': 3, '黄朽葉色': 4, '翡翠色': 5, '駱駝色': 6, '虹色': 7, 
               '土色': 8, '芥子色': 9, '珊瑚色': 10, '宍色': 11, '櫨色': 12, '山鳩色': 13, '紅梅色': 14, 
               '菖蒲色': 15, '紅藤色': 16, '桃色': 17, '鴇色': 18, '撫子色': 19, '胡桃色': 20, '渋紙色': 21, 
               '舛花色': 22, '霞色': 23, '朽葉色': 24, '熨斗目花色': 25, '石竹色': 26, '樺茶色': 27, '半色': 28, 
               '空五倍子色': 29, '薄色': 30, '桃花色': 31, '生壁色': 32, '伽羅色': 33, '鳩羽色': 34, '樺色': 35, 
               '亜麻色': 36, '褐色': 37, '長春色': 38, '土器色': 39, '榛色': 40, '狐色': 41, '灰汁色': 42, 
               '白菫色': 43, '濃色': 44, '黄土色': 45, '白花色': 46, '琥珀色': 47, '砂色': 48, '水色': 49, 
               '煉瓦色': 50, '油色': 51, '利休色': 52, '秘色色': 53, '躑躅色': 54, '空色': 55, '牡丹色': 56, 
               '柿渋色': 57, '勿忘草色': 58, '蕎麦切色': 59, '今様色': 60, '青藤色': 61, '菜種油色': 62, '枯野色': 63, 
               '薔薇色': 64, '茶色': 65, '潤色': 66, '檜皮色': 67, '根岸色': 68, '薄花色': 69, '鳶色': 70, 
               '納戸色': 71, '浅葱色': 72, '弁柄色': 73, '海松色': 74, '赤錆色': 75, '鶯色': 76, '新橋色': 77, 
               '煤色': 78, '天色': 79, '鶸色': 80, '露草色': 81, '抹茶色': 82, '緋色': 83, '若草色': 84, 
               '縹色': 85, '煎茶色': 86, '栗色': 87, '若芽色': 88, '赤銅色': 89, '若菜色': 90, '錆色': 91, 
               '若苗色': 92, '煤竹色': 93, '茜色': 94, '群青色': 95, '草色': 96, '杜若色': 97, '苔色': 98, 
               '瑠璃色': 99, '憲法色': 100, '涅色': 101, '苗色': 102, '象牙色': 103, '若葉色': 105, 
               '練色': 106, '萱草色': 107, '松葉色': 108, '藍色': 109, '柑子色': 110, '夏虫色': 111, '蒸栗色': 112, 
               '蜜柑色': 113, '柳色': 114, '紺色': 115, '胡粉色': 116, '枯草色': 117, '鉛丹色': 118, '卯の花色': 119, 
               '柿色': 120, '生成り色': 121, '山葵色': 122, '人参色': 123, '老竹色': 124, '鳥の子色': 125, '橙色': 126, 
               '淡藤色': 127, '蜂蜜色': 128, '藤色': 129, '肌色': 130, '紅掛空色': 131, '薄卵色': 132, '朱色': 133, 
               '小麦色': 134, '花色': 135, '丹色': 136, '砥粉色': 137, '薄墨色': 138, '肉色': 139, '肉桂色': 140, 
               '桔梗色': 141, '錫色': 142, '人色': 143, '赤朽葉色': 144, '丁子色': 145, '紅掛花色': 146, '鼠色': 147, 
               '香色': 148, '蒲公英色': 149, '紫苑色': 150, '黄色': 151, '緑青色': 152, '白藤色': 153, '灰色': 154, 
               '鉛色': 155, '枯色': 156, '菜の花色': 157, '若竹色': 158, '菫色': 159, '鈍色': 160, '黄檗色': 161, 
               '杏色': 162, '卵色': 163, '常磐色': 164, '東雲色': 166, '花葉色': 167, '竜胆色': 168, 
               '消炭色': 169, '曙色': 170, '刈安色': 171, '千草色': 172, '珊瑚朱色': 173, '玉蜀黍色': 174, '青磁色': 175, 
               '金糸雀色': 176, '青竹色': 177, '葡萄色': 178, '蝋色': 179, '羊羹色': 180, '黄支子色': 181, '支子色': 182, 
               '木賊色': 183, '烏羽色': 184, '向日葵色': 185, '山吹色': 186, '濡羽色': 187, '鬱金色': 188, '革色': 189, 
               '紅樺色': 190, '鉄色': 191, '桑の実色': 192}, {'菖蒲色': 165}, {'葡萄色': 104}]}]
dics['jpTraditional_465_cya'] = [
 [
  '8d6449', 'c89932', 'b98c46', '8b968d', '43676b', '5a544b', '56564b', '1f3134',
  'ae7c4f', '555647', 'ad7e4e', '494a41', '6b6f59', '474b42', '956f29', '8c7042',
  'e09e87', 'cd8c5c', '716246', 'a59564', '715c1f', 'bb5535', 'aa4f37', '9f563a',
  '887938', '6a5d21', '918754', '98623c', 'b3ada0', '8c8861', '954e2a', 'a1a46d',
  'b4866b', 'a16d5d', '773c30', '783c1d', '9f6f55', '765c47', '6f4b3e', 'a73836',
  '6d3c32', '583822', '6c2c2f', 'f39800', 'ddbb99', 'e17b34', '474a4d', 'ca8269',
  '241a08'],
 {'hiragana': [
               {'やまぶきちゃ': 1, 'まめがらちゃ': 3, 'おめしちゃ': 4, 'みるちゃ': 5, 
                  'あいみるちゃ': 6, 'ももしおちゃ': 7, 'びわちゃ': 8, 'あいこびちゃ': 9, 'しかんちゃ': 10, 
                  'いわいちゃ': 12, 'せんさいちゃ': 13, 'くわちゃ': 14, 'ろこうちゃ': 15, 
                  'ときがらちゃ': 16, 'えどちゃ': 17, 'こびちゃ': 18, 'りきゅうちゃ': 19, 'うぐいすちゃ': 20, 
                  'あかちゃ': 21, 'すずめちゃ': 22, 'だんじゅうろうちゃ': 23, 'ばいこうちゃ': 24, 'りかんちゃ': 25, 
                  'きみるちゃ': 26, 'はいちゃ': 27, 'りきゅうしろちゃ': 28, 'ひわちゃ': 29, 'かきちゃ': 30, 
                  'やなぎちゃ': 31, 'ちょうじちゃ': 32, 'そうでんからちゃ': 33, 'からちゃ': 35, 
                  'とのちゃ': 36, 'きがらちゃ': 37, 'こげちゃ': 38, 'べにえびちゃ': 39, 'くりかわちゃ': 40, 
                  'くろちゃ': 41, 'えびちゃ': 42, 'きんちゃ': 43, 'しらちゃ': 44, 'きちゃ': 45, 
                  'あいすみちゃ': 46, 'えんしゅうちゃ': 47, 'けんぽうくろちゃ': 48}, {'からちゃ': 0, 'きがらちゃ': 2, 'せんさいちゃ': 11, 'えびちゃ': 34}], 
    'kanji': [
            {'枯茶': 0, '山吹茶': 1, '黄唐茶': 2, '豆がら茶': 3, '御召茶': 4, '海松茶': 5, '藍海松茶': 6, '百入茶': 7, 
               '枇杷茶': 8, '藍媚茶': 9, '芝翫茶': 10, '千歳茶': 11, '岩井茶': 12, '仙斎茶': 13, '桑茶': 14, 
               '路考茶': 15, 'ときがら茶': 16, '江戸茶': 17, '媚茶': 18, '利休茶': 19, '鶯茶': 20, '赤茶': 21, 
               '雀茶': 22, '団十郎茶': 23, '梅幸茶': 24, '璃寛茶': 25, '黄海松茶': 26, '灰茶': 27, '利休白茶': 28, 
               '鶸茶': 29, '柿茶': 30, '柳茶': 31, '丁子茶': 32, '宗伝唐茶': 33, '海老茶': 34, '唐茶': 35, 
               '砺茶': 36, '黄枯茶': 37, '焦茶': 38, '紅海老茶': 39, '栗皮茶': 40, '黒茶': 41, '葡萄茶': 42, 
               '金茶': 43, '白茶': 44, '黄茶': 45, '藍墨茶': 46, '遠州茶': 47, '憲法黒茶': 48}]}]
dics['jpTraditional_465'] = [
 [
  'e6b422', '895b8a', 'fdeff2', 'd9a62e', '00a381', '824880', 'e9dfe5', '915c8b',
  'e4d2d8', '00a497', '9d5b8b', '80aba9', '7a4171', '5c9291', 'bc64a4', 'f5b199',
  'b79b5b', '6e7955', '478384', 'b44c97', 'aa4c8f', 'b68d4c', '888e7e', '80989b',
  'f0908d', 'ad7d4c', '2c4f54', 'ee827c', 'ad7d4c', 'c4a3bf', '47585c', 'e7e7eb',
  '485859', 'dcd6d9', 'ae7c58', '6c848d', 'd3cfd9', 'e8d3c7', '53727d', 'd3ccd6',
  'e8d3d1', '333631', 'e6cde3', '5b6356', 'a6a5c4', '4c6473', 'e597b2', '455765',
  '44617b', '9790a4', 'e4ab9b', '897858', '393f4c', '9e8b8e', '393e4f', 'd69090',
  'cbb994', '203744', '95949a', 'd4acad', 'cb8347', '71686c', 'eaf4fc', '705b67',
  'c099a0', 'b88884', '5f414b', 'b48a76', 'ebf6f7', '4f455c', 'a86965', 'c7b370',
  'c1e4e9', '5a5359', 'a25768', 'bb5520', '594255', 'ec6d71', 'a2d7dd', '524748',
  'eb6ea5', '513743', 'e6eae3', '9a493f', 'd4dcda', 'c85179', '83ccd2', 'ada250',
  '84b9cb', 'e95464', 'c85554', 'a99e93', 'c53d43', 'a58f86', 'e83929', '2a83a2',
  '928178', 'e60033', 'e2041b', 'd7003a', '852e19', 'b28c6e', 'c9171e', '7b4741',
  '0095d9', '0094c8', 'ce5242', 'b8d200', 'd9333f', '007bbb', '856859', 'b94047',
  '5383c3', 'ba2636', 'ba2636', '5a79ba', '99ab4e', '544a47', '9e3d3f', 'a22041',
  'aacf53', '507ea4', 'a22041', '19448e', '433d3c', '164a84', '432f2f', '3f312b',
  '274a78', '302833', '82ae46', '2a4073', 'ffffff', 'f2f2b0', '9ba88d', '192f60',
  'f8e58c', 'ee7948', 'c8d5bb', '1c305c', 'f8fbf8', 'c1d8ac', '0f2350', 'd7a98c',
  'ec6800', '17184b', 'f2c9ac', '0d0015', 'f3f3f2', 'd6e9ca', 'eb6238', '93ca76',
  'e5e4e6', 'ea5506', '93b881', 'dcdddd', 'ea5506', 'badcad', '8491c3', 'dddcd6',
  'f9c89b', '97a791', '4d5aaf', 'c0c6c9', 'f7bd8f', '98d98e', 'afafb0', 'f6b894',
  '88cb7f', '4a488e', 'adadad', '69b076', '4d4398', '6b7b6e', 'bed2c3', '706caa',
  '9fa0a0', 'd66a35', '93b69c', 'a6c8b2', '888084', 'f0cfa0', 'edd3a1', 'ffea00',
  '316745', 'a59aca', 'f3bf88', '3eb370', '674598', '595857', '595455', 'bed3ca',
  '745399', '65318e', 'eb9b6f', 'e0815e', '028760', '493759', '2b2b2b', 'df7163',
  '2e2930', 'd57c6b', '2f5d50', '884898', '281a14', 'd0826c', '3a5b52', 'c0a2c7',
  '460e44', '250d00', 'f7c114', '00552e', 'ab6953', 'e6b422'],
 {'hiragana': [
               {'こがね': 0, 'こだいむらさき': 1, 'うすざくら': 2, 'はじぞめ': 3, 'はなろくしょう': 4, 'なすこん': 5, 
                  'さくらねず': 6, 'ふたあい': 7, 'ときねず': 8, 'あおみどり': 9, 'きょうむらさき': 10, 
                  'みずあさぎ': 11, 'えびぞめ': 12, 'さびあさぎ': 13, 'わかむらさき': 14, 'いっこんぞめ': 15, 
                  'くわぞめ': 16, 'きくじん': 17, 'せいへき': 18, 'べにむらさき': 19, 'うめむらさき': 20, 
                  'きつるばみ': 21, 'りきゅうねずみ': 22, 'みなとねずみ': 23, 'うすべに': 24, 'ちょうじぞめ': 25, 
                  'こうらいなんど': 26, 'じんざもみ': 27, 'こうぞめ': 28, 'あさむらさき': 29, 'さびねず': 30, 
                  'むらさきすいしょう': 31, 'さびてつおなんど': 32, 'うすうめねず': 33, 'こがれこう': 34, 'あいねず': 35, 
                  'あかつきねず': 36, 'はいうめ': 37, 'さびおなんど': 38, 'ぼたんねず': 39, 'はいざくら': 40, 
                  'くろみどり': 41, 'あわべにふじ': 42, 'やなぎすすたけ': 43, 'ふじねず': 44, 'おめしおなんど': 45, 
                  'うすこうばい': 46, 'てつおなんど': 47, 'こんねず': 48, 'うすねず': 49, 'みずがき': 50, 
                  'ひごすすたけ': 51, 'あいてつ': 52, 'はとばねずみ': 53, 'あおかち': 54, 'あらぞめ': 55, 
                  'しろつるばみ': 56, 'かちかえし': 57, 'ききょうねず': 58, 'うすがき': 59, 'べにうこん': 60, 
                  'むらさきねず': 61, 'げっぱく': 62, 'ぶどうねずみ': 63, 'うめねず': 64, 'ときあさぎ': 65, 
                  'むらさきとび': 66, 'うめぞめ': 67, 'あいじろ': 68, 'こいねず': 69, 'すおうこう': 70, 
                  'もくらんじき': 71, 'しらあい': 72, 'ふじすすたけ': 73, 'あさすおう': 74, 'たいしゃ': 75, 
                  'けしむらさき': 76, 'まそお': 77, 'かめのぞき': 78, 'べにけしねずみ': 79, 'あかむらさき': 80, 
                  'にせむらさき': 81, 'はいきみどり': 82, 'べにとび': 83, 'うすくもねず': 84, 'なかべに': 85, 
                  'びゃくぐん': 86, 'あおくちば': 87, 'あさはなだ': 88, 'からくれない': 89, 'ぎんしゅ': 90, 
                  'ちゃねずみ': 91, 'あかべに': 92, 'くるみぞめ': 93, 'べにひ': 94, 'はなあさぎ': 95, 
                  'えどねず': 96, 'あか': 97, 'しょうじょうひ': 98, 'くれない': 99, 'くりうめ': 100, 
                  'ふしぞめ': 101, 'こきひ': 102, 'べにひはだ': 103, 'あお': 104, 'うすあい': 105, 
                  'あかに': 106, 'きみどり': 107, 'べにあか': 108, 'こんぺき': 109, 'ぎんすすだけ': 110, 
                  'えんじ': 111, 'うすぐんじょう': 112, 'あけ': 113, 'あけ': 114, 'うすはなざくら': 115, 
                  'あおに': 116, 'くろつるばみ': 117, 'すおう': 118, 'しんく': 119, 'もえぎ': 120, 
                  'うすはなだ': 121, 'こいくれない': 122, 'るりこん': 123, 'びんろうじぞめ': 124, 'こんるり': 125, 
                  'くろとび': 126, 'あかすみ': 127, 'せいらん': 128, 'くろべに': 129, 'ひわもえぎ': 130, 
                  'こきはなだ': 131, 'しろ': 132, 'おみなえし': 133, 'あおしろつるばみ': 134, 'こんじょう': 135, 
                  'たんこう': 136, 'おうに': 137, 'やなぎねず': 138, 'とめこん': 139, 'はくじ': 140, 
                  'うらはやなぎ': 141, 'こいあい': 142, 'あかしろつるばみ': 143, 'きあか': 144, 'てつこん': 145, 
                  'あらいがき': 146, 'しっこく': 147, 'しろねり': 148, 'びゃくろく': 149, 'てりがき': 150, 
                  'しらうめねず': 152, 'あかだいだい': 153, 'やなぎぞめ': 154, 'しろねず': 155, 
                  'きんあか': 156, 'うすもえぎ': 157, 'べにみどり': 158, 'きぬねず': 159, 'ゆうおう': 160, 
                  'ふかがわねずみ': 161, 'こんききょう': 162, 'はいあお': 163, 'しゃれがき': 164, 'わかみどり': 165, 
                  'ぎんねず': 166, 'あかこう': 167, 'あさみどり': 168, 'こんあい': 169, 'うすにび': 170, 
                  'うすみどり': 171, 'べにききょう': 172, 'あおにび': 173, 'せいじねず': 174, 'ふじなんど': 175, 
                  'すねずみ': 176, 'こうろぜん': 177, 'うすあお': 178, 'さびせいじ': 179, 'げんじねず': 180, 
                  'うすき': 182, 'ちゅうき': 183, 'ちとせみどり': 184, 'ふじむらさき': 185, 
                  'うすこう': 186, 'みどり': 187, 'あおむらさき': 188, 'すみ': 189, 'どぶねずみ': 190, 
                  'ちぐさねず': 191, 'えどむらさき': 192, 'ほんむらさき': 193, 'こきくちなし': 194, 'そひ': 195, 
                  'ときわみどり': 196, 'ふかむらさき': 197, 'くろ': 198, 'うすきひ': 199, 'しこく': 200, 
                  'まそほ': 201, 'びろうど': 202, 'むらさき': 203, 'てつぐろ': 204, 'あらいしゅ': 205, 
                  'むしあお': 206, 'うすぶどう': 207, 'しこん': 208, 'こくたん': 209, 'とうおう': 210, 
                  'ふかみどり': 211, 'そほ': 212, 'こんじき': 213}, {'うすもえぎ': 151, 'うすこう': 181}], 
    'kanji': [
            {'黄金': 0, '古代紫': 1, '薄桜': 2, '櫨染': 3, '花緑青': 4, '茄子紺': 5, '桜鼠': 6, '二藍': 7, 
               '鴇鼠': 8, '青緑': 9, '京紫': 10, '水浅葱': 11, '蒲葡': 12, '錆浅葱': 13, '若紫': 14, 
               '一斤染': 15, '桑染': 16, '麹塵': 17, '青碧': 18, '紅紫': 19, '梅紫': 20, '黄橡': 21, 
               '利休鼠': 22, '湊鼠': 23, '薄紅': 24, '丁字染': 25, '高麗納戸': 26, '甚三紅': 27, '香染': 28, 
               '浅紫': 29, '錆鼠': 30, '紫水晶': 31, '錆鉄御納戸': 32, '薄梅鼠': 33, '焦香': 34, '藍鼠': 35, 
               '暁鼠': 36, '灰梅': 37, '錆御納戸': 38, '牡丹鼠': 39, '灰桜': 40, '黒緑': 41, '淡紅藤': 42, 
               '柳煤竹': 43, '藤鼠': 44, '御召御納戸': 45, '薄紅梅': 46, '鉄御納戸': 47, '紺鼠': 48, '薄鼠': 49, 
               '水柿': 50, '肥後煤竹': 51, '藍鉄': 52, '鳩羽鼠': 53, '青褐': 54, '退紅': 55, '白橡': 56, 
               '褐返': 57, '桔梗鼠': 58, '薄柿': 59, '紅鬱金': 60, '紫鼠': 61, '月白': 62, '葡萄鼠': 63, 
               '梅鼠': 64, '鴇浅葱': 65, '紫鳶': 66, '梅染': 67, '藍白': 68, '濃鼠': 69, '蘇芳香': 70, 
               '木蘭色': 71, '白藍': 72, '藤煤竹': 73, '浅蘇芳': 74, '代赭': 75, '滅紫': 76, '真朱': 77, 
               '瓶覗': 78, '紅消鼠': 79, '赤紫': 80, '似せ紫': 81, '灰黄緑': 82, '紅鳶': 83, '薄雲鼠': 84, 
               '中紅': 85, '白群': 86, '青朽葉': 87, '浅縹': 88, '韓紅': 89, '銀朱': 90, '茶鼠': 91, 
               '赤紅': 92, '胡桃染': 93, '紅緋': 94, '花浅葱': 95, '江戸鼠': 96, '赤': 97, '猩々緋': 98, 
               '紅': 99, '栗梅': 100, '柴染': 101, '深緋': 102, '紅檜皮': 103, '青': 104, '薄藍': 105, 
               '赤丹': 106, '黄緑': 107, '紅赤': 108, '紺碧': 109, '銀煤竹': 110, '臙脂': 111, '薄群青': 112, 
               '緋': 113, '朱': 114, '薄花桜': 115, '青丹': 116, '黒橡': 117, '蘇芳': 118, '真紅': 119, 
               '萌黄': 120, '薄縹': 121, '濃紅': 122, '瑠璃紺': 123, '檳榔子染': 124, '紺瑠璃': 125, '黒鳶': 126, 
               '赤墨': 127, '青藍': 128, '黒紅': 129, '鶸萌黄': 130, '深縹': 131, '白': 132, '女郎花': 133, 
               '青白橡': 134, '紺青': 135, '淡黄': 136, '黄丹': 137, '柳鼠': 138, '留紺': 139, '白磁': 140, 
               '裏葉柳': 141, '濃藍': 142, '赤白橡': 143, '黄赤': 144, '鉄紺': 145, '洗柿': 146, '漆黒': 147, 
               '白練': 148, '白緑': 149, '照柿': 150, '淡萌黄': 151, '白梅鼠': 152, '赤橙': 153, '柳染': 154, 
               '白鼠': 155, '金赤': 156, '薄萌葱': 157, '紅碧': 158, '絹鼠': 159, '雄黄': 160, '深川鼠': 161, 
               '紺桔梗': 162, '灰青': 163, '洒落柿': 164, '若緑': 165, '銀鼠': 166, '赤香': 167, '浅緑': 168, 
               '紺藍': 169, '薄鈍': 170, '薄緑': 171, '紅桔梗': 172, '青鈍': 173, '青磁鼠': 174, '藤納戸': 175, 
               '素鼠': 176, '黄櫨染': 177, '薄青': 178, '錆青磁': 179, '源氏鼠': 180, '薄香': 181, '浅黄': 182, 
               '中黄': 183, '千歳緑': 184, '藤紫': 185, '淡香': 186, '緑': 187, '青紫': 188, '墨': 189, 
               '丼鼠': 190, '千草鼠': 191, '江戸紫': 192, '本紫': 193, '深支子': 194, '纁': 195, '常磐緑': 196, 
               '深紫': 197, '黒': 198, '浅緋': 199, '紫黒': 200, '真赭': 201, '天鵞絨': 202, '紫': 203, 
               '鉄黒': 204, '洗朱': 205, '虫襖': 206, '薄葡萄': 207, '紫紺': 208, '黒壇': 209, '藤黄': 210, 
               '深緑': 211, '赭': 212, '金色': 213}]}]

def getColorCode(name, strict=False):
    if not strict:
        ret = getColorCode(name, True)
        if ret:
            return ret
        if re.search('\\w', name):
            return ''
        ret = getColorCode(name + '色', True)
        if ret:
            return ret
        ret = getColorCode(name + '茶', True)
        if ret:
            return ret
        ret = getColorCode(name + 'ちゃ', True)
        if ret:
            return ret
        ret = getColorCode(name + 'しょく', True)
        if ret:
            return ret
        ret = getColorCode(name + 'いろ', True)
        if ret:
            return ret
        return ''
    if not name:
        return ''
    for i in dics:
        dic = dics[i]
        cats = dic[1]
        for j in cats:
            cat = cats[j]
            for k in cat:
                if k.has_key(name):
                    n = k[name]
                    return '#' + dic[0][n]

    return ''


if '__main__' == __name__:
    print '= colors selftest ='
    tests = [
     [
      'darkcyan', '#008b8b'],
     [
      'テール', '#008080'],
     [
      'りょくおうしょく', '#dccb18'],
     [
      '暗黒色', '#16160e'],
     [
      'らくだいろ', '#bf794e'],
     [
      'あまいろ', '#d6c6af'],
     [
      '肌色', '#fce2c4'],
     [
      '葡萄色', '#522f60'],
     [
      'えどちゃ', '#cd8c5c'],
     [
      'からちゃ', '#783c1d'],
     [
      '遠州茶', '#ca8269'],
     [
      'さびてつおなんど', '#485859'],
     [
      '赭', '#ab6953']]
    for t in tests:
        name = t[0]
        correct = t[1]
        res = getColorCode(name)
        str = name + ': '
        if correct == res:
            print str + ' -> OK.'
        else:
            print str + ' -> NG.'

    print '= end ='