# uncompyle6 version 3.7.4
# Python bytecode 2.5 (62131)
# Decompiled from: Python 3.6.9 (default, Apr 18 2020, 01:56:04) 
# [GCC 8.4.0]
# Embedded file name: build/bdist.macosx-10.9-x86_64/egg/termprop/db/unicode6_2/normal.py
# Compiled at: 2014-01-03 07:56:47
import re
pattern_fullwidth = re.compile('^[ᄀ-ᅟ〈〉⺀-⺙⺛-⻳⼀-⿕⿰-⿻\u3000-〩〮-〾ぁ-ゖ゛-ヿㄅ-ㄭㄱ-ㆎ㆐-ㆺ㇀-㇣ㇰ-㈞㈠-㉇㉐-㋾㌀-\u4dbf一-ꒌ꒐-꓆ꥠ-ꥼ豈-舘並-龎︐-︙︰-﹒﹔-﹦﹨-﹫！-｠￠-￦가-힣\ufa6e\ufa6f\ufada]$')
pattern_combining = re.compile('^[̀-ͯ҃-҉֑-ׇֽֿׁׂׅׄ\u0600-\u0604ؐ-ًؚ-ٰٟۖ-\u06dd۟-۪ۤۧۨ-ۭ\u070fܑܰ-݊ަ-ް߫-߳ࠖ-࠙ࠛ-ࠣࠥ-ࠧࠩ-࡙࠭-࡛ࣤ-ࣾऀ-ंऺ़ु-ै्॑-ॗॢॣঁ়ু-ৄ্ৢৣਁਂ਼ੁੂੇੈੋ-੍ੑੰੱੵઁં઼ુ-ૅેૈ્ૢૣଁ଼ିୁ-ୄ୍ୖୢୣஂீ்ా-ీె-ైొ-్ౕౖౢౣ಼ಿೆೌ್ೢೣു-ൄ്ൢൣ්ි-ුූัิ-ฺ็-๎ັິ-ູົຼ່-ໍཱ༹༘༙༵༷-ཾྀ-྄྆྇ྍ-ྗྙ-ྼ࿆ိ-ူဲ-့္်ွှၘၙၞ-ၠၱ-ၴႂႅႆႍႝᅠ-ᇿ፝-፟ᜒ-᜔ᜲ-᜴ᝒᝓᝲᝳ឴឵ិ-ួំ៉-៓៝᠋-᠍ᢩᤠ-ᤢᤧᤨᤲ᤹-᤻ᨘᨗᩖᩘ-ᩞ᩠ᩢᩥ-ᩬᩳ-᩿᩼ᬀ-ᬃ᬴ᬶ-ᬺᬼᭂ᭫-᭳ᮀᮁᮢ-ᮥᮨᮩ᯦᮫ᯨᯩᯭᯯ-ᯱᰬ-ᰳᰶ᰷᳐-᳔᳒-᳢᳠-᳨᳭᳴᷀-ᷦ᷼-᷿\u200b-\u200f\u202a-\u202e\u2060-\u2064\u206a-\u206f⃐-⃰⳯-⵿⳱ⷠ-〪ⷿ-゙゚〭꙯-꙲ꙴ-꙽ꚟ꛰꛱ꠂ꠆ꠋꠥꠦ꣄꣠-꣱ꤦ-꤭ꥇ-ꥑꦀ-ꦂ꦳ꦶ-ꦹꦼꨩ-ꨮꨱꨲꨵꨶꩃꩌꪰꪲ-ꪴꪷꪸꪾ꪿꫁ꫬꫭ꫶ꯥꯨ꯭ﬞ︀-️︠-︦\ufeff\ufff9]$')