# uncompyle6 version 3.7.4
# Python bytecode 2.7 (62211)
# Decompiled from: Python 3.6.9 (default, Apr 18 2020, 01:56:04) 
# [GCC 8.4.0]
# Embedded file name: build/bdist.macosx-10.10-x86_64/egg/buddha/buddha.py
# Compiled at: 2017-05-11 07:47:56


class Buddha:
    buddha_dict = {'normal': '\n/*\n                   _ooOoo_\n                  o8888888o\n                  88" . "88\n                  (| -_- |)\n                  O\\  =  /O\n               ____/`---\'\\____\n             .\' / \\|     |//  `.\n            /  \\|||  :  |||//  \\\n           /  _||||| -:- |||||- \\\n           |   |  \\\\  -  /// |   |\n           | \\_|  \'\'\\---/\'\'  |   |\n           \\  .-\\__  `-`  ___/-. /\n         ___`. .\'  /--.--\\  `. . __\n      ."" \'<  `.___\\_<|>_/___.\'  >\'"".\n     | | :  `- \\`.;`\\ _ /`;.`/ - ` : | |\n     \\  \\ `-.   \\_ __\\ /__ _/   .-` /  /\n======`-.____`-.___\\_____/___.-`____.-\'======\n                   `=---=\'\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n         佛祖保佑       永无BUG\n*/\n//          佛曰:\n//                  写字楼里写字间，写字间里程序员；\n//                  程序人员写程序，又拿程序换酒钱。\n//                  酒醒只在网上坐，酒醉还来网下眠；\n//                  酒醉酒醒日复日，网上网下年复年。\n//                  但愿老死电脑间，不愿鞠躬老板前；\n//                  奔驰宝马贵者趣，公交自行程序员。\n//                  别人笑我忒疯癫，我笑自己命太贱；\n//                  不见满街漂亮妹，哪个归得程序员？\n'}

    def random_buddha(self):
        print self.buddha_dict['normal']


if __name__ == '__main__':
    buddha = Buddha()
    buddha.random_buddha()